//   {
//     "id": 32,
//     "title": "الدعاء إذا تقلب ليلاً",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "لا إله إلا الله الواحد القهار، ربُّ السموات والأرض وما بينهما العزيز الغفار",
//           "references": [
//             "يقول ذلك إذا تقلب من جنب إلى جنب في الليل . أخرجه الحاكم وصححه ووفقه الذهبي 1/ 540 والنسائي في اليوم والليلة وابن السني وانظر صحيح الجامع 4/213"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 33,
//     "title": "دعاء القلق والفزع في النوم ومن بلي بالوحشة",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "أعوذ بكلمات الله التَّامَّة من غضبه وعقابه، وشر عباده، ومن همزات الشياطين وأنْ يحضرون",
//           "references": [
//             " أبو داود 4/12 نظر صحيح الترمذي3/ 171"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 34,
//     "title": "ما يفعل من رأى الرؤيا أو الحلم",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "ينفث عن يساره",
//           "references": [
//             "مسلم4/1772"
//           ],
//           "readCount": 3
//         },
//         {
//           "descriptionTitle": "",
//           "description": "يستعيذ بالله من الشيطان ومن شر ما رأى",
//           "references": [
//             "مسلم4/1772- 1773"
//           ],
//           "readCount": 3
//         },
//         {
//           "descriptionTitle": "",
//           "description": "لا يحدث بها أحدا ",
//           "references": [
//             "مسلم4/1772"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "يتحول عن جنبه الذي كان عليه",
//           "references": [
//             "مسلم4/1773"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "يقوم يصلي إن أراد ذلك",
//           "references": [
//             "مسلم4/1773"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 35,
//     "title": "دعاء قنوت الوتر",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "اللهم اهدني فيمن هديت ، وعافني فيمن عافيت ، وتولني فيمن توليت ، وبارك لي فيما أعطيت ، وقني شر ما قضيت ، فإنك تقضي ولا يقضى عليك ، إنه لا يذل من واليت ،[ ولا يعز من عاديت ] تباركت ربنا وتعاليت ",
//           "references": [
//             "أخرجه أصحاب السنن الأربعة وأحمد والدرامي والحاكم والبيهقي وما بين المعكوفين للبيهقي وانظر صحيح الترمذي 1/144وصحيح ابن ماجه 1/194 وإرواء الغليل للألباني 2/172"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "اللهم إني أعوذ برضاك من سخطك وأعوذ بمعافاتك من عقوبتك ، وأعوذ بك منك لا أحصي ثناء عليك ، أنت كما أثنيت على نفسك",
//           "references": [
//             "أخرجه أصحاب السنن الأربعة وأحمد. انظر صحيح الترمذي 3/180وصحيح ابن ماجه 1/194 والإرواء 2/175"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "اللهم إياك نعبد ، ولك نُصلي ونسجد ، وإليك نسعى ونحفدُ ، نرجُو رحمتك ، ونخشى عذابك ، إن عذابك بالكافرين ملحق ، اللهم إنا نستعينك ، ونستغفرك ، ونثني عليك الخير ، ولا نكفرك ، ونؤمن بك ونخضع لك ، ونخلع من يكفرك",
//           "references": [
//             "أخرجه البيهقي في السنن الكبرى وصحح إسناده 2/211 وقال الشيخ الألباني في إرواء الغليل وهذا إسناد صحيح 2/170 .وهو موقوف على عمر"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 36,
//     "title": "الذكر عقب السلام من الوتر",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "كان رسول الله صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يقرأ في الوتر :( سَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى ) و ( وَقُلْ يَا أَيُّهَا الْكَافِرُونَ ) و ( وَقُلْ هُوَ اللَّهُ أَحَدٌ). فإذا سلم قال  سبحان الملك القدوس [رب الملائكة والروح ] ",
//           "references": [
//             "ثلاث مرات والثالثة يجهر بها ويمد بها صوته",
//             "رواه النسائي 3/244 والدار قطني وغيرهما وما بين المعكوفين زيادة للدار قطني 2/31 وإسناده صحيح .انظر زاد المعاد بتحقيق شعيب الأرناؤوط وعبد القادر الأرناؤوط 1/337"
//           ],
//           "readCount": 3
//         }
//       ]
//     }
//   },
//   {
//     "id": 37,
//     "title": "دعاء الهم والحزن",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "اللهم إني عبدك ابن عبدك ابن أمتك ناصيتي بيدك،ماضِ في حكمك ، عدل في قضاؤك ،أسألك بكل اسم هو لك سميت به نفسك أو أنزلته في كتابك ، أو علمته أحداً من خلقك أو استأثرت به في علم الغيب عندك أن تجعل القرآن ربيع قلبي ، ونور صدري ،وجلاء حزني وذهاب همي",
//           "references": [
//             "أحمد 1/391وصححه الألباني"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "اللهم إني أعوذ بك من الهم والحزن ، والعجز والكسل والبخل والجبن ، وضلع الدين وغلبة الرجال",
//           "references": [
//             "البخاري 7/158 كان رسول الله صلى الله عليه وسلم يكثر من هذا الدعاء"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 38,
//     "title": "دعاء الكرب",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "لاَ إِلَهَ إِلاَّ اللَّهُ الْعَظِيمُ الْحَلِيمُ، لاَ إِلَهَ إِلاَّ اللَّهُ رَبُّ الْعَرْشِ الْعَظِيمِ، لاَ إِلَهَ إِلاَّ اللَّهُ رَبُّ السَّمَوَاتِ وَرَبُّ الْأَرْضِ وَرَبُّ الْعَرْشِ الْكَرِيمِ",
//           "references": [
//             "البخاري 7/154ومسلم 4/ 2092"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "اللهم رحمتك أرجو فلا تكلني إلى نفسي طرفة عين ِ وأصلح لي شأني كله لا إله إلا أنت ",
//           "references": [
//             "أبو داود 4/324 وأحمد 5/42 وحسنه الألباني في صحيح أبو داود 3/ 959"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "لا إله إلا أنت سبحانك إني كنت من الظالمين",
//           "references": [
//             "الترمذي 5/529 والحاكم وصححه ووفقه الذهبي 1/505 وانظر صحيح الترمذي3/ 168"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "الله الله ربي لا أشرك به شيئاً",
//           "references": [
//             "أخرجه أبو داود 2/87 وانظر صحيح ابن ماجه 2/335"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 39,
//     "title": "دعاء لقاء العدو وذي السلطان",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "اللهم إنا نجعلك في نحورهم ونعوذ بك من شرورهم",
//           "references": [
//             "أبو داود 2/89 وصححه الحاكم ووافقه الذهبي 2/142"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "اللهم أنت عضُدي وأنت نصيري ، بك أحولُ ،وبك أصولُ ، وبك أُقاتلُ",
//           "references": [
//             "أبو داود 3/42 والترمذي 5/572 ،وانظر صحيح الترمذي3/183"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "حسبنا الله ونعم الوكيل",
//           "references": [
//             "البخاري 5/172"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 40,
//     "title": "دعاء من خاف ظلم السلطان",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "اللهم رب السموات السبع ،ورب العرش العظيم ،كن لي جاراً من فلان بن فلان ، وأحزابه من خلائقك ؛ أن يفرط على أحد منهم أو يطغى ، عز جارك ،وجل ثناؤك ،ولا إله إلا أنت ",
//           "references": [
//             "البخاري في الأدب المفرد برقم 707 وصححه الألباني وفي صحيح الأدب المفرد برقم 545"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "الله أكبر، الله أعز من خلقه جميعاً ، الله أعز مما أخاف وأحذر ،أعوذ بالله الذي لا إله إلا هو ، الممسك السموات السبع أن يقعن على الأرض إلا بإذنه ،من شر عبدك فلان ،وجنوده وأتباعه وأشياعه ، من الجن والأنس ، اللهم كن لي جاراً من شرهم ، جل ثناؤك وعز جارك ، وتبارك اسمك ، ولا إله غيرك",
//           "references": [
//             "البخاري في الأدب المفرد برقم 708 وصححه الألباني وفي صحيح الأدب المفرد برقم 546"
//           ],
//           "readCount": 3
//         }
//       ]
//     }
//   },
//   {
//     "id": 41,
//     "title": "الدعاء على العدو",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "اللهم منزل الكتاب ، سريع الحساب ،اهزم الأحزاب ،اللهم اهزمهم وزلزلهم",
//           "references": [
//             "مسلم 3/1362"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 42,
//     "title": "ما يقول من خاف قوماً",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "اللهم اكفنيهم بما شئت",
//           "references": [
//             "مسلم 4/2300"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 43,
//     "title": "دعاء من أصابه شك في الإيمان",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "يستعيذ بالله",
//           "references": [
//             "البخاري مع الفتح 6/336 ومسلم 1/120"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "ينتهي عما شك فيه",
//           "references": [
//             "البخاري مع الفتح 6/336 ومسلم 1/120"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "يقول: آمنت بالله ورسله",
//           "references": [
//             "مسلم 1/  119- 120"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "يقرأ قوله تعالى { هُوَ الْأَوَّلُ وَالْآخِرُ وَالظَّاهِرُ وَالْبَاطِنُ وَهُوَ بِكُلِّ شَيْءٍ عَلِيمٌ }",
//           "references": [
//             "سورة الحديد ، الآية :3 .أبو داود 4/329 وحسنه الألباني في صحيح أبو داود 3/962"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 44,
//     "title": "دعاء قضاء الدين",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "اللهم اكفني بحلالك عن حرامك ، وأغنني بفضلك عمن سواك ",
//           "references": [
//             "الترمذي 5/560 وانظر صحيح الترمذي3/ 180"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "اللهم إني أعوذ بك من الهم والحزن ، والعجز والكسل ،والبخل والجبن وضلع الدين وغلبة الرجال",
//           "references": [
//             "البخاري7/ 158"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 45,
//     "title": "دعاء الوسوسة في الصلاة والقراءة",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "أعوذ بالله من الشيطان الرجيم واتفل على يسارك",
//           "references": [
//             "مسلم 4/1729 من حديث عثمان بن العاص رضي الله عنه وفيه ففعلت ذلك فأذهبه الله عني"
//           ],
//           "readCount": 3
//         }
//       ]
//     }
//   },
//   {
//     "id": 46,
//     "title": "دعاء من استصعب عليه أمر",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "اللهم لا سهل إلا ما جعلته سهلاً وأنت تجعل الحزن إذا شئت سهلاً",
//           "references": [
//             "رواة ابن حبان في صحيحه برقم 2427 (موارد) وابن السني برقم 351 وقال الحافظ هذا حديث صحيح وصححه عبد القادر الأرناؤوط في تخريج الأذكار للنووي ص106"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 47,
//     "title": "ما يقول ويفعل من أذنب ذنباً",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "ما من عبدٍ يذنب ذنباً فيحسن الطهور ، ثم يقوم فيصلي ركعتين ، ثم يستغفر الله إلا غفر الله لهُ",
//           "references": [
//             "أبو داود 2/86 والترمذي 2/257 وصححه الألباني في صحيح أبي داود 1/ 283"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 48,
//     "title": "دعاء طرد الشيطان ووساوسه",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "الاستعاذة بالله منه",
//           "references": [
//             "أبو داود 1/206 والترمذي وانظر صحيح الترمذي 1/77 وانظر سورة المؤمنون آية 98-99"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "الأذان",
//           "references": [
//             "مسلم 1/ 291 والبخاري 1/151"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "الأذكار وقراءة القرآن",
//           "references": [
//             "لاتجعلوا بيوتكم مقابر إن الشيطان ينفر من البيت الذي تقرأ فيه سورة البقرة  رواه مسلم 1/539 ومما يطرد الشيطان أذكار الصباح والمساء ، والنوم والاستيقاظ ، وأذكار دخول المنزل والخروج منه وأذكار دخول المسجد والخروج منه وغير ذلك من الأذكار المشروعة مثل قراءة آية الكرسي عند النوم ، والآيتين الأخيرتين من سورة  البقرة ، ومن قال لا إله إلا الله وحده لا شريك له ،له الملك وله الحمد وهو على كل شيء قدير مائة مرة كانت له حرزاً من الشيطان يومه كله ،وكذا الأذان يطرد الشيطان"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 49,
//     "title": "الدعاء حينما يقع مالا يرضاه أو غلب على أمره",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "قدر الله وما شاء فعل ، إذا غلبك أمر فقل :  حسبي الله ونعم الوكيل",
//           "references": [
//             "المؤمن القوي خير وأحب إلى الله من المؤمن الضعف وفي كل خير ،احرص على ما ينفعك واستعن بالله ولا تعجز وإن أصابك شيء فلا تقل لو أني فعلت كذا وكذا ولكن قل قدر الله وما شاء فعل فإن لو تفتح عمل الشيطان  .مسلم 4/2052",
//             "انظر تخريج الأذكار للأرناؤوط ص 106"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 50,
//     "title": "تهنئة المولود له وجوابه",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "بارك الله لك في الموهوب لك ،وشكرت الواهب، وبلغ أشدهُ، ورزقت برهُ  .ويردُ عليه المهنأ فيقول :  بارك الله لك وبارك عليك ، وجزاك الله خيراً ، ورزقك الله مثله، وأجزل ثوابك",
//           "references": [
//             "انظر الأذكار للنووي ص349 وصحيح الأذكار للنووي ، لسليم الهلالي 2/713"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 51,
//     "title": "ما يعوذ به الأولاد",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "كان رسول الله صلى الله عليه وسلم يعوذ الحسن والحسين أعيذكما بكلمات الله التامة ، من كل شيطان وهامة ، ومن كل عينِ لامة",
//           "references": [
//             "البخاري 4/119 من حديث ابن عباس رضي الله عنهما"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 52,
//     "title": "الدعاء للمريض في عيادته",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "لا بأس طهور إن شاء الله",
//           "references": [
//             "البخاري مع الفتح 10/ 118"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "أسأل الله العظيم رب العرش العظيم أن يشفيك",
//           "references": [
//             "ما من عبد مسلم يعود مريضاً لم يحضر أجله فيقول: سبع مرات.....الحديث إلا عوفي . أخرجه الترمذي وأبو داود وانظر صحيح الترمذي2/ 210 وصحيح الجامع 5/180"
//           ],
//           "readCount": 7
//         }
//       ]
//     }
//   },
//   {
//     "id": 53,
//     "title": "فضل عيادة المريض",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "قال صلى الله عليه وسلم : إذا عاد الرجل أخاه المسلم مشى في خرافة الجنة حتى يجلس فإذا جلس غمرته الرحمة ، فإن كان غدوة صلى عليه سبعون ألف ملك حتى يمسي ، وإن كان مساء صلى عليه سبعون ألف ملك حتى يصبح",
//           "references": [
//             "رواه الترمذي وابن ماجه وأحمد وانظر صحيح ابن ماجه 1/244 وصحيح الترمذي 1/286 وصححه أيضاً أحمد شاكر"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 54,
//     "title": "دعاء المريض الذي يئس من حياته",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "اللهم اغفر لي وارحمني والحقني بالرفيق الأعلى",
//           "references": [
//             "البخاري 7/10 ومسلم 4/1893"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "جعل النبي صلى الله عليه وسلم يدخل يديه في الماء فيمسح بهما وجههُ ويقول : لا إله إلا الله إن للموت لسكرات",
//           "references": [
//             "البخاري مع الفتح 8/144وفي الحديث السواك"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "لا إله إلا الله والله أكبر ، لا إله إلا الله وحده ، لا إله إلا الله وحده لا شريك لهُ ، لا إله إلا الله لهُ الملك ولهُ الحمد ، لا إله إلا الله ولا حول ولا قوة إلا بالله",
//           "references": [
//             "أخرجه الترمذي وابن ماجه وصححه الألباني ، وانظر صحيح الترمذي 3/152وصحيح ابن ماجه 2/317"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 55,
//     "title": "تلقين المحتضر",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "من كان آخر كلامه لا إله إلا الله دخل الجنة",
//           "references": [
//             "أبو داود 3/190 وانظر صحيح الجامع 5/432"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 56,
//     "title": "دعاء من أصيب بمصيبة",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "إنا لله وإنا إليه راجعون اللهم أجرني في مصيبتي وأخلف لي خيراً منها",
//           "references": [
//             "مسلم 2/632"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 57,
//     "title": "الدعاء عند إغماض الميت",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "اللهم اغفر  لفلان ( باسمه) ورفع درجته في المهديين، واخلفه في عقبه في الغابرين، واغفر لنا وله يا رب العالمين ،وافسح له في قبره ونور له فيه",
//           "references": [
//             "مسلم 2/634"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 58,
//     "title": "الدعاء للميت في الصلاة عليه",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "اللهم اغفر له وارحمه، وعافه ،واعف عنه ،وأكرم نُزُله ، ووسع مُدخلهُ ، واغسله بالماء والثلج والبرد ، ونقه من الخطايا كما ينقى الثوب الأبيض من الدنس ، وأبدله داراً خيراً من داره ، وأهلاً خيراً من أهله وزوجاً خيراً من زوجه، وأدخله الجنة ،وأعذه من عذاب القبر ( ومن عذاب النار )",
//           "references": [
//             " مسلم 2/663"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "اللهم اغفر لحينا وميتنا ، وشاهدنا وغائبنا ، وصغيرنا وكبيرنا ، وذكرنا وأُنثانا ، اللهم من أحييته منا فأحيه على الإسلام ، ومن توفيته منا فتوفه على الإيمان ، اللهم لا تحرمنا أجره ولا تضلنا بعده",
//           "references": [
//             "ابن ماجه 1/480 وأحمد 2/368 وانظر صحيح ابن ماجة1/ 251"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "اللهم إن فلان بن فلان في ذمتك،وحبل جوارك،فقه من فتنة القبر وعذاب النار،وأنت أهل الوفاء والحق .فاغفر له وارحمهُ إنك أنت الغفور الرحيم",
//           "references": [
//             "أخرجه ابن ماجه ، وانظر صحيح ابن ماجة1/ 251ورواه أبو داود 3/211"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "اللهم عبدك وابن عبدك وابن أمتك احتاج إلى رحمتك ،وأنت غني عن عذابه،إن كان مُحسناً فزده في حسناته، وإن كان مُسيئاً فتجاوز عنه",
//           "references": [
//             "أخرجه الحاكم وصححه ووافقه الذهبي 1/359 وانظر أحكام الجنائز للألباني ص125"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 59,
//     "title": "الدعاء للفرط في الصلاة عليه",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "اللهم أعذه من عذاب القبر",
//           "references": [
//             "قال سعيد بن المسيب صليت وراء أبي هريرة على صبي لم يعمل خطيئة قط فسمعته يقول ... الحديث .أخرجه مالك في الموطأ 1/288 وابن أبي شيبه في المصنف 3/ 217 والبيهقي 4/9، وصحح إسناده شعيب الأرناؤوط في تحقيقه لشرح السنة للبغوي 5/357"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "أن قال : اللهم اجعله فرطاً وذخراً لوالديه ،وشفيعاً مجاباً .اللهم ثقل به موازينها وأعظم به أجورهما ، وألحقهُ بصالح المؤمنين ، واجعلهُ في كفالة إبراهيم ، وقه برحمتك عذاب الجحيم ، وأبدله داراً خيراً من داره ، وأهلاً خيراً من أهله ، اللهم اغفر لاسلافنا ، وأفراطنا ، ومن سبقنا بالإيمان  فحسن",
//           "references": [
//             "انظر : المغني لابن قدامة 3/416 والدروس المهمة لعامة الأمة للشيخ عبد العزيز بن عبد الله بن باز حفظه الله ص15"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "اللهم اجعله لنا فرطاً ،وسلفاً وأجراً",
//           "references": [
//             "كان الحسن يقرأ على الطفل بفاتحة الكتاب ويقول ..  الحديث أخرجه البغوي في شرح السنة 5/357وعبد الرزاق برقم 6588، وعلقه البخاري في كتاب الجنائز ، 65باب قراءة فاتحة الكتاب على الجنازة 2/113"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 60,
//     "title": "دعاء التعزية",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "إن لله ما أخذ وله ما أعطى . وكل شيء عنده بأجل مُسمى ...فلتصبر ولتحتسب وإن قال : أعظم الله أجرك ،وأحسن عزاءك وغفر لميتك  فحسن",
//           "references": [
//             "البخاري 2/80 ومسلم 2/636",
//             "الأذكار للنووي ص126"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 61,
//     "title": "دعاء عند إدخال الميت القبر",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "بسم الله وعلى سُنة رسول الله",
//           "references": [
//             "أبو داود 3/314بسند صحيح وأحمد بلفظ بسم الله وعلى ملة رسول الله وسنده صحيح"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 62,
//     "title": "دعاء بعد دفن الميت",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "اللهم اغفر له اللهم ثبته",
//           "references": [
//             "كان النبي صلى الله عليه وسلم إذا فرغ من دفن الميت وقف عليه فقال : استغفروا لأخيكم وسلوا له التثبيت فإنه الآن يُسأل .أبو داود 3/315 والحاكم وصححه ووافقه الذهبي 1/370"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 63,
//     "title": "دعاء زيارة القبور",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "السلام عليكم أهل الديار ، من المؤمنين والمسلمين، وإنا إن شاء الله بكم لاحقون [ ويرحم الله المُستقدمين منا والمستأخرين ] أسأل الله لنا ولكم العافية",
//           "references": [
//             "سلمم2/671 ،وابن ماجه واللفظ له 1/494 عن بريدة رضي الله عنه ، وما بين المعكوفين من حديث عائشة رضي الله عنها عند مسلم 2/671"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 64,
//     "title": "دعاء الريح",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "اللهم إني أسألك خيرها ، وأعوذ بك من شرها",
//           "references": [
//             "أخرجه أبو داود 4/326وابن ماجه 2/1228 وانظر  صحيح ابن ماجة2/ 305"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "اللهم إني أسألك خيرها ، وخير ما فيها ، وخير ما أُرسلت به ، وأعوذ بك من شرها وشر ما فيها وشر ما أرسلت به",
//           "references": [
//             "مسلم 2/616 والبخاري 4/76"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 65,
//     "title": "دعاء الرعد",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "سبحان الذي يُسبح الرعد بحمده والملائكة من خيفته",
//           "references": [
//             "كان عبد الله بن الزبير رضي الله عنهما إذا سمع الرعد ترك الحديث وقال :.... الموطأ 2/992 وقال الألباني صحيح الإسناد موقوفاً"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 66,
//     "title": "من أدعية الاستسقاء",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "اللهم اسقنا غيثاً مغيثاً مريئاً مَريعاً نافعاً غير ضار ، عاجلاً غير آجل",
//           "references": [
//             "أبو داود 1/303 وصححه الألباني في صحيح أبي داود1/ 216"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "اللهم أغثنا ، اللهم أغثنا ، اللهم أغثنا",
//           "references": [
//             "والبخاري 1/224 ،مسلم 2/613"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "اللهم اسق عبادك وبهائمك ، وانشر رحمتك وأحيي بلدك الميت",
//           "references": [
//             "أبو داود 1/305 وحسنه الألباني في صحيح أبي داود1/ 218"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 67,
//     "title": "الدعاء إذا نزل المطر",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "اللهم صيباً نافعاً",
//           "references": [
//             "البخاري مع الفتح 2/518"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 68,
//     "title": "من أدعية الاستصحاء",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "اللهم حوالينا ولا علينا ، اللهم على الآكامِ والظرابِ وبُطون الأودية ، ومنابت الشجر",
//           "references": [
//             "والبخاري 1/224 ،مسلم 2/614"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 69,
//     "title": "دعاء رؤية الهلال",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "الله أكبر ،اللهم أهلِه علينا بالأمن والإيمان ، والسلامة والإسلام ،والتوفيق لما تحب ربنا وترضى ، ربنا وربك الله",
//           "references": [
//             "الترمذي 5/504 والدارمي بلفظه 1/336 وانظر صحيح الترمذي3/ 157"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 70,
//     "title": "الدعاء عند إفطار الصائم",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "ذَهبَ الظَّمأُ، وابتلَّت العروقُ وثَبَتَ الأجرُ إنْ شاء الله",
//           "references": [
//             "أخرجه أبي داود 2/306 وغيره وانظر صحيح الجامع 4/209"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "اللهم إني أسألك برحمتك التي وسعت كل شيءٍ أن تغفر لي",
//           "references": [
//             "أخرجه ابن ماجه 1/557 من دعاء عبد الله بن عمرو رضي الله عنهما ،وحسنه الحافظ في تخريج الأذكار انظر شرح الأذكار 4/342"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 71,
//     "title": "الدعاء قبل الطعام",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "إذا أكل أحدكم الطعام فليقل: بِسم الله، فإن نسي في أوله فليقل: بِسمِ الله في أوله وآخره",
//           "references": [
//             "أخرجه أبو داود 3/347 والترمذي 4/288 وانظر صحيح الترمذي2/ 167"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "من أطعمه الله الطعام فليقل: اللهم بارك لنا فيه وأطعمنا خيراً منه. ومن سقاه الله لبناً فليقل: اللهم بارك لنا فيه وزدنا منه",
//           "references": [
//             "الترمذي 5/506 وانظر صحيح الترمذي3/ 158"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 72,
//     "title": "الدعاء عند الفراغ من الطعام",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "الحمد لله الذي أطعمني هذا ،وزرقنيه ،من غير حول مني ولا قوة",
//           "references": [
//             "أخرجه أصحاب السنن إلا النسائي وانظر صحيح الترمذي 3/159"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "الحمدُ لله حمداً كثيراً طيباً مباركاً فيهِ، غيْرَ [مَكْفيٍّ ولا] مُوَدَّع، ولا مُستَغنَى عَنْهُ ربّنا",
//           "references": [
//             "البخاري 6/‌214 والترمذي بلفظه 5/ 507"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 73,
//     "title": "دعاء الضيف لصاحب الطعام",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "اللهُمَّ بَارِكْ لَهُم فيما رَزَقتهْمْ، واغْفِر لهم وارحَمْهُم",
//           "references": [
//             "مسلم3/ 1626"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 74,
//     "title": "الدعاء لمن سقاه أو إذا أراد ذلك",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "اللهُمَّ أَطْعِمْ مَنْ أطْعَمَني وأَسْقِ مَنْ سْقَاني",
//           "references": [
//             "مسلم3/ 26"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 75,
//     "title": "الدعاء إذا أفطر عند أهل بيت",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "أَفطَر عِنْدَكُم الصائِمونَ ، وأكل طعامَكُمُ الأبْرارُ ، وصلت عليكُمُ الملائِكَةُ",
//           "references": [
//             "سنن أبي داود 3/367، وابن ماجه 1/556 ،والنسائي في عمل اليوم والليلة برقم 296- 298 ،ونص على أنه صلى الله عليه وسلم يقوله إذا أفطر عند أهل بيت ،وصححه الألباني في صحيح أبي داود 2/730"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 76,
//     "title": "دعاء الصائم إذا حضر الطعام ولم يفطر",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "إذا دُعي أحدكم فليجب ، فإن كان صائماً فليصل وإن كان مفطراً فليطعم",
//           "references": [
//             "ومعنى فليصل أي فليدع",
//             "مسلم 2/1054"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 77,
//     "title": "ما يقول الصائم إذا سابه أحد",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "إني صائم ، إني صائم",
//           "references": [
//             "البخاري مع الفتح 4/103 ،ومسلم 2/ 806"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 78,
//     "title": "الدعاء عند رؤية باكورة الثمر",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "اللهم بارك لنا في ثمرنا ، وبارك لنا في مدينتنا وبارك لنا في صاعنا ، وبارك لنا في مدنا",
//           "references": [
//             "مسلم 2/1000"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 79,
//     "title": "دعاء العطاس",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "إذا عطس أحدكم فليقل الحمد لله ،وليقل له أخوهُ أو صاحبهُ : يرحمك الله ،فإذا قال لهُ :يرحمك الله ،فليقل :يهديكم الله ويصلح بالكم",
//           "references": [
//             "البخاري 7/125"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 80,
//     "title": "ما يقالُ للكافر إذا عطس فحمد الله",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "يهديكم الله ويصلح بالكم",
//           "references": [
//             "الترمذي 5/82 وأحمد 4/400 وأبو داود 4/308، وانظر صحيح الترمذي 2/354"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 81,
//     "title": "الدعاء للمتزوج",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "بارك الله لك ، وبارك عليك ، وجمع بينكما في خير",
//           "references": [
//             "أخرجه أصحاب السنن إلا النسائي وانظر صحيح الترمذي 1/316"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 82,
//     "title": "دعاء المتزوج لنفسه ودعاء شراء الدابة",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "إذا تزوج أحدكم امرأة ،أو إذا اشترى خادماً فليقل : اللهم إني أسألك خيرها وخير ما جبلتها عليه وأعوذ بك من شرها وشر ما جبلتها عليه ، وإذا اشترى بعيراً فليأخذ بذروة سنامه وليقل مثل ذلك",
//           "references": [
//             "أبو داود 2/248 وابن ماجه 1/617 وانظر صحيح ابن ماجه 1/324"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 83,
//     "title": "الدعاء قبل إتيان الزوجة",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "بسم الله ، اللهم جنبنا الشيطان وجنب الشيطان ما رزقتنا",
//           "references": [
//             "البخاري 6/141 ومسلم 2/1028"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 84,
//     "title": "دعاء الغضب",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "أعوذ بالله من الشيطان الرجيم",
//           "references": [
//             "البخاري 6/99 ومسلم4/2015"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 85,
//     "title": "دعاء من رأى مبتلى",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "الحمد لله الذي عافاني مما ابتلاك به ، وفضلني على كثير ممن خلق تفضيلاً",
//           "references": [
//             "الترمذي 5/494 و5/493 وانظر  صحيح الترمذي3/ 153"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 86,
//     "title": "ما يقال في المجلس",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "عن ابن عمر قال : كان يعد لرسول الله صلى الله عليه وسلم في المجلس الواحد مائة مرة من قبل أن يقوم رب اغفر لي وتب علي إنك أنت التواب الغفور",
//           "references": [
//             "الترمذي وغيره وانظر صحيح الترمذي 3/153 وصحيح ابن ماجه 2/321 ولفظه للترمذي"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 87,
//     "title": "كفارة المجلس",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "سبحانك اللهم وبحمدك ، أشهد أن لا إله إلا أنت أستغفرك وأتوب إليك",
//           "references": [
//             "أخرجه أصحاب السنن وانظر صحيح الترمذي 3/153، وقد ثبت عن عائشة رضي الله عنها قالت :ما جلس رسول الله صلى الله عليه وسلم مجلساً ، ولاتلى قرآناً ، ولا صلاة إلا ختم ذلك بكلمات.... الحديث أخرجه النسائي في عمل اليوم والليلة برقم 308 ، وأحمد 6/77 وصححه الدكتور فاروق حمادة في تحقيقه لعمل اليوم والليلة للنسائي ص273",
//             "مايختم به جميع المجالس",
//             "عن عائشة رضي الله عنها قالت : ماجلس رسول الله صلى الله عليه وسلم مجلساً قط ، ولا تلا قرآناً ، ولا صلى صلاة إلا ختم ذلك بكلمات قالت : فقلت : يارسول الله أراك ما تجلس ( مجلساً ) ولا تتلو قرآنا ، ولا تصلي صلاة إلا ختمت بهؤلاء الكلمات ؟ قال : نعم ( من قال خيراً خُتم له طابع على ذلك الخير ، ومن قال شراً كن له كفارة ) ، (( سبحانك وبحمدك لا إله إلا أنت أستغفرك وأتوب إليك ))"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 88,
//     "title": "الدعاء لمن قال غفر الله لك",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "ولك",
//           "references": [
//             "أحمد 5/28 والنسائي في عمل اليوم والليلة ص218برقم 421 تحقيق الدكتور فاروق حمادة"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 89,
//     "title": "الدعاء لمن صنع إليك معروفاً",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "جَزَاكَ الله خيراً",
//           "references": [
//             "أخرجه الترمذي رقم 2035 وانظر صحيح الجامع 6244 وصحيح الترمذي2/ 200"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 90,
//     "title": "ما يعصم به من الدجال",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "من حفظ عشر آيات من أول سورة الكهف عصم من الدجال والاستعاذة بالله من فتنتة عقب التشهد الأخير من كل صلاة",
//           "references": [
//             "مسلم 1/555 وفي رواية من آخر الكهف 1/556",
//             "انظر حديث رقم 55 وحديث 56"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 91,
//     "title": "الدعاء لمن قال إني أحبك في الل",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "أحبك الذي أحببتني له",
//           "references": [
//             "أخرجه أبو داود 4/333، وحسنه الألباني في صحيح سنن أبي داود 3/965"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 92,
//     "title": "الدعاء لمن عرض عليك ماله",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "بارك الله لك في أهلك ومالك",
//           "references": [
//             "البخاري الفتح4/ 88"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 93,
//     "title": "الدعاء لمن أقرض عند القضاء",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "بارك الله لك في أهلك ومالك إنما جزاء السلف الحمد والأداء",
//           "references": [
//             "أخرجه النسائي في عمل اليوم والليلة ص 300 وابن ماجه 2/ 809 وانظر صحيح ابن ماجه 2/809 وانظر صحيح ابن ماجه 2/55"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 94,
//     "title": "دعاء الخوف من الشرك",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "اللهم إني أعوذ بك أن أشرك بك وأنا أعلم ، وأستغفرك لما لا أعلم",
//           "references": [
//             "أحمد 4/403 وغيره وانظر صحيح الجامع 3/333 وصحيح الترغيب والترهيب للألباني"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 95,
//     "title": "الدعاء لمن قال بارك الله فيك",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "وفيك بارك الله",
//           "references": [
//             "أخرجه ابن السني ص138 برقم 278 وانظر الوابل الصيب لابن القيم 304 تحقيق بشير محمد عيون"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 96,
//     "title": "دعاء كراهية الطيرة",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "اللهم لا طير إلا طيرك ، ولا خير إلا خيرك ،ولا إله غيرك",
//           "references": [
//             "أحمد 2/220 وابن السني برقم 292 وصححه الألباني في الأحاديث الصحيحة 3/54 رقم 1065 ، أما الفأل فكان يعجب النبي صلى الله عليه وسلم ؛ ولهذا سمع من رجل كلمة طيبة فأعجبته فقال : أخذنا فألك من فيك أبو داود وأحمد ،وصححه الألباني في الصحيحة2/363 عند أبي الشيخ في أخلاق النبي"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 97,
//     "title": "دعاء ركوب الدابة",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "بسم الله. الحمد لله. {سُبْحانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ * وَإِنَّا إِلَى رَبِّنَا لَمُنقَلِبُونَ} الحمد لله ، الحمد لله ، الحمد لله ، الله اكبر ، الله اكبر ، الله اكبر ، سبحانك اللهم إني ظلمت نفسي فاغفر لي ، فإنه لا يغفر الذنوب إلا أنت",
//           "references": [
//             "أبو داود 3/34 والترمذي 5/501 وانظر صحيح الترمذي3/ 156"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 98,
//     "title": "دعاء السفر",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "الله أكبر، الله أكبر، الله أكبر، {سُبْحانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ * وَإِنَّا إِلَى رَبِّنَا لَمُنقَلِبُونَ} اللهم إنا نسألُكَ في سفرنا هذا البرَّ والتقوى، ومن العمل ما ترضى، اللهم هون علينا سفرنا هذا واطو عنا بعده، اللهم أنت الصاحب في السفر، والخليفة في الأهل، اللهم إني أعوذ بك من وعْثاءِ السفر، وكآبة المنظر وسوء المنقلب في المال والأهل وإذا رجع قالهن وزاد فيهن آيبون، تائبون، عابدون، لربنا حامدون",
//           "references": [
//             "رواه مسلم2/ 978"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 99,
//     "title": "دعاء دخول القرية أو البلدة",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "اللهم رب السموات السبع وما أظللن ، ورب الأرضين السبع وما أقللن ،ورب الشياطين وما أضللن ، ورب الرياح وما ذرين.أسألك خير هذه القرية وخير أهلها ، وخير ما فيها،وأعوذ بك من شرها،وشر أهلها ، وشر ما فيها",
//           "references": [
//             "الحاكم وصححه ووافقه الذهبي 2/100 وابن السني برقم 524وحسنه الحافظ في تخريج الأذكار 5/154 قال ابن باز : ورواه النسائي بإسناد حسن . انظر تحفة الأخيار ص 37"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 100,
//     "title": "دعاء دخول السوق",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "لا إله إلا الله وحده لا شريك له ، له الملك وله الحمد ، يُحيي ويُميت ، وهو حي لا يموت ، بيده الخير وهو على كل شئ قدير",
//           "references": [
//             "الترمذي 5/491 والحاكم 1/538 وحسنه الألباني في صحيح ابن ماجه 2/21 وفي صحيح الترمذي3/ 152"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 101,
//     "title": "الدعاء إذا تعس المركوب",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "بسم الله",
//           "references": [
//             "أبو داود 4/296 وصححه الألباني في صحيح أبي داود 3/941"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 102,
//     "title": "دعاء المسافر للمقيم",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "أستودعُكَ الله الذي لا تضيع ودائعه",
//           "references": [
//             "أحمد 2/403 وابن ماجه 2/943 وانظر صحيح ابن ماجة2/ 133"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 103,
//     "title": "دعاء المقيم للمسافر",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "أستودع الله دينك وأمانتك ،وخواتيم عملك",
//           "references": [
//             "أحمد 2/7 الترمذي5/499  وانظر صحيح الترمذي3/ 155"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "زوَّدك الله التقوى، وغفر ذْنبك ويسَّر لك الخير حيث ما كنت",
//           "references": [
//             "الترمذي وانظر صحيح الترمذي3/ 155"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 104,
//     "title": "التكبير والتسبيح في سير السفر",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "قال جابر رضي الله عنه : كنا إذا صعدنا كبرنا ، وإذا نزلنا سبحنا",
//           "references": [
//             "البخاري الفتح6/ 135"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 105,
//     "title": "دعاء المسافر إذا أسحر",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "سَمعَ سَامعً بحمد الله وحُسنِ بلائه علينا، ربنا صاحبنا ، وأفضِل علينا عائذا بالله من النار",
//           "references": [
//             "مسلم4/ 2086 ومعني سمع سامع : أي شهد شاهد على حمدنا لله تعالى على نعمه وحسن بلائه . ومعني سمع سامع : بلغ سامع قولي هذا لغيره وقال مثله تنبيهاً على الذكر في السحر والدعاء . وقوله : ربنا صاحبنا وأفضل علينا : أي احفظنا وحطنا واكلأنا وأفضل علينا بجزيل نعمك واصرف عنا كل مكروه ، شرح النووي 17/39"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 106,
//     "title": "الدعاء إذا نزل منزلا في سفر أو غيره",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "أعوذ بكلمات الله التامات من شر ما خلق",
//           "references": [
//             "رواه مسلم4/2080"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 107,
//     "title": "ذكر الرجوع من السفر",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "يكبر على كل شرف ثلاث تكبيرات ثم يقول : لا إله إلا الله وحده لا شريك لهُ ،لهُ الملك ، ولهُ الحمدُ وهو على كل شيءٍ قدير ، آيبون ،تائبون ، عابدون ، لربنا حامدون ،صدق الله وعده،ونصر عبده، وهزم الأحزاب وحده",
//           "references": [
//             "كان النبي صلى الله عليه وسلم يقوله إذا قفل من غزو أو حج ، البخاري 7/163 ومسلم 2/ 980"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 108,
//     "title": "ما يقول ويفعل من أتاه أمر يسره أو يكرهه",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "كان صلى الله عليه وسلم إذا أتاه الأمر يسره قال : الحمد لله الذي بنعمته تتم الصالحات و إذا أتاه أمر يكرهه قال : الحمد لله على كل حال",
//           "references": [
//             "أخرجه ابن السني في عمل اليوم والليلة والحاكم وصححه 1/499 وصححه الألباني في صحيح الجامع 4/ 201"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 109,
//     "title": "فضل الصلاة على النبي صلى الله عليه وسلم",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "قال صلى الله عليه وسلم من صلى علي صلاة صلى الله عليه بها عشراً",
//           "references": [
//             "أخرجه مسلم 1/288"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "وقال صلى الله عليه وسلم : لا تجعلوا قبري عيداً وصلوا علي ؛ فإن صلاتكم تبلغني حيث كنتم",
//           "references": [
//             "أبو داود 2/218 وأحمد 2/367 وصححه الألباني في صحيح أبي داود 2/ 383"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "وقال صلى الله عليه وسلم : البخيل من ذكرت عندهُ فلم يصل علي",
//           "references": [
//             "الترمذي 5/551 وغيره وانظر صحيح الجامع 3/ 25 وصحيح الترمذي 3/ 177"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "وقال صلى الله عليه وسلم إن لله ملائكة سياحين في الأرض يبلغوني من أمتي السلام",
//           "references": [
//             "النسائي ،والحاكم 2/421 وصححه الألباني في صحيح النسائي 1/274"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "وقال صلى الله عليه وسلم ما من أحدٍ يسلِّمُ عليَّ إلَّا ردَّ اللَّهُ عليَّ روحي حتَّى أردَّ عليْهِ السَّلامَ",
//           "references": [
//             "أبو داود برقم 2041وحسنه الألباني في صحيح أبي داود 1/ 383"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 110,
//     "title": "إفشاء السلام",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "قال رسول الله صلى الله عليه وسلم : لا تدخلوا الجنة حتى تؤمنوا ، ولا تؤمنوا حتى تحابوا ، أو لا أدلكم على شيءٍ إذا فعلتموه تحاببتم ، أفشوا السلام بينكم",
//           "references": [
//             "مسلم 1/74 وغيره"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "ثلاث من جمعهن فقد جمع الإيمان : الإنصاف من نفسك ، وبذل السلام للعالم ،والإنفاق من الإقتار",
//           "references": [
//             "البخاري مع الفتح 1/ 82 عن عمار رضي الله عنه موقوفاً معلقاً"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "وعن عبد الله بن عمر رضي الله عنهما : أن رجلاً سأل النبي صلى الله عليه وسلم أي الإسلام خير قال : تطعم الطعام وتقرأ السلام على من عرفت ومن لم تعرف",
//           "references": [
//             "البخاري مع الفتح 1/55 ومسلم 1/65"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 111,
//     "title": "كيف يرد السلام على الكافر إذا سلم",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "إذا سلم عليكم أهل الكتاب فقولوا : وعليكم",
//           "references": [
//             "البخاري مع الفتح11/42 ،ومسلم 4/1705"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 112,
//     "title": "دعاء صياح الديك ونهيق الحمار",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "إذا سمعتم صياح الديكة ، فاسألوا الله من فضله فإنها رأت ملكاً وإذا سمعتم نهيق الحمار ، فتعوذوا بالله من الشيطان فإنه رأى شيطاناً",
//           "references": [
//             "البخاري مع الفتح6/350 ،ومسلم 4/2092"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 113,
//     "title": "دعاء نباح الكلاب بالليل",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "إذا سمعتم نُباح الكلاب ونهيق الحمير بالليل فتعوذوا بالله منهن فإنهن يرين ما لا ترون",
//           "references": [
//             "أبو داود 4/ 327 وأحمد 3/ 306 وصححه الألباني في صحيح أبي داود3/ 961"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 114,
//     "title": "الدعاء لمن سببته",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "قال صلى الله عليه وسلم: اللَّهُم فأيما مؤمن سببته فاجعل ذلك له قربة إليك يوم القيامة",
//           "references": [
//             "البخاري مع الفتح 11/ 171 و مسلم4/ 2007 ولفظه فاجعلها له زكاة ورحمة"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 115,
//     "title": "ما يقول المسلم إذا مدح المسلم",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": " قال صلى الله عليه وسلم : إذا كان أحدكم مادحاً صاحبه لا محالة فليقل : أحسبُ فلاناً والله حسيبهُ ولا أزكي على الله أحداً ، أحسبهُ ___ إن كان يعلم ذاك كذا وكذا",
//           "references": [
//             "رواه مسلم 4/2296"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 116,
//     "title": "ما يقول المسلم إذا زكي",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "اللهم لا تؤاخذني بما يقولون ، واغفر لي مالا يعلمون [واجعلني خيراً مما يظنون]",
//           "references": [
//             "البخاري في الأدب المفرد برقم 761 ، وصحح إسناده الألباني في صحيح الأدب المفرد برقم 585 ، وما بين المعكوفين زيادة للبيهقي في شعب الإيمان 4/ 228 من طريق آخر"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 117,
//     "title": "كيف يلبي المحرم في الحج أو العمرة",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "لبيك اللهم لبيك ، لبيك لا شريك لك لبيك ، إن الحمد والنعمة لك والملك ، لا شريك لك",
//           "references": [
//             "البخاري مع الفتح 3/ 408 ، ومسلم 2/841"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 118,
//     "title": "التكبيرة إذا أتي الركن الأسود",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "طاف النبي صلى الله عليه وسلم بالبيت على بعير كلما أتي الركن أشار إليه بشيء عنده وكبر",
//           "references": [
//             "البخاري مع الفتح 3/476 ،والمراد بالشيء المحجن انظر : البخاري مع الفتح 3/472"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 119,
//     "title": "الدعاء بين الركن اليماني والحجر الأسود",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "{ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ}",
//           "references": [
//             "أبو داود 2/ 179 وأحمد 3/411 والبغوي في شرح السنة 7/128 ،وحسنه الألباني في صحيح أبي داود 1/ 354 ، والآية من سورة البقرة ، 201"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 120,
//     "title": "دعاء الوقوف على الصفا والمروة",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "فلما دنا صلى الله عليه وسلم من الصفا قرأ: { إِنَّ الصَّفَا وَالْمَرْوَةَ مِن شَعَآئِرِ اللّهِ } أبدأ بما بدأ الله به فبدأ بالصفا فرقي عليه حتى رأى البيت فاستقبل القبلة ، فوحد الله وكبره وقال : لا إله إلا الله وحده لا شريك لهُ ، لهُ الملك ولهُ الحمد وهو على كل شيءٍ قدير ، لا إله إلا الله وحده ، أنجز وعده ، ونصر عبده ، وهزم الأحزاب وحده ثم دعا بين ذلك . قال مثل هذا ثلاث مرات الحديث وفيه ففعل على المروة كما فعل على الصفا",
//           "references": [
//             "مسلم 2/888"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 121,
//     "title": "الدعاء يوم عرفة",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "خير الدعاء دعاء يوم عرفة ، وخيرُ ما قلت أنا والنبيُّون من قبلي : لا إله إلا الله وحدهُ لا شريك لهُ ، لهُ الملكُ ولهُ الحمدُ وهو على كل شيء قدير",
//           "references": [
//             "الترمذي وحسنه الألباني في صحيح الترمذي 3/184، وفي الحديث الصحيحة 4/6"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 122,
//     "title": "الذكر عند المشعر الحرام",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "ركب صلى الله عليه وسلم القصواء حتى أتى المشعر الحرام فاستقبل القبلة ( فدعاه ُ، وكبرهُ ،وهللهُ ، ووحدهُ) فلم يزل واقفاً حتى أسفر جداً فدفع قبل أن تطلع الشمس",
//           "references": [
//             "مسلم 2/891"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 123,
//     "title": "التكبيرة عند رمي الجمار مع كل حصاة",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "يكبر كلما رمى بحصاة عند الجمار الثلاث ثم يتقدم، ويقف يدعو مستقبل القبلة، رافعاً يديه بعد الجمرة الأولى والثانية، أما جمرة العقبة فيرميها ويكبر عند كل حصاة وينصرف ولا يقف عندها",
//           "references": [
//             "البخاري مع الفتح 3/583 و3/584 وانظر لفظه هناك . والبخاري مع الفتح 3/581 ورواه مسلم أيضاً"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 124,
//     "title": "ما يقول عند التعجب والأمر السار",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "سبحان الله",
//           "references": [
//             "البخاري مع الفتح 1/210 و390 و414 ومسلم 4/ 1857"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "الله أكبر",
//           "references": [
//             "البخاري الفتح8/ 441 وانظر صحيح الترمذي 2/103 و2/235 ومسند أحمد 5/ 218"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 125,
//     "title": "ما يفعل من أتاه أمر يسره",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "كان النبي صلى الله عليه وسلم إذا أتاه أمر يسرهُ أو يسرُّ به خر ساجداً شكراً لله تبارك وتعالى",
//           "references": [
//             "رواه أهل السنن إلا النسائي . انظر صحيح ابن ماجه 1/ 233 وإرواء الغليل 2/226"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 126,
//     "title": "ما يقول من أحس وجعاً في جسده",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "ضع يدك على الذي تألم من جسدك وقل: بسم الله ، ثلاثاً  وقل سبع مرات : أعوذ بالله وقدرته من شر ما أجد وأحاذر",
//           "references": [
//             "مسلم 4/1728"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 127,
//     "title": "دعاء من خشي أن يصيب شيئاً بعينه",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "إذا رأى أحدكم من أخيه ، أو من نفسه ، أومن ماله ما يعجبهُ [فليدع لهُ بالبركة ] فإن العين حقٌّ",
//           "references": [
//             "مسند أحمد 4/447 وابن ماجه ومالك ، وصححه الألباني في صحيح الجامع 1/212 وانظر تحقيق زاد المعاد للأرناؤوط 4/170"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 128,
//     "title": "ما يقال عند الفزع",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "لا إله إلا الله",
//           "references": [
//             "البخاري مع الفتح 6/ 181 ، ومسلم 4/ 2208"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 129,
//     "title": "ما يقول عند الذبح أو النحر",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "بسم الله والله أكبر [ اللهم منك ولك ] اللهم تقبل مني",
//           "references": [
//             "مسلم 3/1557 والبيهقي 9/287 وما بين المعكوفين للبيهقي 9/287 وغيره والجملة الأخيرة سقتها بالمعنى من رواية مسلم"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 130,
//     "title": "ما يقول لرد كيد مردة الشياطين",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "أعوذ بكلمات الله التامات التي لا يجاوزهن بر ولا فاجر من شر ما خلق ، وبرأ وذرأ ومن شر ما ينزل من السماء ، ومن شر ما يعرج فيها ، ومن شر ما ذرأ في الأرض ، ومن شر ما يخرج منها ، ومن شر فتن الليل والنهار ، ومن شر كل طارق إلا طارقاً يطرق بخير يا رحمن",
//           "references": [
//             "أحمد 3/419 بإسناد صحيح وابن السني برقم 637 وصحح إسناده الأرناؤوط في تخريجه للطحاوية ص 133 وانظر مجمع الزوائد 10/ 127"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 131,
//     "title": "الاستغفار والتوبة",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "قال رسول الله صلى الله عليه وسلم : والله إني لاستغفر الله وأتوب إليه في اليوم أكثر من سبعين مرة",
//           "references": [
//             "البخاري مع الفتح 11/101"
//           ],
//           "readCount": 70
//         },
//         {
//           "descriptionTitle": "",
//           "description": "وقال صلى الله عيه وسلم : يا أيها الناس توبوا إلى الله فإني أتوب في اليوم إليه مائة مرةً",
//           "references": [
//             "مسلم 4/2076"
//           ],
//           "readCount": 100
//         },
//         {
//           "descriptionTitle": "",
//           "description": "وقال صلى الله عيه وسلم : من قال أستغفر الله العظيم الذي لا إله إلا هو الحي القيوم وأتوب إليه ، غفر الله لهُ وإن كان فر من الزحف",
//           "references": [
//             "أخرجه أبو داود 2/85 والترمذي 5/569 والحاكم وصححه ووافقه الذهبي 1/511 وصححه الألباني . انظر صحيح الترمذي 3/182 وجامع الأصول لأحاديث الرسول صلى الله عيه وسلم 4/389 ï¿½ 390 بتحقيق الأرناؤوط"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "وقال صلى الله عيه وسلم : أقرب ما يكون الربُّ من العبد في جوف الليل الآخر فإن استطعت أن تكون ممن يذكر الله في تلك الساعة فكن ",
//           "references": [
//             "أخرجه الترمذي والنسائي 1/279 والحاكم وانظر صحيح الترمذي 3/183 وجامع الأصول بتحقيق الأرناؤوط 4/144"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "وقال صلى الله عيه وسلم : أقرب ما يكون العبد من ربه وهو ساجد فأكثروا الدعاء",
//           "references": [
//             "مسلم 1/350"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "وقال صلى الله عيه وسلم : إنه ليغان على قلبي وإني لاستغفرُ الله في اليوم مائة مرة",
//           "references": [
//             "أخرجه مسلم 4/2075 قال ابن الأثير : ( ليُغان على قلبي ) أي ليغطى ويغشى والمراد : السهو ؛ لأنه كان صلى الله عيه وسلم لا يزال في مزيد من الذكر والقربة ودوام المراقبة فإذا سها عن شيء منها في بعض الأوقات ،أو نسي ،عدهُ ذنباً على نفسه ففزع إلى الاستغفار . انظر جامع الأصول 4/386"
//           ],
//           "readCount": 100
//         }
//       ]
//     }
//   },
//   {
//     "id": 132,
//     "title": "فضل التسبيح والتحميد ، والتهليل ، والتكبير",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "قال صلى الله عيه وسلم من قال سبحان الله وبحمده في يوم مائة مرة حطت خطاياه ولو كانت مثل زبد البحر",
//           "references": [
//             "البخاري 7/168 ومسلم 4/ 2071 ، وانظر :فضل من قالها مائة مرة إذا أصبح وإذا أمسى"
//           ],
//           "readCount": 100
//         },
//         {
//           "descriptionTitle": "",
//           "description": "وقال صلى الله عيه وسلم : من قال لا إله إلا وحده لا شريك لهُ ، لهُ الملك ، ولهُ الحمدُ ، وهو على كل شيء قدير عشر مرات . كان كمن أعتق أربعة أنفس من ولد إسماعيل",
//           "references": [
//             "البخاري 7/67 ومسلم بلفظه 4/2071 وانظر فضل من قالها في اليوم مائة مرة"
//           ],
//           "readCount": 10
//         },
//         {
//           "descriptionTitle": "",
//           "description": "وقال صلى الله عيه وسلم : كلمتان خفيفتان على اللسان ، ثقيلتان في الميزان حبيبتان إلى الرحمن : سبحان الله وبحمده سبحان الله العظيم",
//           "references": [
//             "البخاري 7/167ومسلم 4/2072"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "وقال صلى الله عيه وسلم : لأن أقول سبحان الله ، والحمد لله ،ولا إله إلا الله ، والله أكبر ،أحب إلى مما طلعت عليه الشمس",
//           "references": [
//             "مسلم 4/2072"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "وقال صلى الله عيه وسلم: أيعجز أحدكم أن يكسب كل يوم ألف حسنة فسأله سائل من جلسائه كيف يكسب أحدنا ألف حسنة ؟ قال : يسبح مائة تسبيحة ، فيكتب له ألف حسنة أو يحط عنه ُ ألف خطيئة",
//           "references": [
//             "مسلم 4/2073"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "من قال سبحان الله العظيم وبحمده غرست له نخلة في الجنة",
//           "references": [
//             "أخرجه الترمذي 5/511 والحاكم 1/501 وصححه ووافقه الذهبي ، وانظر صحيح الجامع 5/531 وصحيح الترمذي 3/160"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "وقال صلى الله عيه وسلم: يا عبد الله بن قيس ألا أدلك على كنز من كنوز الجنة ؟ فقلت:بلى يا رسول الله ، قال : قل لا حول ولا قوة إلا بالله",
//           "references": [
//             "البخاري مع الفتح 11/ 213 ومسلم 4/2076"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "وقال صلى الله عيه وسلم: أحب الكلام إلى الله أربعٌ : سبحان الله ، والحمد لله ، ولا إله إلا الله ، والله أكبر ، لا يضرك بأيهنَّ بدأت",
//           "references": [
//             "مسلم 3/1685"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "جاء أعرابي إلى رسول الله صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فقال: علمني كلاماً أقوله : قال قل لا إله إلا الله وحده لا شريك لهً ،الله أكبرُ كبيراً ، والحمد لله كثيراً ، سبحان الله رب العالمين ،لا حول ولا قوة إلا بالله العزيز الحكيم قال فهؤلاء لربي فما لي ؟ قال : قل: اللهم اغفر لي ،وارحمني ،واهدني وارزقني",
//           "references": [
//             "مسلم 4/ 2072 وزاد أبو داود : فلما ولى الأعرابي قال النبي صلى الله عليه وسلم : لقد ملأ يديه من الخير 1/ 220"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "كان الرجل إذا أسلم علمه النبي صلى الله عليه وسلم الصلاة ثم أمره أن يدعو بهؤلاء الكلمات : اللهم اغفر لي، وارحمني ،واهدني ، وعافني وارزقني",
//           "references": [
//             "مسلم 4/2073 وفي رواية لمسلم فإن هؤلاء تجمع لك ديناك وآخرتك"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "إن أفضل الذكر لا إله إلا الله",
//           "references": [
//             "الترمذي 5/462 وابن ماجه 2/1249 والحاكم 1/503 وصححه ووافقه الذهبي وانظر صحيح الجامع 1/ 362"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "الباقيات الصالحات : سبحان الله والحمد لله ، ولا إله إلا الله ،والله أكبر ،و لا حول ولا قوة إلا بالله",
//           "references": [
//             "أحمد برقم 513 بترتيب أحمد شاكر وإسناده صحيح وانظر مجمع الزوائد 1/297، وعزاه ابن حجر في بلوغ المرام من رواية أبي سعيد إلىالنسائي وقال :صححه ابن حبان والحاكم"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 133,
//     "title": "كيف كان النبي صلى الله عليه وسلم يسبح",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "عن عبد الله بن عمرو رضي الله عنهما قال : رأيت النبي صلى الله عليه وسلم يعقد التسبيح بيمينه",
//           "references": [
//             "أخرجه أبو داود بلفظه 2/81 والترمذي 5/521 وانظر صحيح الجامع 4/271 برقم 4865"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 134,
//     "title": "من أنواع الخير والآداب الجامعة",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "إذا كان جنح الليل أو أمسيتم فكفوا صبيانكم ؛ فإن الشياطين تنتشر حينئذ ، فإذا ذهب ساعة من الليل فخلوهم ،وأغلقوا الأبواب واذكروا اسم الله ؛ فإن الشيطان لا يفتح باباً مغلقاً ، وأوكوا قربكم واذكروا اسم الله ، وخمروا آنيتكم واذكروا اسم الله ، ولو أن تعرضوا عليها شيئاً ، وأطفئوا مصابيحكم",
//           "references": [
//             "البخاري مع الفتح 10/ 88 ومسلم 3/1595"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 135,
//     "title": "النهاية",
//     "details": {
//       "type": "text",
//       "data": [
//         "وصلى الله وسلم وبارك على نبينا محمد وعلى آله وأصحابه أجمعين"
//       ],
//       "references": [
//         "النصوص هنا هي صورة طبق الاصل من كتاب حصن المسلم",
//         "من أذكار الكتاب والسنة",
//         "الفقير إلى الله تعالى سعيد بن علي بن وهف القحطاني"
//       ]
//     }
//   }
// ]
