//   {
//     "id": 103,
//     "title": "دعاء المقيم للمسافر",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "أستودع الله دينك وأمانتك ،وخواتيم عملك",
//           "references": [
//             "أحمد 2/7 الترمذي5/499  وانظر صحيح الترمذي3/ 155"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "زوَّدك الله التقوى، وغفر ذْنبك ويسَّر لك الخير حيث ما كنت",
//           "references": [
//             "الترمذي وانظر صحيح الترمذي3/ 155"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 104,
//     "title": "التكبير والتسبيح في سير السفر",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "قال جابر رضي الله عنه : كنا إذا صعدنا كبرنا ، وإذا نزلنا سبحنا",
//           "references": [
//             "البخاري الفتح6/ 135"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 105,
//     "title": "دعاء المسافر إذا أسحر",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "سَمعَ سَامعً بحمد الله وحُسنِ بلائه علينا، ربنا صاحبنا ، وأفضِل علينا عائذا بالله من النار",
//           "references": [
//             "مسلم4/ 2086 ومعني سمع سامع : أي شهد شاهد على حمدنا لله تعالى على نعمه وحسن بلائه . ومعني سمع سامع : بلغ سامع قولي هذا لغيره وقال مثله تنبيهاً على الذكر في السحر والدعاء . وقوله : ربنا صاحبنا وأفضل علينا : أي احفظنا وحطنا واكلأنا وأفضل علينا بجزيل نعمك واصرف عنا كل مكروه ، شرح النووي 17/39"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 106,
//     "title": "الدعاء إذا نزل منزلا في سفر أو غيره",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "أعوذ بكلمات الله التامات من شر ما خلق",
//           "references": [
//             "رواه مسلم4/2080"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 107,
//     "title": "ذكر الرجوع من السفر",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "يكبر على كل شرف ثلاث تكبيرات ثم يقول : لا إله إلا الله وحده لا شريك لهُ ،لهُ الملك ، ولهُ الحمدُ وهو على كل شيءٍ قدير ، آيبون ،تائبون ، عابدون ، لربنا حامدون ،صدق الله وعده،ونصر عبده، وهزم الأحزاب وحده",
//           "references": [
//             "كان النبي صلى الله عليه وسلم يقوله إذا قفل من غزو أو حج ، البخاري 7/163 ومسلم 2/ 980"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 108,
//     "title": "ما يقول ويفعل من أتاه أمر يسره أو يكرهه",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "كان صلى الله عليه وسلم إذا أتاه الأمر يسره قال : الحمد لله الذي بنعمته تتم الصالحات و إذا أتاه أمر يكرهه قال : الحمد لله على كل حال",
//           "references": [
//             "أخرجه ابن السني في عمل اليوم والليلة والحاكم وصححه 1/499 وصححه الألباني في صحيح الجامع 4/ 201"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 109,
//     "title": "فضل الصلاة على النبي صلى الله عليه وسلم",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "قال صلى الله عليه وسلم من صلى علي صلاة صلى الله عليه بها عشراً",
//           "references": [
//             "أخرجه مسلم 1/288"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "وقال صلى الله عليه وسلم : لا تجعلوا قبري عيداً وصلوا علي ؛ فإن صلاتكم تبلغني حيث كنتم",
//           "references": [
//             "أبو داود 2/218 وأحمد 2/367 وصححه الألباني في صحيح أبي داود 2/ 383"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "وقال صلى الله عليه وسلم : البخيل من ذكرت عندهُ فلم يصل علي",
//           "references": [
//             "الترمذي 5/551 وغيره وانظر صحيح الجامع 3/ 25 وصحيح الترمذي 3/ 177"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "وقال صلى الله عليه وسلم إن لله ملائكة سياحين في الأرض يبلغوني من أمتي السلام",
//           "references": [
//             "النسائي ،والحاكم 2/421 وصححه الألباني في صحيح النسائي 1/274"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "وقال صلى الله عليه وسلم ما من أحدٍ يسلِّمُ عليَّ إلَّا ردَّ اللَّهُ عليَّ روحي حتَّى أردَّ عليْهِ السَّلامَ",
//           "references": [
//             "أبو داود برقم 2041وحسنه الألباني في صحيح أبي داود 1/ 383"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 110,
//     "title": "إفشاء السلام",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "قال رسول الله صلى الله عليه وسلم : لا تدخلوا الجنة حتى تؤمنوا ، ولا تؤمنوا حتى تحابوا ، أو لا أدلكم على شيءٍ إذا فعلتموه تحاببتم ، أفشوا السلام بينكم",
//           "references": [
//             "مسلم 1/74 وغيره"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "ثلاث من جمعهن فقد جمع الإيمان : الإنصاف من نفسك ، وبذل السلام للعالم ،والإنفاق من الإقتار",
//           "references": [
//             "البخاري مع الفتح 1/ 82 عن عمار رضي الله عنه موقوفاً معلقاً"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "وعن عبد الله بن عمر رضي الله عنهما : أن رجلاً سأل النبي صلى الله عليه وسلم أي الإسلام خير قال : تطعم الطعام وتقرأ السلام على من عرفت ومن لم تعرف",
//           "references": [
//             "البخاري مع الفتح 1/55 ومسلم 1/65"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 111,
//     "title": "كيف يرد السلام على الكافر إذا سلم",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "إذا سلم عليكم أهل الكتاب فقولوا : وعليكم",
//           "references": [
//             "البخاري مع الفتح11/42 ،ومسلم 4/1705"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 112,
//     "title": "دعاء صياح الديك ونهيق الحمار",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "إذا سمعتم صياح الديكة ، فاسألوا الله من فضله فإنها رأت ملكاً وإذا سمعتم نهيق الحمار ، فتعوذوا بالله من الشيطان فإنه رأى شيطاناً",
//           "references": [
//             "البخاري مع الفتح6/350 ،ومسلم 4/2092"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 113,
//     "title": "دعاء نباح الكلاب بالليل",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "إذا سمعتم نُباح الكلاب ونهيق الحمير بالليل فتعوذوا بالله منهن فإنهن يرين ما لا ترون",
//           "references": [
//             "أبو داود 4/ 327 وأحمد 3/ 306 وصححه الألباني في صحيح أبي داود3/ 961"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 114,
//     "title": "الدعاء لمن سببته",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "قال صلى الله عليه وسلم: اللَّهُم فأيما مؤمن سببته فاجعل ذلك له قربة إليك يوم القيامة",
//           "references": [
//             "البخاري مع الفتح 11/ 171 و مسلم4/ 2007 ولفظه فاجعلها له زكاة ورحمة"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 115,
//     "title": "ما يقول المسلم إذا مدح المسلم",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": " قال صلى الله عليه وسلم : إذا كان أحدكم مادحاً صاحبه لا محالة فليقل : أحسبُ فلاناً والله حسيبهُ ولا أزكي على الله أحداً ، أحسبهُ ___ إن كان يعلم ذاك كذا وكذا",
//           "references": [
//             "رواه مسلم 4/2296"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 116,
//     "title": "ما يقول المسلم إذا زكي",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "اللهم لا تؤاخذني بما يقولون ، واغفر لي مالا يعلمون [واجعلني خيراً مما يظنون]",
//           "references": [
//             "البخاري في الأدب المفرد برقم 761 ، وصحح إسناده الألباني في صحيح الأدب المفرد برقم 585 ، وما بين المعكوفين زيادة للبيهقي في شعب الإيمان 4/ 228 من طريق آخر"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 117,
//     "title": "كيف يلبي المحرم في الحج أو العمرة",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "لبيك اللهم لبيك ، لبيك لا شريك لك لبيك ، إن الحمد والنعمة لك والملك ، لا شريك لك",
//           "references": [
//             "البخاري مع الفتح 3/ 408 ، ومسلم 2/841"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 118,
//     "title": "التكبيرة إذا أتي الركن الأسود",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "طاف النبي صلى الله عليه وسلم بالبيت على بعير كلما أتي الركن أشار إليه بشيء عنده وكبر",
//           "references": [
//             "البخاري مع الفتح 3/476 ،والمراد بالشيء المحجن انظر : البخاري مع الفتح 3/472"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 119,
//     "title": "الدعاء بين الركن اليماني والحجر الأسود",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "{ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ}",
//           "references": [
//             "أبو داود 2/ 179 وأحمد 3/411 والبغوي في شرح السنة 7/128 ،وحسنه الألباني في صحيح أبي داود 1/ 354 ، والآية من سورة البقرة ، 201"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 120,
//     "title": "دعاء الوقوف على الصفا والمروة",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "فلما دنا صلى الله عليه وسلم من الصفا قرأ: { إِنَّ الصَّفَا وَالْمَرْوَةَ مِن شَعَآئِرِ اللّهِ } أبدأ بما بدأ الله به فبدأ بالصفا فرقي عليه حتى رأى البيت فاستقبل القبلة ، فوحد الله وكبره وقال : لا إله إلا الله وحده لا شريك لهُ ، لهُ الملك ولهُ الحمد وهو على كل شيءٍ قدير ، لا إله إلا الله وحده ، أنجز وعده ، ونصر عبده ، وهزم الأحزاب وحده ثم دعا بين ذلك . قال مثل هذا ثلاث مرات الحديث وفيه ففعل على المروة كما فعل على الصفا",
//           "references": [
//             "مسلم 2/888"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 121,
//     "title": "الدعاء يوم عرفة",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "خير الدعاء دعاء يوم عرفة ، وخيرُ ما قلت أنا والنبيُّون من قبلي : لا إله إلا الله وحدهُ لا شريك لهُ ، لهُ الملكُ ولهُ الحمدُ وهو على كل شيء قدير",
//           "references": [
//             "الترمذي وحسنه الألباني في صحيح الترمذي 3/184، وفي الحديث الصحيحة 4/6"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 122,
//     "title": "الذكر عند المشعر الحرام",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "ركب صلى الله عليه وسلم القصواء حتى أتى المشعر الحرام فاستقبل القبلة ( فدعاه ُ، وكبرهُ ،وهللهُ ، ووحدهُ) فلم يزل واقفاً حتى أسفر جداً فدفع قبل أن تطلع الشمس",
//           "references": [
//             "مسلم 2/891"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 123,
//     "title": "التكبيرة عند رمي الجمار مع كل حصاة",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "يكبر كلما رمى بحصاة عند الجمار الثلاث ثم يتقدم، ويقف يدعو مستقبل القبلة، رافعاً يديه بعد الجمرة الأولى والثانية، أما جمرة العقبة فيرميها ويكبر عند كل حصاة وينصرف ولا يقف عندها",
//           "references": [
//             "البخاري مع الفتح 3/583 و3/584 وانظر لفظه هناك . والبخاري مع الفتح 3/581 ورواه مسلم أيضاً"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 124,
//     "title": "ما يقول عند التعجب والأمر السار",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "سبحان الله",
//           "references": [
//             "البخاري مع الفتح 1/210 و390 و414 ومسلم 4/ 1857"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "الله أكبر",
//           "references": [
//             "البخاري الفتح8/ 441 وانظر صحيح الترمذي 2/103 و2/235 ومسند أحمد 5/ 218"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 125,
//     "title": "ما يفعل من أتاه أمر يسره",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "كان النبي صلى الله عليه وسلم إذا أتاه أمر يسرهُ أو يسرُّ به خر ساجداً شكراً لله تبارك وتعالى",
//           "references": [
//             "رواه أهل السنن إلا النسائي . انظر صحيح ابن ماجه 1/ 233 وإرواء الغليل 2/226"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 126,
//     "title": "ما يقول من أحس وجعاً في جسده",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "ضع يدك على الذي تألم من جسدك وقل: بسم الله ، ثلاثاً  وقل سبع مرات : أعوذ بالله وقدرته من شر ما أجد وأحاذر",
//           "references": [
//             "مسلم 4/1728"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 127,
//     "title": "دعاء من خشي أن يصيب شيئاً بعينه",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "إذا رأى أحدكم من أخيه ، أو من نفسه ، أومن ماله ما يعجبهُ [فليدع لهُ بالبركة ] فإن العين حقٌّ",
//           "references": [
//             "مسند أحمد 4/447 وابن ماجه ومالك ، وصححه الألباني في صحيح الجامع 1/212 وانظر تحقيق زاد المعاد للأرناؤوط 4/170"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 128,
//     "title": "ما يقال عند الفزع",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "لا إله إلا الله",
//           "references": [
//             "البخاري مع الفتح 6/ 181 ، ومسلم 4/ 2208"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 129,
//     "title": "ما يقول عند الذبح أو النحر",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "بسم الله والله أكبر [ اللهم منك ولك ] اللهم تقبل مني",
//           "references": [
//             "مسلم 3/1557 والبيهقي 9/287 وما بين المعكوفين للبيهقي 9/287 وغيره والجملة الأخيرة سقتها بالمعنى من رواية مسلم"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 130,
//     "title": "ما يقول لرد كيد مردة الشياطين",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "أعوذ بكلمات الله التامات التي لا يجاوزهن بر ولا فاجر من شر ما خلق ، وبرأ وذرأ ومن شر ما ينزل من السماء ، ومن شر ما يعرج فيها ، ومن شر ما ذرأ في الأرض ، ومن شر ما يخرج منها ، ومن شر فتن الليل والنهار ، ومن شر كل طارق إلا طارقاً يطرق بخير يا رحمن",
//           "references": [
//             "أحمد 3/419 بإسناد صحيح وابن السني برقم 637 وصحح إسناده الأرناؤوط في تخريجه للطحاوية ص 133 وانظر مجمع الزوائد 10/ 127"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 131,
//     "title": "الاستغفار والتوبة",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "قال رسول الله صلى الله عليه وسلم : والله إني لاستغفر الله وأتوب إليه في اليوم أكثر من سبعين مرة",
//           "references": [
//             "البخاري مع الفتح 11/101"
//           ],
//           "readCount": 70
//         },
//         {
//           "descriptionTitle": "",
//           "description": "وقال صلى الله عيه وسلم : يا أيها الناس توبوا إلى الله فإني أتوب في اليوم إليه مائة مرةً",
//           "references": [
//             "مسلم 4/2076"
//           ],
//           "readCount": 100
//         },
//         {
//           "descriptionTitle": "",
//           "description": "وقال صلى الله عيه وسلم : من قال أستغفر الله العظيم الذي لا إله إلا هو الحي القيوم وأتوب إليه ، غفر الله لهُ وإن كان فر من الزحف",
//           "references": [
//             "أخرجه أبو داود 2/85 والترمذي 5/569 والحاكم وصححه ووافقه الذهبي 1/511 وصححه الألباني . انظر صحيح الترمذي 3/182 وجامع الأصول لأحاديث الرسول صلى الله عيه وسلم 4/389 ï¿½ 390 بتحقيق الأرناؤوط"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "وقال صلى الله عيه وسلم : أقرب ما يكون الربُّ من العبد في جوف الليل الآخر فإن استطعت أن تكون ممن يذكر الله في تلك الساعة فكن ",
//           "references": [
//             "أخرجه الترمذي والنسائي 1/279 والحاكم وانظر صحيح الترمذي 3/183 وجامع الأصول بتحقيق الأرناؤوط 4/144"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "وقال صلى الله عيه وسلم : أقرب ما يكون العبد من ربه وهو ساجد فأكثروا الدعاء",
//           "references": [
//             "مسلم 1/350"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "وقال صلى الله عيه وسلم : إنه ليغان على قلبي وإني لاستغفرُ الله في اليوم مائة مرة",
//           "references": [
//             "أخرجه مسلم 4/2075 قال ابن الأثير : ( ليُغان على قلبي ) أي ليغطى ويغشى والمراد : السهو ؛ لأنه كان صلى الله عيه وسلم لا يزال في مزيد من الذكر والقربة ودوام المراقبة فإذا سها عن شيء منها في بعض الأوقات ،أو نسي ،عدهُ ذنباً على نفسه ففزع إلى الاستغفار . انظر جامع الأصول 4/386"
//           ],
//           "readCount": 100
//         }
//       ]
//     }
//   },
//   {
//     "id": 132,
//     "title": "فضل التسبيح والتحميد ، والتهليل ، والتكبير",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "قال صلى الله عيه وسلم من قال سبحان الله وبحمده في يوم مائة مرة حطت خطاياه ولو كانت مثل زبد البحر",
//           "references": [
//             "البخاري 7/168 ومسلم 4/ 2071 ، وانظر :فضل من قالها مائة مرة إذا أصبح وإذا أمسى"
//           ],
//           "readCount": 100
//         },
//         {
//           "descriptionTitle": "",
//           "description": "وقال صلى الله عيه وسلم : من قال لا إله إلا وحده لا شريك لهُ ، لهُ الملك ، ولهُ الحمدُ ، وهو على كل شيء قدير عشر مرات . كان كمن أعتق أربعة أنفس من ولد إسماعيل",
//           "references": [
//             "البخاري 7/67 ومسلم بلفظه 4/2071 وانظر فضل من قالها في اليوم مائة مرة"
//           ],
//           "readCount": 10
//         },
//         {
//           "descriptionTitle": "",
//           "description": "وقال صلى الله عيه وسلم : كلمتان خفيفتان على اللسان ، ثقيلتان في الميزان حبيبتان إلى الرحمن : سبحان الله وبحمده سبحان الله العظيم",
//           "references": [
//             "البخاري 7/167ومسلم 4/2072"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "وقال صلى الله عيه وسلم : لأن أقول سبحان الله ، والحمد لله ،ولا إله إلا الله ، والله أكبر ،أحب إلى مما طلعت عليه الشمس",
//           "references": [
//             "مسلم 4/2072"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "وقال صلى الله عيه وسلم: أيعجز أحدكم أن يكسب كل يوم ألف حسنة فسأله سائل من جلسائه كيف يكسب أحدنا ألف حسنة ؟ قال : يسبح مائة تسبيحة ، فيكتب له ألف حسنة أو يحط عنه ُ ألف خطيئة",
//           "references": [
//             "مسلم 4/2073"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "من قال سبحان الله العظيم وبحمده غرست له نخلة في الجنة",
//           "references": [
//             "أخرجه الترمذي 5/511 والحاكم 1/501 وصححه ووافقه الذهبي ، وانظر صحيح الجامع 5/531 وصحيح الترمذي 3/160"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "وقال صلى الله عيه وسلم: يا عبد الله بن قيس ألا أدلك على كنز من كنوز الجنة ؟ فقلت:بلى يا رسول الله ، قال : قل لا حول ولا قوة إلا بالله",
//           "references": [
//             "البخاري مع الفتح 11/ 213 ومسلم 4/2076"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "وقال صلى الله عيه وسلم: أحب الكلام إلى الله أربعٌ : سبحان الله ، والحمد لله ، ولا إله إلا الله ، والله أكبر ، لا يضرك بأيهنَّ بدأت",
//           "references": [
//             "مسلم 3/1685"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "جاء أعرابي إلى رسول الله صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فقال: علمني كلاماً أقوله : قال قل لا إله إلا الله وحده لا شريك لهً ،الله أكبرُ كبيراً ، والحمد لله كثيراً ، سبحان الله رب العالمين ،لا حول ولا قوة إلا بالله العزيز الحكيم قال فهؤلاء لربي فما لي ؟ قال : قل: اللهم اغفر لي ،وارحمني ،واهدني وارزقني",
//           "references": [
//             "مسلم 4/ 2072 وزاد أبو داود : فلما ولى الأعرابي قال النبي صلى الله عليه وسلم : لقد ملأ يديه من الخير 1/ 220"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "كان الرجل إذا أسلم علمه النبي صلى الله عليه وسلم الصلاة ثم أمره أن يدعو بهؤلاء الكلمات : اللهم اغفر لي، وارحمني ،واهدني ، وعافني وارزقني",
//           "references": [
//             "مسلم 4/2073 وفي رواية لمسلم فإن هؤلاء تجمع لك ديناك وآخرتك"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "إن أفضل الذكر لا إله إلا الله",
//           "references": [
//             "الترمذي 5/462 وابن ماجه 2/1249 والحاكم 1/503 وصححه ووافقه الذهبي وانظر صحيح الجامع 1/ 362"
//           ],
//           "readCount": 1
//         },
//         {
//           "descriptionTitle": "",
//           "description": "الباقيات الصالحات : سبحان الله والحمد لله ، ولا إله إلا الله ،والله أكبر ،و لا حول ولا قوة إلا بالله",
//           "references": [
//             "أحمد برقم 513 بترتيب أحمد شاكر وإسناده صحيح وانظر مجمع الزوائد 1/297، وعزاه ابن حجر في بلوغ المرام من رواية أبي سعيد إلىالنسائي وقال :صححه ابن حبان والحاكم"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 133,
//     "title": "كيف كان النبي صلى الله عليه وسلم يسبح",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "عن عبد الله بن عمرو رضي الله عنهما قال : رأيت النبي صلى الله عليه وسلم يعقد التسبيح بيمينه",
//           "references": [
//             "أخرجه أبو داود بلفظه 2/81 والترمذي 5/521 وانظر صحيح الجامع 4/271 برقم 4865"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 134,
//     "title": "من أنواع الخير والآداب الجامعة",
//     "isFavorite": false,
//     "details": {
//       "type": "counter",
//       "data": [
//         {
//           "descriptionTitle": "",
//           "description": "إذا كان جنح الليل أو أمسيتم فكفوا صبيانكم ؛ فإن الشياطين تنتشر حينئذ ، فإذا ذهب ساعة من الليل فخلوهم ،وأغلقوا الأبواب واذكروا اسم الله ؛ فإن الشيطان لا يفتح باباً مغلقاً ، وأوكوا قربكم واذكروا اسم الله ، وخمروا آنيتكم واذكروا اسم الله ، ولو أن تعرضوا عليها شيئاً ، وأطفئوا مصابيحكم",
//           "references": [
//             "البخاري مع الفتح 10/ 88 ومسلم 3/1595"
//           ],
//           "readCount": 1
//         }
//       ]
//     }
//   },
//   {
//     "id": 135,
//     "title": "النهاية",
//     "details": {
//       "type": "text",
//       "data": [
//         "وصلى الله وسلم وبارك على نبينا محمد وعلى آله وأصحابه أجمعين"
//       ],
//       "references": [
//         "النصوص هنا هي صورة طبق الاصل من كتاب حصن المسلم",
//         "من أذكار الكتاب والسنة",
//         "الفقير إلى الله تعالى سعيد بن علي بن وهف القحطاني"
//       ]
//     }
//   }
// ]
