[
    {
        "id": 1,
        "title": {
            "ar": "الاستخارة والاستشارة.. عندما يصعب الاختيار!",
            "en": "Istikhara and Consultation... When Making a Choice Becomes Difficult!"
        },
        "details": {
            "ar": [
                "تصيبنا الحيرة في أمور كثيرة.. لكن لمن نلجأ وممن نطلب المشورة؟ فمهما وثقنا بأحد من الناس يبقى بشرا يصيب ويخطئ، قد يكون منهكا أو في مزاج سيئ فلا يسمع شكوانا جيدا ولا يقدم لنا النصيحة التي تناسب الموقف أو الظرف. لكن من رحمة الله فينا أنه هو بعظمته وجلاله يسمعنا في كل وقت لا نحتاج للقائه إلى وسيط. كثيرة هي الأحيان التي يلتبس علينا الأمر بها، سواء في وظيفة أو زواج أو سفر بل في مناحي الحياة جميعها.",
                "لذلك شرع الله لنا الاستخارة وحثنا رسولنا الكريم عليه الصلاة والسلام عليها، فعن جابر بن عبد الله رضى الله عنهما قال: (كان النبي صلى الله عليه وسلم يعلمنا الاستخارة في الأمور كلها كالسورة من القرآن) رواه البخاري. الاستخارة لغة تعني طلب الخيرة في الشيء. ولكن الطلب هنا من الله تعالى بعظيم قدره مما يعلق القلب فيه ويصرفه عن التعلق بالبشر. ففي الاستخارة يتحقق معنى العبودية لله والاتكال عليه، إذ يرمي المسلم حموله على الله واثقا بتدابيره وهل من أحد يحسن التدبير كمثله سبحانه! وهل من أحد في لطفه وحنانه!"
            ],
            "en": [
                "We often find ourselves confused about many things… but to whom do we turn, and from whom do we seek advice? No matter how much we trust someone, they are still human—they can be right or wrong. They might be exhausted or in a bad mood, unable to truly hear our concerns or offer advice that suits the situation. But from Allah’s mercy upon us is that He, in His greatness and majesty, hears us at all times—without the need for an intermediary. There are many times when matters become unclear to us—whether it's about a job, marriage, travel, or any aspect of life.",
                "That’s why Allah has prescribed istikhara (seeking guidance) for us, and our noble Prophet (peace be upon him) encouraged it. Jabir ibn Abdullah (may Allah be pleased with them both) said: “The Prophet (peace be upon him) used to teach us istikhara in all matters just as he would teach us a chapter from the Quran.” (Reported by Al-Bukhari). Linguistically, istikhara means seeking the best outcome in a matter. But here, the request is from Allah the Almighty, which attaches the heart to Him and diverts it from depending on people. Through istikhara, the true meaning of servitude to Allah and reliance on Him is realized—the Muslim lays all burdens upon Allah, trusting in His plans. And who plans better than Him, the Most Glorious? Who is more kind and compassionate?"
            ]
        }
    },
    {
        "id": 2,
        "title": {
            "ar": "كيفية صلاة الاستخارة",
            "en": "How to Perform the Istikhara Prayer"
        },
        "details": {
            "ar": [
                "يصلي المسلم ركعتين من غير الفريضة ويسلم.",
                "ثم يحمد الله ويصلي على نبيه (أي يقول: الحمدلله والصلاة والسلام على رسول الله).",
                "ثم يدعو بدعاء الاستخارة."
            ],
            "en": [
                "The Muslim prays two non-obligatory (voluntary) units of prayer and concludes with salam.",
                "Then he praises Allah and sends blessings upon the Prophet (i.e., says: Alhamdulillah wa as-salatu wa as-salamu ‘ala Rasulillah).",
                "Then he recites the supplication of Istikhara."
            ]
        }
    },
    {
        "id": 3,
        "title": {
            "ar": "دعاء الاستخارة",
            "en": "The Istikhara Supplication"
        },
        "details": {
            "ar": [
                "قال النبي ﷺ: إذا هم أحدكم بأمر فليصل ركعتين، ثم ليقل: اللهم إني أستخيرك بعلمك، وأستقدرك بقدرتك، وأسألك من فضلك العظيم، فإنك تعلم ولا أعلم، وتقدر ولا أقدر، وأنت علام الغيوب، اللهم إن كنت تعلم أن هذا الأمر ويسميه باسمه يقول: هذا الأمر، زواجي بفلانة، أو سفري إلى محل كذا، أو شراء كذا، أو ما أشبه ذلك، يعين حاجته اللهم إن كنت تعلم أن هذا الأمر خير لي في ديني ومعاشي وعاقبة أمري، فيسره لي، ثم بارك لي فيه، وإن كنت تعلم أن هذا الأمر شر لي في ديني ومعاشي وعاقبة أمري فاصرفه عني واصرفني عنه، وقدر لي الخير حيث كان، ثم رضني به. وهذا هو دعاء الاستخارة."
            ],
            "en": [
                "The Prophet ﷺ said: If any of you is concerned about a matter, let him pray two units of prayer and then say: O Allah, I seek Your guidance by Your knowledge, and I seek ability by Your power, and I ask You from Your great bounty. For You are capable and I am not, You know and I do not, and You are the Knower of the unseen. O Allah, if You know that this matter (and he should name it specifically: like my marriage to so-and-so, or my travel to such a place, or my purchase of such-and-such) is good for me in my religion, my livelihood, and the outcome of my affairs, then decree it for me, make it easy for me, and bless it for me. And if You know that this matter is bad for me in my religion, my livelihood, and the outcome of my affairs, then turn it away from me and turn me away from it, and decree for me what is good wherever it may be, and make me content with it. This is the supplication of Istikhara.",
                "",
                "Allāhumma innī astakhīruka biʿilmika wa astaqdiruka biqudratika, wa asʾaluka min faḍlika (a)l-ʿaẓīm fainnaka taqdiru walā aqdiru wa taʿlamu wala aʿlamu wa anta ʿallāmu (a)l-ghuyūb. Allāhumma, in kunta taʿlamu anna hadha (a)l-amra [mention decision here] khayrun lī fī dīnī wa maʿāshī waʿāqibati amrī faqdurhu lī wa ya (a)s-sirhu lī thumma barik lī fīhi. Wa in kunta taʿlamu anna hadha (a)l-amra sharrun lī fī dīnī wa maʿāshī wa ʿāqibati amri faṣrifhu ʿannī wa (a)ṣrifni ʿanhu waqdir lī(ya) (a)l-khayra haythu kāna thumma arḍīnī bihi."
            ]
        }
    },
    {
        "id": 4,
        "title": {
            "ar": "توقيت الصلاة",
            "en": "Prayer Timing"
        },
        "details": {
            "ar": [
                "ويمكن للإنسان أن يصلي صلاة الاستخارة في أي وقت شاء، شرط أن يبتعد عن أي من هذه الأوقات المكروهة، وهي: بعد صلاة العصر إلى صلاة المغرب، وبعد صلاة الفجر إلى طلوع الشمس، وقبل الظهر بمقدار ربع ساعة تقريبا، والذي يعتبر وقت زوال الشمس. تشرع الاستخارة وتستحب في الأمور المباحة كلها حتى وإن بدا ظاهرها خيرا فنحن لا نملك من مفاتيح الغيب شيئا.",
                "تحضرني هنا قصة في هذا السياق لصديقة مقربة مني كانت بحاجة ماسة للعمل قدمت لوظيفة، وفي يوم المقابلة سألتها إن كانت قد استخارت فقالت: لا داعي لذلك، فمكان العمل قريب جدا على سكني ولن أجد فرصة أفضل، فأنت تعلمين كم هو صعب الحصول على وظيفة في هذا البلد. ذهبت بكل سرور، وما إن عادت إلى البيت حتى حرقت يدها لأول مرة في حياتها وهي تعد الشاي، أحست يومها وكأن هذا تنبيه لها من الله وتذكرت كلامي فورا، وأيقنت ذلك أكثر حين اتضح بعد فترة أن من عينت مكانها في ذلك العمل تركت العمل من سوء القائمين عليه، وفسادهم. ومن يومها أصبحت تستخير الله في كل أمر يختلط عليها."
            ],
            "en": [
                "A person may perform the Istikhara prayer at any time they wish, as long as they avoid the disliked times, which are: after ‘Asr until Maghrib, after Fajr until sunrise, and approximately fifteen minutes before Dhuhr, which is the time of the sun’s zenith. Istikhara is prescribed and recommended for all permissible matters, even those that seem obviously good, as we do not hold the keys to the unseen.",
                "This reminds me of a story about a close friend who was in desperate need of a job. She applied for a position, and on the day of the interview, I asked her if she had prayed Istikhara. She replied: There's no need—it's very close to where I live, and I won't find a better opportunity. You know how hard it is to find a job in this country. She went happily, but upon returning home, she burned her hand for the first time in her life while making tea. She felt it was a sign from Allah and immediately remembered what I told her. Her feeling was confirmed when, later on, it became clear that the person who got the job instead of her had to quit due to how awful and corrupt the management was. From that day on, she started praying Istikhara for every matter that confused her."
            ]
        }
    },
    {
        "id": 5,
        "title": {
            "ar": "الاستشارة",
            "en": "Consultation"
        },
        "details": {
            "ar": [
                "وتقدم المشورة على الاستخارة في بعض الأحيان، إذ يستشير المسلم أهل الخبرة والصلاح كأن يسأل عن طبيب معين لإجراء عملية جراحية فبعد المشورة والسؤال يستخير الله ليكون قراره صائبا، ولا يخسر أبدا فما خاب من استخار وما ندم من استشار. فكونوا مع الله يكن معكم، فوضوا أمركم إليه يختر لكم ما يناسبكم، ويحقق راحتكم في الدنيا والآخرة."
            ],
            "en": [
                "At times, consultation takes precedence over Istikhara. A Muslim should first consult people of experience and righteousness—such as asking about a specific doctor for a surgery. After seeking advice and gathering information, they then pray Istikhara to ensure their decision is sound. One will never lose by praying Istikhara, and will never regret seeking counsel. So be with Allah and He will be with you. Entrust your affairs to Him, and He will choose what suits you and brings you comfort in this life and the next."
            ]
        }
    }
]