[
  {
    "id": 1,
    "title": {
      "ar": "المقدمة",
      "en": "Introduction"
    },
    "details": {
      "type": "text",
      "list": [
        {
          "ar": "بسم الله الرحمن الرحيم",
          "en": "In the name of Allah, the Most Gracious, the Most Merciful"
        },
        {
          "ar": "إن الحمد لله ، نحمده ونستعينهُ ، ونستغفرهُ ونعوذُ باللهِ من شرورِ أنفسنا ، وسيئاتِ أعمالنا ، من يهده الله فلا مضل لهُ، ومن يضلل فلا هادي له ، وأشهد أن لا إله إلا الله وحده لا شريك لهُ،وأشهدُ أن محمداً عبدهُ ورسولهُ صلى الله عليه وعلى أله وأصحابه ومن تبعهم بإحسان إلى يوم الدين وسلم تسليما كثيراً ،أما بعد .",
          "en": "Surely all praise is for Allah. We praise Him, seek His help, and ask His forgiveness. We seek refuge in Him from the evil of our own souls and from the wickedness of our deeds. Whomever He guides then nothing can make him lost, and whomever He makes lost then nothing can guide him. I bear witness that none has the right to be worshipped but Allah, alone, Who has no partner, and I bear witness that Muhammad is His slave and His Messenger. May Allah send prayers upon him and upon his family and his Companions and those who follow them in piety until the Day of Judgement and may He send copius peace (upon them). To proceed:"
        },
        {
          "ar": "فهذا مختصر اختصرته من كتابي (( الذكرُ والدعاءُ والعلاج بالرقي من الكتاب والسنة )) اختصرت فيه قسم الأذكار ؛ ليكون خفيف الحمل في الأسفار .",
          "en": "This is an abridgement that I have abridged from my earlier work entitled 'Ath-Thikr wad-Dua wal-Ilaj bir-Ruqa minal-kitab was-Sunnah'. I have abridged in it the section on words of remembrance (i.e. dhikr) in order to make it easy to carry in travels."
        },
        {
          "ar": "وقد اقتصرت على متن الذكر ، واكتفيت في تخريجه بذكر مصدر أو مصدرين مما وجد في الأصل ،ومن أراد معرفة الصحابي أو زيادة في التخريج فعليه بالرجوع إلى الأصل.",
          "en": "I have confined to only the text of the words of remembrance. I also have sufficed in referencing it by mentioning only one or two sources from the original work. Whoever would like to know about the Companion or more about the reference information should refer to the original work."
        },
        {
          "ar": "وأسأل الله عز وجل بأسمائه الحسنى ، وصفاته العُلى أن يجعله خالصا لوجهه الكريم ، وأن ينفعني به في حياتي وبعد مماتي وأن ينفع به من قرأه ، أو طبعه ، أو كان سبباً في نشره إنه سبحانه ولي ذلك  والقادر عليه. وصلى الله على نبينا محمد وعلى آله وأصحابه ومن تبعهم بإحسان إلى يوم الدين.",
          "en": "I ask Allah, mighty and glorious, by His beautiful names and by His sublime attributes to make this sincere for his noble countenance and to benefit me with it during my life and after my death and to benefit with it those who read it or print it or is a cause of distributing it. Verily He, glorified is He, is the patron of that and capable of it. May Allah send prayers upon our Prophet Muhammad and upon his family and Companions and whoever follows them in piety until the Day of Judgement."
        }
      ],
      "referances": [
        {
          "ar": "المؤلف حرر في شهر صفر 1409هـ",
          "en": "The Author (Sa`id b. `Ali b. Wahf al-Qahtani) Safar, 1409H"
        },
        {
          "ar": "من أذكار الكتاب والسنة",
          "en": "From the remembrances of the Qur’an and Sunnah"
        },
        {
          "ar": "الفقير إلى الله تعالى سعيد بن علي بن وهف القحطاني",
          "en": "The poor man before God Almighty, Saeed bin Ali bin Wahf Al-Qahtani"
        }
      ]
    }
  },
  {
    "id": 2,
    "title": {
      "ar": "فضل الذكر",
      "en": "The merit of dhikr (remembrance)"
    },
    "details": {
      "type": "text",
      "list": [
        {
          "ar": "قال الله تعالى:",
          "en": "Allah the All-Mighty has said:"
        },
        {
          "ar": "{ فَاذْكُرُونِي أَذْكُرْكُمْ وَاشْكُرُواْ لِي وَلاَ تَكْفُرُونِ }[1]",
          "en": "Therefore remember Me. I will remember you. Be grateful to Me and never show Me ingratitude [1]"
        },
        {
          "ar": "{ يَا أَيُّهَا الَّذِينَ آمَنُوا اذْكُرُوا اللَّهَ ذِكْراً كَثِيراً } [2]",
          "en": "And He said: O you who believe, remember Allah with much remembrance [2]"
        },
        {
          "ar": "{ وَالذَّاكِرِينَ اللَّهَ كَثِيراً وَالذَّاكِرَاتِ أَعَدَّ اللَّهُ لَهُم مَّغْفِرَةً وَأَجْراً عَظِيماً } [3]",
          "en": "And He said: And the men and women who remember Allah frequently, Allah has prepared for them forgiveness and great reward [3]"
        },
        {
          "ar": "{ وَاذْكُر رَّبَّكَ فِي نَفْسِكَ تَضَرُّعاً وَخِيفَةً وَدُونَ الْجَهْرِ مِنَ الْقَوْلِ بِالْغُدُوِّ وَالآصَالِ وَلاَ تَكُن مِّنَ الْغَافِلِينَ } [4]",
          "en": "And He said: And remember your Lord by your tongue and within yourself, humbly and in awe, without loudness, by words in the morning and in the afternoon, and be not among those who are neglectful [4]"
        },
        {
          "ar": "وقال صلى الله عليه وسلم : مثل الذي يذكر ربه والذي لا يذكر ربه مثل الحي والميت [5]",
          "en": "The Prophet (pbuh) said: He who remembers his Lord and he who does not remember his Lord are like the living and the dead [5]"
        },
        {
          "ar": "وقال صلى الله عليه وسلم :' ألا أنبئكم بخير أعمالكم ،وأزكاها عند مليككم، وأرفعها في درجاتكم ، وخير لكم من إنفاق الذهب والورق ، وخير لكم من أن تلقوا عدوكم فتضربوا أعناقهم ويضربوا أعناقكم ؟' قالوا بلى .قال : 'ذكر الله تعالى '[6]",
          "en": "And he said, Shall I not inform you of the best of your works, the purest of them with your Master (Allah), the loftiest of them in your stations, the thing that is better for you than spending gold and silver (in charity), and better for you than meeting your enemies and slaying them and being slain by them? They (the Companions) said, 'Of course!' He said, Remembrance of Allah, the Most High [6]"
        },
        {
          "ar": "وقال صلى الله عليه وسلم :' يقول الله تعالى : أنا عند ظن عبدي بي ، وأنا معه إذا ذكرني ، فإن ذكرني في نفسه ذكرتهُ في نفسي ، وإن ذكرني في ملأ ذكرته في ملأ خير منهم ،وإن تقرب إلي شبراً تقربت إليه ذراعاً ،وإن تقرب إلي ذراعاً تقربت إليه باعاً ، وإن أتاني يمشي أتيتهُ هرولة '[7]",
          "en": "And he said, Allah the Most High says, 'I am with My slave when he thinks of Me and I am with him when he mentions Me. For if he mentions Me to himself, I mention him to Myself; and if he mentions Me in a gathering, I mention him in superior gathering. If he approaches Me by a hand's width, I approach him by an arm's length, I approach him by two arms length. And if he comes to me walking, I hasten to him swiftly [7]"
        },
        {
          "ar": "وعن عبد الله بن بسرٍ رضي الله عنهُ أن رجلاً قال : يا رسول الله إن شرائع الإسلام قد كثرت علي فأخبرني بشيءٍ أتشبث به. قال صلى الله عليه وسلم :' لا يزال لسانك رطباً من ذكر الله '[8]",
          "en": "Abdullah bin Busr (raa) said that a man asked the Prophet (pbuh), O Messenger of Allah! Verily, the sanctions of Islam have become too numerous for me (to perform them all). Inform me of something (simple) that I may adhere to. The Prophet (pbuh) said, Let your tongue always be moist with the remembrance of Allah [8]"
        },
        {
          "ar": "وقال صلى الله عليه وسلم:' من قرأ حرفاً من كتاب الله فله به حسنة ،والحسنة بعشر أمثالها ، لا أقول : {الم } حرف؛ ولكن : ألف حرف ،ولام حرف ،وميم حرف '[9].",
          "en": "And he said, Whoever reads one letter from the Book of Allah, will receive one Hasanah (reward for a good deed), and one Hasanah comes with ten like it. I do not say that Alif-Lam-Mim is a letter. Indeed Alif is a letter, and Lam is a letter, and Mim is a letter [9]"
        },
        {
          "ar": "وعن عقبة بن عامر رضي الله عنه قال : خرج رسول الله صلى الله عليه وسلم ونحن في الصفة فقال :' أيكم يحب أن يغدو كل يوم إلى بطحان أو إلى العقيق فيأتي منه بناقتين كوماوين في غير إثم ولا قطيعة رحم ؟' فقلنا : يا رسول الله نحب ذلك . قال :' أفلا يغدو أحدكم إلى المسجد فيعلم ، أو يقرأ آيتين من كتاب الله عز وجل خير له من ناقتين ، وثلاث خير لهُ من ثلاث ٍ، وأربع خير لهُ من أربع ، ومن أعدادهن من الإبل'[10]",
          "en": "Uqbah bin Amir (raa) said: The Messenger of Allah (pbuh) came out (from his house) and we were of the porch (As-Suffah). So he said, Who of you would like to go out in the morning everyday to the valley of Buthan or Al-'Aqeeq and come back with two large she-camels without committing any sin or severing any family ties?, We replied, O Messenger of Allah! All of us would like this. So he said, Would one of you not go to the Masjid and learn to recite two Verses from the Book of Allah, the Mighty and Majestic? That would be better than two she-camels. And three Verses would be better for him than three she-camels. And four Verses would be better than four she-camels, and whatever their number may be of camels [10]"
        },
        {
          "ar": "وقال صلى الله عليه وسلم:' من قعد مقعداً لم يذكر الله فيه كانت عليه من الله ترة ومن اضطجع مضجعاً لم يذكر الله فيه كانت عليه من الله ترة'[11] .",
          "en": "And he said, Whoever sits and does not mention the Name of Allah (before he rises) will find it a cause of sorrow from Allah. Whoever lies down to sleep and does not mention the name of Allah before rising, will find it a cause of sorrow from Allah. [11]"
        },
        {
          "ar": "وقال صلى الله عليه وسلم : ' ما جلس قوم مجلساً لم يذكروا الله فيه ، ولم يصلوا على نبيهم إلا كان عليهم ترة ، فإن شاء عذبهم وإن شاء غفر لهم '[12] .",
          "en": "And the Prophet (saw) said: No people sit in an assembly without mentioning Allah, and without asking Allah for blessings on their Prophet, except that it will be a cause of sorrow upon them. Thus if He (Allah) wishes He will punish them, and if He wishes He will forgive them. [12]"
        },
        {
          "ar": "وقال صلى الله عليه وسلم :' ما من قوم يقومون من مجلس لا يذكرون الله فيه إلا قاموا عن مثل جيفة حمار وكان لهم حسرة '[13].",
          "en": "And he said: No people may rise from an assembly in which they have failed to mention the Name of Allah without it being as if they were getting off a dead donkeys rotting back, and it would be a cause of grief for them [13]"
        }
      ],
      "referances": [
        {
          "ar": "[1] - سورة البقرة آية :152",
          "en": "1: Al-Baqarah 2:152"
        },
        {
          "ar": "[2] - سورة الأحزاب آية : 41",
          "en": "2: Al-Ahzab 33:41"
        },
        {
          "ar": "[3] - سورة الأحزاب آية :35",
          "en": "3: Al-Ahzab 33:35"
        },
        {
          "ar": "[4] - سورة الأعراف ،آية :205",
          "en": "4: Al-Araf 7:205"
        },
        {
          "ar": "[5] - البخاري مع الفتح 11/208 ومسلم بلفظ 'مثل البيت الذي يذكر الله فيه والبيت الذي لا يذكر الله فيه مثل الحي والميت ' 1/539",
          "en": "5: Al-Bukhari, cf., Al-Asqalani, Fathul-Bari 11/208; Muslim 1/539 with the wording The house in which Allah is remembered and the house in which Allah is not remembered is like the living and the dead."
        },
        {
          "ar": "[6] - الترمذي 5/459 وابن ماجه 2/1245 وانظر صحيح ابن ماجه 2/316 وصحيح الترمذي 3/139 .",
          "en": "6: At-Tirmidhi 5/459, Ibn Majah 2/1245. See Al-Albani, Sahih Ibn Majah 2/316 and Sahih At-Tirmidhi 3/139."
        },
        {
          "ar": "[7] - البخاري 8/171 ومسلم 4 2061 واللفظ للبخاري .",
          "en": "7: Al-Bukhari 8/171, Muslim 4/2061; this wording is from Al-Bukhari."
        },
        {
          "ar": "[8] - الترمذي 5/458 وابن ماجه 2/1246 وانظر صحيح الترمذي 3/ 139 وصحيح ابن ماجه 2/ 317",
          "en": "8: At-Tirmidhi 5/458, Ibn Majah 2/1246. See Al-Albani, Sahih At-Tirmidhi 3/139 and Sahih Ibn Majah 2/317."
        },
        {
          "ar": "[9] - الترمذي 5/175 وانظر صحيح الترمذي 3/9 وصحيح الجامع الصغير 5/340 .",
          "en": "9: At-Tirmidhi 5/175. See Al-Albani, Sahih At-Tirmithi 3/9 and Sahihul-Jami' As-Saghir 5/340."
        },
        {
          "ar": "[10] - مسلم 1/553.",
          "en": "10: Muslim 1/553"
        },
        {
          "ar": "[11] - أبو داود 4/264 وغيره وانظر صحيح الجامع 5/342.",
          "en": "11: Abu Dawud 4/264. See Al-Albani, Sahihul-Jami' As-Saghir 5/342."
        },
        {
          "ar": "[12] - الترمذي وانظر صحيح الترمذي 3/140",
          "en": "12: At-Tirmidhi. See Al-Albani, Sahih At-Tirmidhi 3/140"
        },
        {
          "ar": "[13] - أبو داود 4/264 وانظر صحيح الجامع 5/176.",
          "en": "13: Abu Dawud 4/264, Ahmad 2/389. See Al-Albani, Sahihul-Jami' 5/176."
        }
      ]
    }
  },
  {
    "id": 3,
    "title": {
      "ar": "أذكار الاستيقاظ من النوم",
      "en": "When waking up"
    },
    "isFavorite": false,
    "details": {
      "type": "counter",
      "list": [
        {
          "descriptionTitle": {
            "ar": "",
            "en": ""
          },
          "description": {
            "ar": "الحَمْدُ لله الذِي أحْيَانا بَعْدَ مَا أمَاتَنَا وإلَيْهِ النَشُور",
            "en": "Praise is to Allah Who gives us life after He has caused us to die and to Him is the return."
          },
          "references": [
            {
              "ar": "أي الموت المجازي وهو النوم، يقال النوم الموت الخفيف",
              "en": "Alḥamdu lillāhil-ladhī 'aḥyānā , ba`da mā 'amātanā wa 'ilayhin-nushūr."
            },
            {
              "ar": "الإحياء بعد الإماتة (البعثة)",
              "en": ""
            },
            {
              "ar": "البخاري مع الفتح 11/ 113 ومسلم 4/ 2083",
              "en": "Al-Bukhari, cf. Al-Asqalani, Fathul-Bari 11/113; Muslim 4/2083"
            }
          ],
          "readCount": 1
        },
        {
          "descriptionTitle": {
            "ar": "",
            "en": ""
          },
          "description": {
            "ar": "الحَمْدُ لله الذِي عَافَانِي في جَسَدِي ورَدَّ عَلَيَّ رُوحِي، وأَذِنَ لي بِذِكْرهِ",
            "en": "Praise is to Allah Who gave strength to my body and returned my soul to me and permitted me to remember Him."
          },
          "references": [
            {
              "ar": "",
              "en": "Al-ḥamdu lillāhil-ladhī `āfānī fī jasadī, wa radda `alayya rūḥī, wa 'adhina lī bidhikrihi."
            },
            {
              "ar": "الترمذي 5/ 473 وانظر صحيح الترمذي3/144",
              "en": "At-Tirmidhi 5/473. See Al-Albani's Sahih Tirmidhi 3/144."
            }
          ],
          "readCount": 1
        },
        {
          "descriptionTitle": {
            "ar": "",
            "en": ""
          },
          "description": {
            "ar": "لا إلَهَ إلاَّ الله وحْدَهُ لا شَرِيكَ لَهُ، لَهُ المُلْكُ ولَهُ الحَمْدُ وهُوَ على كلِّ شيءٍ قَدير،سُبْحانَ الله والحَمْدُ لله  ولا إله إلا الله والله أكبر ولا حَولَ ولا قُوةَ إلا بالله العلي العظيم , اللَّهُمَّ اغْفِرْ لي",
            "en": "There is none worthy of worship but Allah alone, Who has no partner, His is the dominion and to Him belongs all praise, and He is able to do all things. Glory is to Allah. Praise is to Allah. There is none worthy of worship but Allah. Allah is the Most Great. There is no might and no power except by Allah's leave, the Exalted, the Mighty. My Lord, forgive me."
          },
          "references": [
            {
              "ar": "",
              "en": "Lā 'ilāha 'illallāhu waḥdahu la sharīka lahu, lahul-mulku wa lahul-ḥamdu, wa huwa 'alā kulli shay'in qadīr Subḥānallāhi, walḥamdu lillāhi, wa lā 'ilāha 'illallāhu, wallāhu 'akbar, wa lā ḥaula wa lā quwwata 'illā billāhil-`aliyyil-`aẓīm, rabbighfir lī."
            },
            {
              "ar": "قال رسول الله صلى الله عليه وسلم ' مَنْ تَعَارَ مِنَ اللَّيْل  فقالها حين يستيقظ ، غُفِرَ له",
              "en": "Whoever says this will be forgiven, and if he supplicates Allah, his prayer will be answered; if he performs ablution and prays, his prayer will be accepted"
            },
            {
              "ar": "قال الوليد: أو قال دعا استُجيبَ لهُ، فإن قام فتوضأَ ثم صَلّى قُبِلَتْ صَلاتُهُ",
              "en": ""
            },
            {
              "ar": "التعار السهر والتقلب على الفراش ليلاً مع الكلام",
              "en": ""
            },
            {
              "ar": "رواه البخاري مع الفتح 3/ 144 وغيرها واللفظ لابن ماجه انظر صحيح ابن ماجه 2/ 335",
              "en": "Al-Bukhari, cf. Al-Asqalani, Fathul-Bari 3/39, among others. The wording here is from Ibn Majah 2/335"
            }
          ],
          "readCount": 1
        }
      ]
    }
  },
  {
    "id": 4,
    "title": {
      "ar": "دعاء لبس الثوب",
      "en": "When wearing a garment"
    },
    "isFavorite": false,
    "details": {
      "type": "counter",
      "list": [
        {
          "descriptionTitle": {
            "ar": "",
            "en": ""
          },
          "description": {
            "ar": "الحَمْدُ لله الذِي كَساني هذا( الثوب ) ورَزَقَنِيه مِنْ غَيْرِ حَوْلٍ مِنّي ولا قُوةٍ",
            "en": "Praise is to Allah Who has clothed me with this (garment) and provided it for me, though I was powerless myself and incapable"
          },
          "references": [
            {
              "ar": "",
              "en": "Alḥamdu lillāhil-ladhī kasānī hādhā (aththawba) wa razaqanīhi min ghayri hawlim-minnī wa lā quwwah."
            },
            {
              "ar": " أخرجه أهل السنن إلا النسائي انظر إرواء الغليل 7/ 47",
              "en": "Al-Bukhari, Muslim, Abu Dawud, Ibn Majah, At-Tirmidhi. See also 'Irwa'ul-Ghalil 7/47."
            }
          ],
          "readCount": 1
        }
      ]
    }
  },
  {
    "id": 5,
    "title": {
      "ar": "دعاء لبس الثوب الجديد",
      "en": "When wearing a new garment"
    },
    "isFavorite": false,
    "details": {
      "type": "counter",
      "list": [
        {
          "descriptionTitle": {
            "ar": "",
            "en": ""
          },
          "description": {
            "ar": "اللَّهُمَّ لَكَ الحَمْدُ أَنْتَ كَسَوتَنِيه،أسْألك مِنْ خَيرِهِ وخَيْرَ ما صُنع لَهُ،وأعُوذُ بِكَ مِنْ شرِّه وشَرَّ ما صُنِعَ لَهُ",
            "en": "O Allah, praise is to You. You have clothed me. I ask You for its goodness and the goodness of what it has been made for, and I seek Your protection from the evil of it and the evil of what it has been made for."
          },
          "references": [
            {
              "ar": "",
              "en": "Allāhumma lakal-ḥamdu 'anta kasawtanīhi, 'as'aluka min khayrihi wa khayri mā ṣuni`a lahu, wa 'a`oothu bika min sharrihi wa sharri mā ṣuni`a lahu."
            },
            {
              "ar": "أبو داود والترمذي والبغوي وانظر مختصر شمائل الترمذي للألباني ص 47",
              "en": "Abu Dawud and At-Tirmidhi. See also Al-Albani, Mukhtasar Shama'il At-Tirmidhi, p. 47."
            }
          ],
          "readCount": 1
        }
      ]
    }
  }
]