[
    {
        "id": 1,
        "title": {
            "ar": "أركان الحج",
            "en": "Pillars of Hajj"
        },
        "mainImagePath": "assets/images/hajj/arkan.png",
        "details": {
            "ar": [
                "",
                "الإحرام",
                "من الإحرام تبدأ نيّة أداء النسك بالقلب ويتلفظ بها باللسان: لبيك اللهم حجاً",
                "",
                "الوقوف بعرفة",
                "قال النبي -صلى الله عليه وسلم-: (ما مِن يوم أكثر من أن يعتق الله فيه عبداً من النار من يوم عرفة، وإنه ليدنو ثم يباهي بهم الملائكة فيقول: ما أراد هؤلاء؟)",
                "",
                "طواف الإفاضة",
                "قال تعالى: ﴿ثُمَّ لْيَقْضُوا تَفَثَهُمْ وَلْيُوفُوا نُذُورَهُمْ وَلْيَطَّوَّفُوا بِالْبَيْتِ الْعَتِيقِ﴾",
                "",
                "السعي",
                "قال تعالى: ﴿إِنَّ الصَّفَا وَالْمَرْوَةَ مِن شَعَائِرِ اللَّهِ فَمَنْ حَجَّ الْبَيْتَ أَوِ اعْتَمَرَ فَلَا جُنَاحَ عَلَيْهِ أَن يَطَّوَّفَ بِهِمَا ۚ وَمَن تَطَوَّعَ خَيْرًا فَإِنَّ اللَّهَ شَاكِرٌ عَلِيمٌ﴾"
            ],
            "en": [
                "",
                "Ihram",
                "Upon entering the state of Ihram, the intention to perform the ritual begins in the heart. It may be articulated on the tongue, saying: Labbayka Allahumma Hajjan (O Allah, Here I am intending to perform Hajj)",
                "",
                "Standing at Arafah",
                "The Prophet (peace be upon him) said: There is no day when Allah sets free more servants from Hell than the Day of 'Arafah. He draws near, then praises them to the angels, saying: What do these want?",
                "",
                "Tawaf Al-Ifadhah",
                "Allah, the Almighty, said,: Then let them end their untidiness and fulfill their vows and perform Tawaf around the ancient House.",
                "",
                "Saa'i",
                "Allah, the Almighty, said,: Indeed, as-Safa and al-Marwah are among the symbols of Allah . So whoever makes Hajj to the House or performs 'umrah - there is no blame upon him for walking between them. And whoever volunteers good - then indeed, Allah is appreciative and Knowing"
            ]
        }
    },
    {
        "id": 2,
        "title": {
            "ar": "الإحرام",
            "en": "Ihram"
        },
        "mainImagePath": "assets/images/hajj/ihram.jpg",
        "details": {
            "ar": [
                "",
                "ما هو الإحرام؟",
                "الإحرام هو الدخول في عبادة الحج أو العمرة، والاشتغال بأعمالها قصداً. ويقال أَحْرَم إذا دخل في النسك، فيصبح محرّماً عليه ما كان مباحاً. ومن ذلك لبس الرجل المخيط، وأخذ الرجل والمرأة شيئاً من الشعر أو الأظفار أو مسّ الطيب. وللإحرام مظاهر وشعائر مخصوصة، ودلالات ترمز إلى التجرد من الدنيا وزينتها والإقبال على الله والعبادة بقلب نقي، وجوارح مطيعة.",
                "بالإحرام يبدأ المسلم أوّل أركان الحج والعمرة. فهو أول خطوة في رحلته الإيمانية، وهو عمل قلبي يدخل به في عبادة عظيمة أمَر الله أن نخلص له فيها النية وأن نقيمها لوجهه، كما قال سبحانه: ﴿وأتمّوا الحج والعمرة لله﴾.",
                "الدخول في الإحرام يوجب الامتناع عن كل ما يحظر فعله من محظورات الإحرام، مع نية الدخول في النسك بالتلبية. فمن أراد الحج يقول: لبّيك حجاً ، ومن أراد العمرة يقول: لبيك عمرةً، ومن ثم يبدأ بعدها التلبية. عن ابن عمر -رضي الله عنهما- قال: أن رسول الله -صلى الله عليه وسلم- سُئِل: (مَا يلبس المُحرم من الثياب؟ فقال: لا تلبسوا القُمُصَ، ولا العَمَائِمَ، ولا السّراويلات، ولا البَرَانِس، ولا الخفَافَ، إلا أحد لا يجد النّعلَين فَلْيَلْبَس الْخُفّين، وليَقطَعهُمَا أسفَل من الكَعبَين، ولا تَلبَسُوا شيئاً من الثّياب مسّه الزّعفَرَان، وَلَا الوَرس). وعن عثمان بن عفان -رضي الله عنه- أن رسول الله -صلى الله عليه وسلم- قال: (لا يَنكِحُ المُحرِمُ، ولا يُنكِحُ، ولا يَخطُب).",
                "",
                "ما هو لباس الإحرام للرجل؟",
                "يجب على المُحرم أن يخلع ملابسه المعتادة، فيزيل عنه أغطية الرأس من قبّعة وعمامة وغيرها، وكذلك اللباس المعتاد المفصل على الجسم، مثل: القميص، والبنطلون، والجوربين، والقفازين، وما في حكمه. وكذلك الأحذية التي تحيط كامل القدمين والكعبين. يلبس الرجل إزاراً يُحيط أسفل بدنه، ورداءً يغطي أعلاه. يشرع أن يكون الرداء أبيض اللون. وللرجل كذلك أن ينتعل نعالاً مناسباً لا يغطي كامل القدم. وبإمكان المحرم استخدام ما يلي:",
                "المشبَك أو الحزام الذي يلفه على وسطه كي يُمسك بإزاره عن السقوط، وأيضاً يضع فيه هاتفه وماله ونحوهما. .",
                "الساعات والخواتم.",
                "لواصق ولفائف الجروح والإصابات.",
                "المظلات الشمسية وكل غطاء لا يلاصق الرأس.",
                "",
                "ما هو لباس الإحرام للمرأة؟",
                "المرأة المسلمة مخيّرة عند إحرامها فيما تلبسه، فتحرم بما شاءت من الثياب والألبسة بألوانها وأشكالها، بشرط أن تكون تلك الملابس فضفاضة تسترها ولا تعيق حركتها، وليست فيها زينة ظاهرة يفتتن بها الرجال، قال النبي -صلى الله عليه وسلم: (ولا تَنتقِب المرأَةُ ولا تلبسُ القفّازينِ [يعني: في الإحرام]). إذن، محظورات الإحرام على المرأة هي:",
                "تغطية الوجه ولبس النقاب، ما لم تكن بحضرة أجانب فلها أن تغطي وجهها. - لبس القفازين.",
                "ويُباح للمرأة المحرمة ما يلي:",
                "النظارة والخاتم والساعة.",
                "تضميد الجراح باللاصق واللفافة.",
                "",
                "كيف يلبس المحرم الإحرام؟",
                "إحرام الرجل يكون بإزارٍ يغطي أسفل جسده، ورداءٍ يغطي أعلى الجسد. يسنُّ للمحرم أن يجعل الرداء على كتفيه جميعاً، وأن يجعل طرفيه على صدره، كما فعل النبي -عليه الصلاة والسلام. حتى إذا أراد أن يطوف طواف القدوم، اضطبع، فجعل وسط ردائه تحت إبطه الأيمن وأطرافه على عاتقه الأيسر، وكشف منكبه الأيمن في حالة الطواف. ومَن كشف منكبه دائماً فهو يخالف بذلك السنة، إلا إذا كان ذلك لأكله وشربه وقضاء حاجته.",
                "وعلى كل حال، الغاية أن يكون الإحرام ساتراً، ومريحاً في الحركة، ومُحكماً لا يرتخي ولا يسقط. فمن وجد سهولة في ارتدائه بصفة معيّنة كالذين يعتادون الإزار والرداء في لباسهم الشعبي في بعض مناطق المسلمين، فلهم ذلك.",
                "",
                "التلبية",
                "تبدأ التلبية مع الإحرام. فعند دخول الحاج أو المعتمر في الإحرام، ينوي ما يريد أداءه من حج أو عمرة أو كِلَيْهما ثم يقول: لبّيك حجاً ، أو لبّيك عمرةً ، أو لبّيك عمرةً وحجاً ، وبذلك يكون محرماً؛ ثم يرفع صوته ملبياً بتلبية النبي -صلى الله عليه وسلم-: (لبّيكَ اللهُم لبّيكَ، لبّيكَ لا شريكَ لك لبّيك، إنّ الحمْدَ والنّعمةَ لك والْمُلْك، لا شريكَ لك). وتنتهي التلبية في العمرة عند رؤية البيت أو بدء الطواف، وفي الحج عند رمي جمرة العَقَبة.",
                "ومعنى قول الحاج أو المعتمر: لبيك ، أي: إجابة لك يا ربي. وقد ثُنّيت التلبية إرادة التكرار، وليس المعنى أن الإنسان يجيب ربه مرتين فحسب، بل المعنى أنه يجيبه مرة بعد أخرى، فالتثنية هنا مراد بها إجابة الإنسان ربه، وإقامته على طاعته. ثم إنه بعد هذه الإجابة يقول: (إن الحمد والنعمة لك والملك). والحمد هو وصف المحمود بالكمال، فإذا كرّر صار ثناءً، والنعمة هي ما يتفضل الله به على عباده من حصول المطلوب ودفع المكروه.",
                "",
                "الاشتراط في الإحرام",
                "الإسلام دين يُسر وتيسير كما قال -سبحانه وتعالى-: ﴿يريد الله بكم اليُسر ولا يريد بكم العُسر﴾. ومن مظاهر هذا التيسير على المسلم في أداء العبادات؛ مراعاة الظروف التي قد تمنعه من إكمال نسكه الذي نواه من حج أو عمرة؛ فيشرع له إن خاف ألا يُكمل نسكه لأي سبب كان أن يشترطَ في إحرامه.",
                "يكون الاشتراط في الحج أو العمرة عند الخوف من عدم إتمام النسك، إما لمرض أو عذر شرعي، أو سبب خارج عن إرادته، فيشرع عند الإحرام الاشتراط في النية، وذلك بأن يقول بعد قوله: لبيك عمرة أو لبيك حجا : فإن حبسني حابسٌ فمحِلِّي حيث حبستني . وتقال بأي لغة يُحسنها الحاج أو المعتمر، فإذا قالها واشترط، وحصل أمرٌ منعه من إتمام النسك، جاز له الخروج من الإحرام والتوقف عن إكمال النسك الذي أحرم لأجله، وليس عليه شيء.",
                "",
                "الإحرام من الطائرة",
                "من تيسير الله لعباده وفتحه بالعلم والدليل على فقهاء الإسلام؛ فقد رُخّص للحاج والمعتمر القادم عبر الطائرة أن يُحرم في طائرته عند محاذاة الميقات، قبل وصوله إلى مدينة جدة.",
                "تعلن الطائرات في العادة محاذاة الميقات قبل الوصول إليه بزمن كافٍ، ثم تعيد التنبيه عند محاذاته، وعلى من أراد الحج أو العمرة أن يستعد بلباس الإحرام وإزالة ما يحظر عليه حال الإحرام قبل مدة كافية من إعلان المحاذاة؛ حتى لا يحصل ازدحام عند دورات المياه في الطائرات. وعند إعلان المحاذاة ينوي المسلم الإحرام بما يقصده من سفرته بالحج أو العمرة، ثم يتلفظ بما نواه فيقول: لبيك حجاً أو لبيك عمرة ، ثم يبدأ التلبية.",
                "نوصي الحاج أو المعتمر أن يتنبّه ويبقى مستيقظاً إلى أن ينوي الإحرام عند الميقات، وإن خشي على نفسه النوم والغفلة فله أن يحرم قبل محاذاة الميقات، وإذا خاف عدم إصدار طاقم الطائرة تنبيه المحاذاة أو علِم أنهم لا ينبهون؛ فله الإحرام قبل الوصول بوقتٍ كافٍ احتياطاً، مثل أن يحرم قبل موعد الوصول بنصف ساعة (30 دقيقة).",
                "",
                "سنن قبل الإحرام",
                "يُسن للمُحرِم قبل أن ينوي الإحرام عدّة فضائل:",
                "الاغتسال أو الوضوء: يشرع الاغتسال أو الوضوء قبل أن ينويَ الحاج أو المعتمر الإحرامَ. ذلك على سبيل الندب لا الوجوب، للذكور والإناث في كل أحوالهم. ومن لم يتيسر له الغسل يُشرع له الوضوء.",
                "الاغتسال في البيت: الذي لا يمكِنه الاغتسال عند الميقات؛ كمن يسافر بالطائرة، يشرع له الاغتسال للإحرام في بيته عند خروجه إلى المطار، ثم يُحرِم عند محاذاة الطائرة الميقات.",
                "النظافة الشخصية، من قص الأظافر وإزالة شعر الإبط ونحوه، مشروعة في كل حال، وتتأكد له قبل إحرامه لأنه ممنوع من إزالتها في إحرامه.",
                "الإحرام بعد صلاة:",
                "يُشرع للمحرم أن يحرم بعد صلاة، فإذا وافقَ وقتُ إحرامهِ صلاةً مكتوبةً فإنه يصليها ثم ينوي الإحرام، وإن لم يكن فيُشرع له أن يتوضأ ويصلي ركعتين ثم يحرم بعدها ويلبي. قال -صلى الله عليه وسلم-: أتاني آتٍ من ربي، وقال: صلّ في هذا الوادِ المبارك، وقل: عمرة في حجة.",
                "",
                "وصايا للمُحرِم",
                "أنت الآن في عبادة عظيمة دخلت فيها فور نيتِك وتلبيتِك، وهذه بعض وصايا تهمّك:",
                "اقرأ ما لخصناه لك من محظورات الإحرام، حتى لا تقع في أيٍ منها فيتأثر حجك.",
                "عظّم شعائر الله وأوامرَه ونواهيه، وأعطها حقها من التقدير والاحترام. قال تعالى: ﴿وَمَن يُعَظّمْ شَعَائِرَ اللَّهِ فَإِنَّهَا مِن تَقْوَى الْقُلُوبِ﴾",
                "ابتعد عن كل ما يخدش إحرامك من الخصام ورفع الصوت والإيذاء والجدال. قال تعالى: ﴿فَمَن فَرَضَ فِيهِنَّ الْحَجَّ فَلَا رَفَثَ وَلَا فُسُوقَ وَلَا جِدَالَ فِي الْحَج﴾",
                "أكثِر من التلبية، فإنها ذكرٌ ودعاءٌ عظيم لا يشرع إلا في هذه اللحظات، قال -صلى الله عليه وسلم-: (ما من مسلم يلبي؛ إلاّ لبى ما عن يمينه وشماله -من حجر، أو شجر، أو مدَر، حتى تنقطع الأرض من ها هنا وها هنا).",
                "احرص على التقيد بتعليمات رجال الأمن ومشرفي الحملات.",
                "احرص على تعلّم ما تحتاجه من الأحكام الشرعية في نُسكك الذي تُقبل عليه.",
                "لا تواجه أشعة الشمس مباشرة، واستخدم المظلة إن اضطررت إلى الخروج نهاراً.",
                "استخدم من المراهم ما يقيك التسلخات الجلدية والتهابات ثنايا الجسم بعد ارتداء الإحرام،",
                "اهتمم بالنظافة الشخصية، وتهوية ثنايا الجسم (مثل الفخذين والإبطين).",
                "استخدم المراهم العلاجية عند الإصابة بالتسلخات الجلدية، مع غسل المنطقة بالماء قبل وضع المرهم."
            ],
            "en": [
                "",
                "What is Ihram?",
                "Ihram is entering into the worship of Hajj or Umrah, and deliberately engaging oneself in its actions. The root verb “ahrama” mans ‘to enter into the rituals’, in which case permissible things then become forbidden. Forbidden things include, men wearing sewn clothes, and men and women cutting something from their hair, clipping nails, or applying perfume. Ihram has specific manifestations and rituals, and indications that symbolize detachment from the world and its adornment, the turnout to Allah, and worship with a pure heart and obedient limbs.",
                "By entering the state of Ihram, the Muslim begins the first pillars of Hajj and Umrah. It is the first step in his/her journey of faith, and it is an act of the heart that makes him/her enter into a great act of worship. Allah, the Almighty, said: And complete the Hajj and ‘Umrah for Allah.",
                "Entering into the state of ihram necessitates abstaining from all the prohibitions of Ihram, to enter the rituals by reciting the Talbiyah. A person who intends to perform Hajj should say: Labbayka Allahumma Hajjan (O Allah, here I am intending to perform Hajj); one who intends to perform Umrah should say: Labbayka 'Umaratan (O Allah, here I am intending to perform Umrah) and then commences Talbiyah. On the authority of Ibn Umar (may Allah be pleased with them) who said: The Messenger of Allah (peace be upon him) was asked: What should a Muhrim wear? He answered: Do not wear a shirt, turbans, trousers, a hooded cloak, or Khuffs (socks made from thick fabric or leather); but if someone cannot get sandals, then he can wear Khuffs after cutting them short below the ankles. Do not wear clothes to which Saffon or Wars (two kinds of perfumes) are applied. On the authority of ‘Uthman ibn ‘Affan (may Allah be pleased with him) who said that the Messenger of Allah (peace be upon him) said: A Muhrim must not contract marriage, nor help others contract marriage, nor get engaged for marriag",
                "",
                "What should a man wear for Ihram?",
                "A Muhrim must take off his usual clothes, so he removes the head covering, such as a hat, a turban, and others. He must also remove the usual clothing tailored to fit the body, such as: shirt, pants, socks, gloves, and the like, as well as shoes that surround the entire feet and heels. A man wears an Izaar that covers his lower body and a Ridaa' that covers the upper part. The Ridaa’ may be white. A man may also wear suitable slippers that do not cover the entire foot. The Muhrim can use the following:",
                "The clip or belt that he wraps around his waist in order to hold his lower garment from falling, and he also puts his phone, money, and the like in it. .",
                "Watches and rings.",
                "Bandages and wraps for wounds and injuries.",
                "Umbrellas and every cover but without his head being touched or without that item sitting on the head directly.",
                "",
                "What should a woman wear for Ihram?",
                "A Muslim woman who enters the state of Ihram may wear clothes of all colors and shapes, on the condition that these clothes are loose-fitting, cover her body, do not hinder her movement, and do not contain visible adornment that attracts men. The Prophet (peace be upon him) said: Women may not cover their faces or wear gloves [i.e. in the state of Ihram]. So, the restrictions of Ihram for women are:",
                "Covering the face and wearing the Niqab, unless she is in the presence of non-Mahram men, in which case she may cover her face",
                "Wearing gloves. The following are permissible for a woman in the state of Ihram:",
                "Wearing glasses, rings, and watches.",
                "Wound dressing with band-aid and bandage.",
                "",
                "How to wear Ihram?",
                "A man wears an Izaar that covers his lower body and a Ridaa’ that covers the upper part. It is an act of Sunnah for the Muhrim to put the robe on all of his shoulders, and to put its two ends on his chest, as the Prophet (peace be upon him) did. When he wants to perform the Arrival Tawaf, he should make Idtibaa’ i.e., place the middle of his garment under his right armpit and its ends on his left shoulder, and uncover his right shoulder in the case of Tawaf. Someone who always uncovers his shoulder is violating the Sunnah, unless that is for eating, drinking, and relieving himself.",
                "In any case, the goal is for the Ihram to be covering the whole body, be comfortable in movement, and be tightly fitted, not loosening or prone to drop. Someone who finds it easy to wear it in a specific way, such as those who used to wear the Ridaa’ and the Izar in their popular dress in some Muslim regions, may do so",
                "",
                "Talbiyah",
                "The Talbiyah begins with the Ihram. When the pilgrim or performer of Umrah enters the state of Ihram, he/she intends to perform Hajj or 'Umrah or both, then says: Labbayka Hajjan [O Allah I intend to perform Hajj], Labbayka 'Umaratan [O Allah I intend to perform 'Umrah], or Labbayka 'Umaratan wa Hajjan, [O Allah I intend to perform 'Umrah and Hajj]. By doing so, he enters the state of Ihram. He then pronounces Talbiyah loudly, following the example of the Prophet (peace be upon him): Labbayk Allaahumma labbayk, labbayk laa shareeka laka labbayk, 'innal-hamda, wanni'mata, laka walmulk, laa shareeka laka. [Ever at Your service, O Allah, ever at Your service. Ever at Your Service, You have no partner, ever at Your service. Verily all praise, blessings and dominions are Yours. You have no partner] The Talbiyah ends in 'Umrah when seeing the Sacred House or starting Tawaf, and in Hajj when throwing Jamrat Al-Aqabah.",
                "The meaning of the saying of the pilgrim or performer of 'Umrah: Labbayk, 'here I am answering Your Call, O my Lord.' The Talbiyah is to be pronounced repeatedly. The aim is that a person answers his Lord not only once or twice, but rather again and again. Repetition indicates the willingness to answer the Lord’s Call and the servant’s dwelling on obedience to Him. After this answer, he says: 'innal-hamda, wanni'mata, laka walmulk, [verily all praise, blessings and dominions are Yours.] Hamd is describing the praised with perfection; if it is repeated, it becomes thanaa'. Ni'mah is what Allah bestows upon His servants by giving them what they desire and repel what is bad.",
                "",
                "Stipulating a condition for entering Ihram",
                "Islam is a religion of ease and facilitation, as Allah, the Almighty, said: Allah intends for you ease and does not intend for you hardship One of the manifestations of this facilitation for the Muslim in performing acts of worship is taking into account the circumstances that may prevent him from completing the Hajj or Umrah that he intended. Therefore, it is allowed for him, if he fears that he will not complete his rituals for any reason, to stipulate a condition for entering Ihram.",
                "Stipulating a condition for Hajj or Umrah is when there is fear of not completing the rituals, either due to illness or a legitimate excuse, or a reason beyond his control. So when entering Ihram, it is allowed to stipulate the intention. After saying: Labbayka Hajjan [O Allah I intend to perform Hajj], Labbayka 'Umaratan [O Allah I intend to perform 'Umrah], a pilgrim should further say, If something prevents me from continuing, then my exiting Ihram will be at the place where You caused me to be prevented from continuing. It may be said in any language that the pilgrim or performer of Umrah masters. If he says it coupled with a stipulation, and something happens that prevents him from completing the rituals, he may leave the state of Ihram and stop completing the rituals for which he entered Ihram, and he does not have to do anything in compensation.",
                "",
                "Assuming Ihram on the airplane",
                "From Allah's facilitation to His servants and endowing the jurists of Islam with knowledge and deduction of evidence that pilgrims and performers of Umrah arriving by plane are permitted to enter Ihram on their plane at the Miqaat proximity, before arriving in the city of Jeddah.",
                "The Miqaat is usually announced well ahead of time during the flights of Saudi Airlines for the passengers to get ready. Another announcement is made when reaching it. Those who want to perform Hajj or Umrah must prepare by wearing the Ihram garments and remove any dress/item that becomes prohibited in the state of Ihram well before reaching it to avoid the overcrowdedness of the plane toilets. When the Miqaat proximity is announced, the Muslim intends to enter Ihram according to what he intends to do from his trip, Hajj or Umrah, then he utters what he intends, saying: Labbayka Hajjan, or Labbayka 'Umaratan, and then commences Talbiyah.",
                "We advise the pilgrim or performer of Umrah to wake up and stay awake until he intends to enter Ihram at the Miqaat. He may enter Ihram well before arrival, half an hour (30 minutes), as a precaution.",
                "",
                "Sunnah acts before Ihram",
                "A Muhrim may do some Sunnah acts before intending Ihram, including:",
                "Taking a bath or making Wudu (ablution)",
                "Ghusl (washing the whole body) or Wudu is recommended before the pilgrim intends to enter Ihram. This is a matter of recommendation, not obligation, for males and females in all their conditions. If Ghusl is not possible, a pilgrim may just make Wudu.",
                "Taking a bath at home",
                "The one who cannot take a bath at the Miqaat, like someone who travels by plane, may take a bath at home for Ihram before going out to the airport, then enters Ihram when the plane comes in line with the Miqaat.",
                "Personal hygiene, such as cutting nails, removing armpit hair, and the like, is recommended in every case, and it is even stressed before entering Ihram, because it is forbidden to remove these during Ihram.",
                "Entering Ihram after performing prayer:",
                "It is recommended to enter Ihram after offering prayer. If the time of Ihram coincides with a prescribed prayer, a person should perform it first and then intends to enter Ihram. If not, it is recommended for him to perform Wudu and pray two rak’ahs, then enter Ihram and start pronouncing Talbiyah. The Prophet (peace be upon him) said: A messenger came to me from my Lord and asked me to pray in this blessed valley and to assume Ihram for Hajj and Umrah together",
                "",
                "Tips:",
                "You are now engaged in a great worship that you enter into as soon as you make intention and pronounce Talbiyah. Here are some tips of interest to you:",
                "Read the prohibitions of Ihram summary we have prepared for you so that you do not fall into any of them lest your Hajj shall be affected.",
                "Honor Allah's rituals, commands, and prohibitions, and give them their due appreciation and respect. Allah, the Almighty, said: That [is so]. And whoever honors the symbols of Allah - indeed, it is from the piety of hearts.",
                "Stay away from everything that blemishes your Ihram, such as quarrels, raising your voice, abuse, and arguments. Allah, the Almighty, said: Hajj is [during] well-known months, so whoever has made Hajj obligatory upon himself therein [by entering the state of ihram], there is [to be for him] no sexual relations and no disobedience and no disputing during Hajj",
                "Pronounce much Talbiyah, for it is a great remembrance and supplication that is not prescribed except in these moments. The Prophet (peace be upon him) said: There is no Muslim who says the Talbiyah except that - on his right and left, until the end of the land, from here to there - the rocks, or trees, or mud say the Talbiyah.",
                "Be sure to adhere to the instructions of security personnel and campaign supervisors.",
                "Make sure to learn the must-know Shari’ah rulings on the rituals that you are about to perform.",
                "Do not face the sun directly, and use an umbrella if you have to go out during the day.",
                "Use ointments to protect you from skin abrasions and inflammation of the folds and creases of the body after wearing the Ihram.",
                "Pay attention to personal hygiene, and keep body folds and creases, such as the thighs and armpits, well-ventilated.",
                "Use medicated ointments when skin abrasions occur, and wash the area with water before applying the ointment."
            ]
        }
    },
    {
        "id": 3,
        "title": {
            "ar": "دخول الحرم",
            "en": "Entering the Grand Mosqu"
        },
        "mainImagePath": "assets/images/hajj/haram.jpg",
        "details": {
            "ar": [
                "",
                "روحانية اللقاء",
                "الدخول إلى الحرم يعطي شعوراً مفعماً بالإيمان، ففي تلك اللحظات تتجلى المشاعر العالية، والهيبة والخشوع. فمن نفس البقعة كان دعاء إبراهيم -عليه السلام- حين قال: ﴿ربّنَا إِنّي أَسْكَنتُ مِن ذُريّتِي بِوَادٍ غَيْرِ ذِي زَرْعٍ عِندَ بَيْتِكَ الْمُحَرّمِ رَبّنَا لِيُقِيمُوا الصّلَاةَ فَاجْعَلْ أَفْئِدَةً مّنَ النّاسِ تَهْوِي إِلَيْهِمْ وَارْزُقْهُم منَ الثّمَرَاتِ لَعَلّهُمْ يَشْكُرُونَ﴾.",
                "",
                "ما الذي يمنع دخوله إلى الحرم المكي؟",
                "أبرز ما يُمنع إدخاله إلى المسجد الحرام:",
                "المأكولات والمشروبات (عدا القهوة والتمر والماء).",
                "الآلات الحادة.",
                "السوائل القابلة للاشتعال.",
                "الحقائب الكبيرة والأمتعة.",
                "عربات الأطفال.",
                "على الحاج والمعتمر عدم ترك أمتعته وأغراضه الشخصية عند البوابات، وبدلاً من ذلك إيداعها في صناديق الأمانات في ساحات الحرم.",
                "",
                "بوابات الحرم المكي",
                "توجد بوابات عديدة تؤدّي إلى داخل المسجد الحرام. لكل باب رقم يخصّه، وتعلو هذه البوابات لوحات مضيئة تُظهر عن بُعد معلومات الدخول أو الخروج. الأبواب الرئيسة الخمسة في المسجد الحرام:",
                "باب الملك عبد العزيز، رقم (1) في الساحة الغربية.",
                "باب الصفا، رقم (11) في جهة المسعى.",
                "باب الفتح، رقم (45) في الساحة الشمالية.",
                "باب العمرة، رقم (62) في الساحة الشمالية.",
                "باب الملك فهد، رقم (79) في الساحة الغربية.",
                "",
                "الدخول بالعربات اليدوية (الكراسي المتحركة)",
                "إذا قَدِم الحاج أو المعتمر إلى الحرم المكي بعربته اليدوية الخاصّة (الكراسي المتحرّكة)، وأراد الدخول واستخدامها في الحرم، فيسمح له بذلك شرط الدخول من مدخل العربات المخصص. وتتوفر في الحرم المكي: خدمة دافعي العربات، وخدمة العربات العادية والكهربائية.",
                "",
                "الأطفال في الحرم",
                "يُتاح للآباء والأمهات اصطحاب أطفالهم من مختلف الأعمار لأداء الصلوات في الحرم المكي. أمّا اصطحابهم إلى العمرة فيتطلب استخراج تصريح عمرة عبر تطبيق نُسُك لمن تتجاوز أعمارهم 5 سنوات. وعلى وليّ أمر الطفل تزويد الطفل ببطاقة تعريفية أو سوار يحملان اسمه ورقم التواصل مع الأسرة، مع الإمساك بيده دائماً، وعدم الابتعاد عنه حتى لا يتيه، مع الحرص على تعليمه الهدوء وعدم إزعاج المصلين.",
                "ويتوفر في الحرم المكي (مركز العناية بالأطفال التائهين). يستقبل المركز الأطفال التائهين في رحاب المسجد الحرام، بإشراف أمن الحرم المكي الذي يتابع استلام الأطفال وتسليمهم إلى ذويهم."
            ],
            "en": [
                "",
                "Spirituality",
                "Entering the Grand Mosque gives a feeling of full faith - in those moments high feelings, prestige and reverence are evident. It is in this same place that Prophet Ibrahim (peace be upon him) made his well-known supplication, saying: Our Lord, I have settled some of my descendants in an uncultivated valley near Your sacred House, our Lord, that they may establish prayer. So make hearts among the people incline toward them and provide for them from the fruits so that they might be grateful.",
                "",
                "Things not allowed inside the Grand Mosque",
                "The following are the most common items not allowed to be brought into the Grand Mosque:",
                "Food and drinks (except for coffee, dates, and water).",
                "Sharp tools.",
                "Flammable liquids.",
                "Large bags and luggage.",
                "Strollers.",
                "Hajj and Umrah performers should not leave their luggage and personal items at the gates. Instead, they should deposit them in safety deposit boxes in the outer piazzas of the Grand Mosque.",
                "",
                "The gates of the Grand Mosque of Makkah",
                "There are many gates leading into the Grand Mosque. Each gate has a unique number. These gates are topped with illuminated panels that show entry or exit information at a distance. The five main doors in the Grand Mosque:",
                "King Abdul Aziz Gate, No. (1) in the western piazza.",
                "Bab Al-Safa, No. (11) on the Masaa direction.",
                "Bab Al-Fath, No. (45) in the northern piazza.",
                "Bab Al-Umrah, No. (62) in the northern piazza.",
                "King Fahd Gate, No. (79) in the western piazza",
                "",
                "Entering with hand-propelled wheelchairs",
                "If the Hajj or Umrah performer comes to the Grand Mosque in Makkah with his wheelchair and wants to enter and use it inside it, he is allowed to do so, provided that he enters through the designated entrance. Available in the Grand Mosque of Makkah: wheelchair assistance service, and regular and electric wheelchair service.",
                "",
                "Children in the Grand Mosque",
                "Parents are allowed to bring their children of all ages to perform prayers in the Grand Mosque of Makkah. However, an Umrah permit through the Nusuk application is required to bring them for Umrah for those over 5 years of age. The child’s guardian/parent must provide the child with an identification card or bracelet that bears his name and the contact number of the family, while always holding his hand, and not leaving them unattended so as not to get lost. They should be instructed to keep quiet and not to disturb worshipers.",
                "Lost Children's Care Center is available in precincts of the Grand Mosque of Makkah. The Center receives lost children in the vicinity of the Grand Mosque, under the supervision of the security of the Grand Mosque of Makkah, which follows up on the receipt of children and their handover to their families."
            ]
        }
    },
    {
        "id": 4,
        "title": {
            "ar": "الطواف",
            "en": "Tawaf"
        },
        "mainImagePath": "assets/images/hajj/tawaf.jpg",
        "details": {
            "ar": [
                "",
                "صفة الطواف",
                "الطواف ركن من أركان الحج والعمرة، وهو عبادة لله تُظهر الافتقار والتوجه بالقلب والجوارح إليه سبحانه، يقوم فيها المسلم بالطواف حول بيته الكريم -الكعبة- تعبداً لرب البيت وتقرباً إليه بما شَرع. وصِفته أن يبتدئ الحاج أو المعتمر طوافه من الرّكن الذي فيه الحجر الأسود، حيث توجد في الأدوار العلوية علامة خضراء تدلّ عليه. من هذه النقطة يكبّر الطائف بداية كل شوط جديد. وليس شرطاً أن يكون التكبير في ذات النقطة بالضبط، بل الأمرُ تقريبي، فإذا وجد الحاج أو المعتمر نفسه قد حاذى الحجر فإنه يكبر.",
                "صِفَة التكبير أن يُشيرَ بيده إلى الحجر الأسود، ثم يبتدئ طوافه جاعلاً الكعبة عن يساره (عكس عقارب الساعة)، وإن استطاع تقبيل الحجر الأسود فقد أدّى السنة، وإن لم يتيسر له ذلك -في أيام المواسم والزحام- فلا شيء عليه. ويستحب للطائف إكثار الدعاء إلى الله والابتهال إليه، كما يستحب له أيضاً إذا وصل إلى الركن الذي يسبق الحجر الأسود، الذي يسمى الرّكن اليماني ، أن يمسح عليه إذا تيسر له، وتكرار ذلك في أشواطه السبعة.",
                "",
                "الرّمَل",
                "الرّمل هو الإسراع في الطواف، وهو من سنن المصطفى رسول الله -صلى الله عليه وسلم- في طواف العمرة وطواف القدوم. وهو يختلف عن الهرولة التي في السّعي. في الرّمَل يُسن للرجال -إن تيسّر لهم- تعجيل خطاهم، والمشي سريعاً مع تقارب الخُطى في الأشواط الثلاثة الأولى، اقتداءً برسول الله -صلى الله عليه وسلم- ثم إتمام الأشواط الأربعة الباقية مشياً معتاداً. أما النساء فلا يرملن. كما لا يشرع الرّمَل للجنسين في طواف الإفاضة (الحج) ولا طواف الوداع ولا طواف النافلة.",
                "",
                "الاضطباع",
                "الاضطباع سنّة من سنن المصطفى -صلى الله عليه وسلم. تتمثل في إظهار الرجل كتفه الأيمن في طواف العمرة وطواف القدوم، ولا تُشرع في غيرهما من أنواع الطواف.",
                "جاءت مشروعية الاضطباع حينما ورَد أن قريشاً قالت عن النبي -صلى الله عليه وسلم- وصحابته: (يقدم عليكم قوم قد أوهنهم المرض)، فأراد رسول الله -صلى الله عليه وسلم- وصحابته أن يُظهروا قوتهم ونشاطهم بإبراز أكتافهم، ثم استمر رسول الله -صلى الله عليه وسلم- وصحابته في فعلها بعد ذلك. واليوم، يقتدي فيها المسلم برسوله، ويُظهر قوته ونشاطه في التوجه إلى ربه -عز وجل.",
                "",
                "طواف القدوم",
                "هو الطواف الذي يؤدّيه الحاج أولَ وصوله إلى مكة، ويسمى أيضاً طوافَ التحية. يطوف طواف القدوم من أحَرم بالحج وقدمَ إلى مكة، وذلك قبل يوم عرفة بوقتٍ يكفي للطواف. والمعنيّون بطواف القدوم هم من كان نُسُكهم الإفراد والقران؛ إذ يتأكّد في حقهم عند الوصول إلى مكة طواف سبعة أشواط بالكعبة. ويسقط طواف القدوم عن المتمتع، وعمّن توجه إلى عرفة مباشرة، وعن المرأة الحائض أو النفساء.",
                "صفة الطواف مثل طواف العمرة، ويُشرع في حق من أتم طواف القدوم أن يسعى بين الصفا والمروة سبعة أشواط، ويكون هذا هو سعي الحج اللازم عليه لإتمام الحج، ولا يحتاج بعده إعادة السعيَ عند طواف الإفاضة يومَ العيد. ويُسن في طواف القدوم كل ما يُسن في طواف العمرة، وعلى الحاج أن يتقيد بتعليمات ومواعيد برنامج حملة الحج حتى لا يضطرب جدول بقية الحملات.",
                "",
                "الكعبة",
                "الكعبة هي بيتُ الله الحرامُ، والبناءُ المعظّم عند المسلمين، ذو المكانة الكبيرة والتاريخ الجليل. رَفع بناءه خليل الله إبراهيم مع ابنه إسماعيل -عليهما السلام، قال تعالى: ﴿َإِذْ يَرْفَعُ إِبْرَاهِيمُ الْقَوَاعِدَ مِنَ الْبَيْتِ وَإِسْمَاعِيلُ رَبّنَا تَقَبّلْ مِنّا ۖ إِنّكَ أَنتَ السّمِيعُ الْعَلِيمُ﴾. وهي أول بيتٍ وضعه الله في الأرض لعبادته -وحده لا شريك له؛ قال تعالى: ﴿إن أَوّلَ بَيْتٍ وُضِعَ لِلنَاسِ لَلَذي بِبَكَة مُبَارَكًا وَهُدًى لِلْعَالَمِينَ﴾. وهي قِبْلة المسلمين ومَهوى أفئدتهم، وحولها فقط يكون طوافهم. للكعبة عدّة معالم بارزة يراها الطائف حين طوافه، وهي:",
                "الحَطيم (حِجر إسماعيل)",
                "سورٌ مقوّس ملتصق بالكعبة، كان في أصله جزءٌ من الكعبة التي بناها إبراهيم وإسماعيل (عليمهما السلام)، والصلاة والوقوف فيه كالصلاة والوقوف داخل الكعبة.",
                "باب الكعبة",
                "يقع في الجهة الشرقية من الكعبة، وهو مصنوع اليوم من الذهب الخالص، ويرتفع عن الأرض بمقدار (222) سم.",
                "الملتزَم",
                "هو الجدار الشرقي أو جزء منه، يقع بين الحجر الأسود وبين باب الكعبة، ومعنى الالتزام هو: وضع الداعي صدرَه ووجهه وذراعيه وكفّيه على هذا الجدار، وابتهاله إلى الله تعالى بما تيسّر له. وقد يصعب هذا في المواسم.",
                "الميزاب",
                "هو الجزء المثبّت على سطح الكعبة لتصريف المياه، منه تصبّ المياه على حِجر إسماعيل.",
                "الشاذروان",
                "هو دعامة أرضيّة تحيط الكعبة كالإزار، وهو ليس من الكعبة في أصله وإنما وُضِع لتقوية بناء الكعبة وحمايتها من السيول، وقد حوفظ عليه عبر السنين، وهو اليوم مكسوٌّ برخام أبيض.",
                "الحجر الأسود",
                "الحَجَر الأسود من أحجار الجنّة؛ كما قال -صلى الله عليه وسلم. وهو مَبدأ الطواف ونهايتُه. وقد وضعه النبيّ -صلى الله عليه وسلم- في مكانه حينما اختلفت قريش فيمن سيضعه، وذلك بعد أن أعادوا بناء الكعبة إثر تهدّم جزء من بنائها بفعل الأمطار.",
                "الركن اليماني",
                "الركنُ اليمانيّ هو أحدُ الأركان الأربعة من الكعبة المشرّفة، وقد سُمّي باليماني؛ لأنه من جهة اليمن، ويُطلَق عليه هو والحجر الأسود الركنان اليمانيان",
                "",
                "الطواف بالعربات",
                "يجوز لمن لا يستطيع المشي، أو مَن أحسّ الإعياء والمرض والتعب، أن يطوف راكباً. وعليه أن يبقى مستيقظاً منتبهاً لأنه في عبادة، وأن يشغل وقته بالدعاء والتضرع إلى الله.",
                "",
                "سنة الصلاة بعد الطواف",
                "يُسن للطائف بعد أن ينهي طوافه أن يصلي ركعتين، وهي من السنن المؤكدة لكل من طاف بالكعبة لحج أو عمرة أو تنفلاً مطلقاً بالطواف. ويشرع للمصلّي أن يقرأ في الركعة الأولى (سورة الكافرون)، وفي الركعة الثانية (سورة الإخلاص). ولأن الطواف شعار التوحيد وإفراد العبادة لله وحده لا شريك له؛ فشرع له أن يعلن ذلك في السور التي يقرؤها عند إتمام طوافه.",
                "يسن -إن تيسّر ذلك- صلاة الركعتين خلف مقام إبراهيم، حيث يكون المقام بينه وبين الكعبة وإن بعُد المقام عنه. وعلى المصلّي التزام المكان الذي يُشير إليه رجال الأمن. فكل مكان في المسجد الحرام يصح أن تؤدى فيه الركعتين، وتوجيهات رجال الأمن تصب في مصلحة النظام ورعاية حق الطائفين الذين هم أولى وأحق بالمكان من المصلين.",
                "",
                "سنن الطواف",
                "للطواف سننٌ فعلَها رسول الله -صلى الله عليه وسلم- وتابعه عليها صحابتُه الكرام. وقد قال -صلى الله عليه وسلم-: (خذوا عني مَناسككم). والطواف كما هو الحال في بقية أعمال الحج والعمرة من العبادات العظيمة التي يسعى فيها المسلم إلى الاقتداء برسول الله -صلى الله عليه وسلم- ومتابعته في الكيفية والصفة والحال التي كان عليها؛ لأن ذلك سببٌ عظيمٌ لمحبة الله لعباده، كما قال تعالى: ﴿قل إن كنتم تحبون الله فاتبعوني يحببكم الله ويغفر لكم ذنوبكم﴾. ومن سنن الطواف:",
                "التكبير يُسن لمن حاذى الحجر الأسود أو النور الأخضر في الأدوار العليا عند بداية كل شوط ونهايته أن يرفع يديه قائلاً: الله أكبر.",
                "الدعاء يعتبر الطواف بالكعبة من أعظم مواقف الدعاء والتضرع إلى الله، وقد كان رسول الله يشغل كل لحظات طوافه بالدعاء والذكر، وكان يقول بعد أن يتجاوز الركن اليماني (وهو آخر ركن قبل الحجر الأسود): ربنا آتنا في الدنيا حسنة وفي الآخرة حسنة وقنا عذاب النار.",
                "يدعو الطائف بكل ما يحتاجه ويهمه من خيري الدنيا والآخرة، بلغتِه التي يتكلم بها، فأعظمُ الدعاء ما توافقَ فيه القلب واللسان.",
                "من أعظم الأدعية وأكثرها بركة أدعيةُ القرآن وأدعية رسول الله -صلى الله عليه وسلم-. الاضطباع",
                "يسن للرجل في طواف العمرة أن يُظهر كتفه الأيمنَ اقتداءً بالنبي صلى الله عليه وسلم، وذلك خاص بطواف العمرة وطواف القدوم.",
                "الرّمَل يسن للرجال -إن تيسّر لهم- أن يعجلوا خطاهم، ويمشوا مشياً سريعاً مع تقارب الخُطى في الأشواط الثلاثة الأولى؛ اقتداء برسول الله -صلى الله عليه وسلم- ويتمّون باقي الأشواط الأربعة مشياً معتاداً في طوافي العمرة والقدوم.",
                "صلاة ركعتي الطواف يسن لمن أتم طوافه أن يصلي ركعتين، يقرأ في الأولى سورة الكافرون، وفي الثانية سورة الإخلاص.",
                "",
                "زمزم",
                "م. يُشرع للمسلم الشرب من ماء زمزم عموماً، ويتأكد في حقه عندما ينتهي من طوافه، وقبل أن يبدأ في السعي، ومن أهم المعلومات حول ماء زمزم في الحرمين؛ ما يلي:",
                "يُوفّر ماء زمزم في حاويات شُرب مخصصة، في أنحاء المسجد الحرام والمسجد النبوي، بنوعين: ماء مبرّد، وغير مبرّد وعليه علامة.",
                "تتوفر أكواب من البلاستيك للشرب، ومع كل وحدة شرب تؤخذ الكأس من الجهة اليمنى وتوضع بعد استخدامها بالجهة اليسرى أو في سلّة المهملات في أيّ مكان آخر.",
                "يُعيد منسوبو السقاية تعبئة الحاويات باستمرار، ومّما يعطّل مهمتهم في التعبئة: تحريكُها وتغييرُ مكانها واتجاهها.",
                "هذه الحاويات مجهّزة للشرب فقط، واستخدامها للوضوء يعرض الزوار والمعتمرين إلى الانزلاق والتلوث، كما أن نقل مخزونها خارج الحرم يهدر ماء زمزم."
            ],
            "en": [
                "",
                "How to make Tawaf",
                "Tawaf is one of the pillars of Hajj and Umrah, and it is an act of worship to Allah that shows the need and turning of the heart and limbs to Him, Glory be to Him. Tawaf starts from the corner where the Black Stone is located; green lights are indicating it on the upper floors. From this point on the pilgrim pronounces Takbeer at the beginning of each new round. It is not a requirement that the Takbeer is at the same point, rather the matter is approximate. If the Hajj or Umrah performer finds himself in line with the Black Stone, he may say Takbeer.",
                "The Takbeer is made while the pilgrim points with his hand to the Black Stone, then begins his Tawaf, having the Ka’bah on his left (counterclockwise). He may kiss the Black Stone if possible, in fulfillment of the Sunnah. If he cannot do so, especially in seasons and during crowds, he is not to blame. The pilgrims in Tawaf should pray a lot to Allah and invoke Him. If they reach the corner that precedes the Black Stone, which is called the “Yemeni Corner”, it is also desirable for them to wipe over it if possible, and repeat that practice in the seven rounds.",
                "",
                "Ramal (jogging)",
                "Ramal is to speed up the Tawaf, and it is one of the Sunnah acts of the Messenger of Allah (peace be upon him) in the Tawaf for Umrah and the Arrival Tawaf. It differs from jogging in Saa'i (walking between Al-Safa and Al-Marwah). In Ramal, it is an act of Sunnah for men, if it is possible for them, to accelerate their steps, and to walk quickly with close steps in the first three rounds, following the example of the Messenger of Allah (peace be upon him) and then complete the remaining four rounds with moderate pacing. Women may not perform Ramal. Likewise, men and women are not required to perform Ramal in Tawaf Al-Ifadah (in Hajj), the Farewell Tawaf, nor in any other supererogatory Tawaf.",
                "",
                "Al-Idtibaa’",
                "Al-Idtibaa’ is one of the acts of Sunnah of the Prophet (peace be upon him). It consists of the man showing his right shoulder in the Tawaf for Umrah and the Arrival Tawaf, and it is not to be performed in other types of Tawaf.",
                "Idtibaa’ came into prominence as a legal practice when it was reported that Quraysh said about the Prophet (peace be upon him) and his companions: A people weakened with the illness have come to you. So the Messenger of Allah (peace be upon him) and his companions wanted to show their strength and vigorousness by showing their shoulders, then the Messenger of Allah (peace be upon him) and his companions continued to do it afterward. Today, the Muslim follows his Messenger and shows his strength and vigorousness in turning to his Lord - Glory be to Him.",
                "",
                "Arrival Tawaf",
                "It is the Tawaf that the pilgrim performs on his first arrival in Makkah, and it is also called the Tawaf of Greeting. The Arrival Tawaf is performed by those who entered Ihram for Hajj and came to Makkah, well before the day of Arafah, having sufficient time for Tawaf. Those concerned with the Arrival Tawaf have made their intention for Ifrad or Qiran types of Hajj. Once they arrive at Makkah, it becomes mandatory to make seven rounds of Tawaf around the Ka’bah. The Arrival Tawaf is waived for those doing Tamattu’ Hajj, for those who go directly to Arafah, and for menstruating or postpartum women.",
                "The Arrival Tawaf is performed exactly like the Tawaf for Umrah. One who completes the Arrival Tawaf should go jogging seven times between Al-Safa and Al-Marwah. This will be considered the Saa’i required to complete the Hajj. Afterward, a pilgrim does not need to repeat the Saa’i when he goes for Tawaf Al-Ifadah on the Day of Eid. All the steps of the Tawaf for Umrah are also applicable in the Arrival Tawaf. A pilgrim must adhere to the instructions and dates set by the Hajj campaign program so that the schedule of the rest of the campaigns will not be interrupted.",
                "",
                "Ka'bah",
                "The Ka’bah is the Sacred House of Allah, and the building venerated by all Muslims of great importance and magnificent history. Its building was erected by Allah's Messengers Ibrahim and his son Isma'il (peace be upon them). Allah, the Almighty, said: And [mention] when Abraham was raising the foundations of the House and [with him] Ishmael, [saying], Our Lord, accept [this] from us. Indeed You are the Hearing, the Knowing. It is the first House on earth that Allah appointed for His worship alone with no partner. Allah, the Almighty, said: Indeed, the first House [of worship] established for mankind was that at Makkah - blessed and a guidance for the worlds. It is the direction that Muslims face in prayer and the destination to which their hearts yearn. It is the only House around which they make Tawaf. The Ka’bah has several prominent features that a pilgrim sees during Tawaf, which are:",
                "Al-Hatim (Hijr Isma'il)",
                "It is an arched wall attached to the Ka’bah. It was originally part of the Ka’bah built by Ibrahim and Isma’il (peace be upon them). Praying and standing in it is like praying and standing inside the Ka’bah.",
                "The door of the Ka'bah",
                "It is located on the eastern side of the Ka'bah. Today, it is made of pure gold, and it is 222 cm above the ground.",
                "Al-Multazam",
                "It is the eastern wall or part of it, located between the Black Stone and the door of the Ka'bah. It came from Iltizam, where a person making supplication attaches his chest, face, forearms, and hands to this wall. This may be difficult to do during the seasons.",
                "Al-Mizab",
                "It is the part installed on the roof of the Ka’bah to drain water, from which water is poured onto the Hijr of Isma’il..",
                "Al-Shadhuran",
                "It is a ground support that surrounds the Ka’bah like a skirting. It is not originally part of the Ka’bah but was placed to strengthen the building of the Ka’bah and protect it from floods. It has been preserved over the years, and today it is clad with white marble.",
                "The Black Stone",
                "The Black Stone is one of the stones of Paradise. The Prophet (peace be upon him) said: It marks the beginning and end of Tawaf. The Prophet (peace be upon him) put it in its place to resolve the Quraysh’s disagreement over who should put it back in place. This happened after they completely rebuilt the Ka’bah when part of its building had been damaged by rain.",
                "Al-Rukn Al-Yamani (The Yemeni Corner)",
                "The Yemeni Corner is one of the four corners of the Holy Ka’bah. It was called ‘Yemani’ because it faces the direction of Yemen. Together with the Black Stone, they are called the “Yemeni corners",
                "",
                "Tawaf in wheelchairs",
                "It is permissible for a person who cannot walk, or who feels tired, ill, or exhausted, to make Tawaf in a wheelchair. However, he must remain awake and conscious because he is engaged in worship, and should spend his time making supplications and invoking Allah",
                "",
                "The Sunnah prayer after Tawaf",
                "After completing Tawaf, it is a stressed Sunnah to pray two Rak’ahs for everyone who makes Tawaf around the Ka’bah for Hajj or Umrah, or as a non-specific supererogatory Tawaf. It is recommended to recite Surah Al-Kafirun in the first Rak’ah and Surah Al-Ikhlas in the second Rak’ah. Moreover, Tawaf is symbolic of monotheism and singling out Allah alone with worship with no partner. So it is recommended to profess this creed through the surahs recited upon completion of Tawaf.",
                "If possible, it is an act of Sunnah to pray two Rak'ahs behind Maqam Ibrahim, where the Maqam is between him and the Ka’bah, even if the Maqam is far from him. The worshiper must abide by the place indicated by the security men. In every place in the Grand Mosque, it is valid to perform the two Rak’ahs. The directives of the security men are in the interest of the order and the interest of those performing Tawaf, who have a better right to the place than the worshipers.",
                "",
                "The Sunnah acts of Tawaf",
                "Tawaf has associated Sunnah acts that the Messenger of Allah (peace be upon him) did, and his honorable companions followed him in this respect. The Prophet (peace be upon him) said: Learn your rituals from me. As is the case with the rest of the Hajj and Umrah acts, Tawaf is one of the great acts of worship in which the Muslim seeks to follow the example of the Messenger of Allah (peace be upon him) in the same manner, quality, and state of affairs he was on. This is a great reason for Allah’s love for His servants, as He, the Almighty, said: Say, [O Muhammad], If you should love Allah, then follow me, [so] Allah will love you and forgive you your sins”. Some Sunnah acts of Tawaf:",
                "Takbeer It is recommended for the one who is in line with the Black Stone or the Green Light in the upper floors at the beginning and end of each round to raise his hands, saying: Allah Akbar [Allah is the Greatest]",
                "Supplication Tawaf around the Ka’bah is considered one of the greatest situations of making a supplication to Allah. The Messenger of Allah used to spend all the moments of his Tawaf making supplication and remembrance, and he used to say after passing the Yemeni Corner (which is the last corner before the Black Stone): Our Lord, give us in this world [that which is] good and in the Hereafter [that which is] good and protect us from the punishment of the Fire",
                "The person engaged in Tawaf may supplicate to Allah for everything he needs and seeks for the good of this world and the hereafter, in the language he speaks. The greatest supplication is the one made with the heart in agreement with the tongue.",
                "Among the greatest and most blessed supplications are those found in the Qur’an and the supplications of the Messenger of Allah (peace be upon him).",
                "Al-Idtibaa It is an act of Sunnah for a man during the Tawaf for Umrah to show his right shoulder, following the example of the Prophet (peace be upon him). This is specific to the Tawaf for Umrah and the Arrival Tawaf.",
                "Ramal (jogging) In Ramal, it is an act of Sunnah for men, if it is possible for them, to accelerate their steps, and to walk quickly with close steps in the first three rounds, following the example of the Messenger of Allah (peace be upon him) and then complete the remaining four rounds with moderate pacing. This is typical of Tawaf for Umrah and the Arrival Tawaf.",
                "Offering two Rak'ahs of prayer after finishing Tawaf After completing Tawaf, it is a stressed Sunnah to pray two Rak’ahs, reciting Surah Al-Kafirun in the first Rak'ah (after Al-Fatihah) and Al-Ikhlas in the second Rak'ah.",
                "",
                "Zamzam",
                "Zamzam water is one of Allah’s favors to Makkah and its visitors. Allah blessed Isma’il (peace be upon him) and his mother Hajar with Zazam when Ibrahim (peace be upon him) left them in Makkah in response to Allah’s command. So Allah made that freshwater flow from underneath the feet of the child Isma’il. Its characteristics and qualities are not like those of any other water on the face of the earth. It was a tribute to Ibrahim, his son, his wife, and the Ummah of Muhammad (peace be upon him) which came later. It is recommended for a Muslim to drink Zamzam water in general, and it is even stressed when he finishes his Tawaf, and before he begins Saa’i. Here is some important information about Zamzam water in the Two Holy Mosques:",
                "Zamzam water is provided in designated drinking containers, throughout the Grand Mosque and the Prophet’s Mosque, in two types: chilled, and non-chilled water with a label.",
                "Plastic cups are available for drinking. In each drinking container, the cup is taken from the right side column and placed after use on the left side column or in the trash in any other place.",
                "Watering personnel constantly refill the containers. The following disrupts their refilling task: moving them and changing their location and direction.",
                "These containers are made for drinking only. Using their water for Wudu exposes visitors and pilgrims to slipping and infection, and to move their storage of water to the outside of the Grand Mosque is to waste Zamzam water."
            ]
        }
    },
    {
        "id": 5,
        "title": {
            "ar": "السعي",
            "en": "Saa’i"
        },
        "mainImagePath": "assets/images/hajj/sai.jpg",
        "details": {
            "ar": [
                "",
                "السعي بين الصفا والمروة",
                "السعي بين الصفا والمروة شعيرة عظيمة من شعائر الحج والعمرة، قال تعالى ﴿إن الصّفَا وَالْمَرْوَةَ مِن شَعَائِرِ اللهِ فمن حج البيت أو اعتمر فلا جناح عليه أن يطوف بهما﴾. يتعبد الحاج والمعتمر ربه بقطع المسافة بين الصفا والمروة سبع مرات، كما فعل رسوله الكريم -صلى الله عليه وسلم.",
                "الصفا والمروة جبلان صغيران كانت تصعد عليهما هاجَرُ أم إسماعيل -عليه السلام- بحثاً عن الرزق. يبتدئ السعي من جبل الصفا عند الصخور الظاهرة في الدور الأرضي، وعند جبل المروة ينتهي السعي. ويُسن عند الوصول إلى أول الصفا أو المروة في بداية كل شوط أن يرفع الحاج والمعتمر يديه مستقبلاً القبلة، مع دعاء الله وتكبيره قبل بداية الشوط الجديد. ويستحب للرجال القادرينَ الهرولة بين العلمين الأخضرين، كما فعل رسول الله -صلى الله عليه وسلم. كما ينبغي للساعي ألا يتوقف للدعاء في مكان يعطل السير ويسبب الزحام، وأن يتقيّد إرشادات رجال الأمن والمنظّمين في المسجد الحرام.",
                "",
                "سعي الحج",
                "على الحاج سعي واحد في حجّه. يسعى بين الصفا والمروة سبعة أشواط مبتدئاً من الصفا متوجهاً إلى المروة. والحجاج في السعي على حالات مختلفة، هي",
                "المتمتع الذي اعتمر أوّل قدومه ثم تحلّل ثم أحرم بالحج؛ يلزمه سعي الحج بعد طواف الإفاضة؛ لأن سعيه الأوّل كان للعمرة.",
                "القارن الذي جمع بين الحج والعمرة، ومثله المفرد الذي أحرم بالحج فقط، لهما حالتان",
                "إن كان قد طاف أول قدومه إلى مكة وسعى، فإن سعيه ذلك هو سعي الحج، وليس عليه سعي آخر.",
                "وإن كان لم يسعَ سابقاً فعليه السعي بعد طواف الإفاضة.",
                "",
                "السعي بالعربات (الكراسي المتحركة)",
                "يجوز لمن لم يستطع المشي أو أحسّ بالإعياء والمرض والتعب أن يسعى راكباً. وعليه أن يبقى مستيقظاً منتبهاً لأنه في عبادة، وأن يملأ وقته بالدعاء والتضرع إلى الله، وأن يكبر ويدعو كلما وصل إلى الصفا والمروة",
                "",
                "وصايا السعي",
                "عند إتمامك الطواف ستجد داخل المسجد الحرام لوحات إرشادية تدلك إلى المسعى وإلى الصفا حيث بداية السعي.",
                "توجّه إلى المسعى في الأدوار العلوية حتى تتجنب زحام الدور الأرضي، وأيضاً لكي تخفّف عن نفسك وإخوانك المسلمين.",
                "شَغل وقت السعي بذكر الله ودعائه وقراءة القرآن، مع التوقف في مكان لا يعطل السير ويسبب الزحام، والتقيّد بإرشادات رجال الأمن والمنظّمين في الحرم.",
                "الاقتصار في الهرولة أثناء السعي بين العلمين الأخضرين فقط، حصراً على الرجال.",
                "إذا أقيمت الصلاة فإن الساعي يصلي مع الجماعة، ثم يكمل سعيه من المكان الذي توقف فيه.",
                "إذا كنت مريضاً بالسكري فابدأ بالسعي بعد أخذ العلاج والغذاء الكافييْن، وحافظ على قدميك من كل ما يؤذيهما، وعليك الاستراحة عند الإحساس بنقص مستوى السكر.",
                "استخدام العربات إذا غشيَك الإعياء والمرض.",
                "عدم قص الشعر داخل المسعى، وإنما في محلات الحلاقة جوار الحرم.",
                "",
                "الحلق والتقصير",
                "يُشرع حَلق شَعر الرأس أو تقصيرُه تعبداً لله بعد تمام النسك، كما كان عدم الأخذ منه وقت الإحرام تعبداً. والأفضل الحلق في العمرة والحج جميعاً؛ لأن الرسول -صلى الله عليه وسلم- دعا للمحلقين ثلاثاً بالمغفرة والرحمة، وللمقصرين واحدة. فالأفضل الحلق، لكن إذا كانت العمرة قرب الحج فالأفضل فيها التقصير حتى يتوفر الحلق في الحج؛ لأن الحج أكمل من العمرة فيكون الأكمل للأكمل. أما إن كانت العمرة بعيدة عن الحج يمكن لشعر الرأس أن يطول فإنه يحلق حتى يحوز فضل الحلق. ولا يجوز تقصير بعض الرأس ولا حلق بعضه، في أصح أقوال العلماء، بل الواجب حلق الرأس كله أو تقصيره كله، والأفضل أن يبدأ بالشق الأيمن في الحلق والتقصير.",
                "الحلق والتقصير في الحج يكون بعد رمي جمرة العقبة يوم النحر، أما في العمرة فيكون بعد تمام الطواف والسعي. والمرأة تقصّر من شعرها فقط، ولا تحلقه سواء كانت حاجة أو معتمرة. فهي تجمعه وتقص من أطرافه قدر أنملة بما يعادل 1-2 سم. وينبغي على الحاج والمعتمر الحلق في الأماكن المخصصة؛ صيانة للحرم ووقاية له من الأمراض."
            ],
            "en": [
                "",
                "Saa'i between Al-Safa and Al-Marwah",
                "Saa’i (walking) between Al-Safa and Al-Marwah is a great ritual of Hajj and Umrah. Allah, the Almighty, said: Indeed, Al-Safa and Al-Marwah are among the symbols of Allah. So whoever makes Hajj to the House or performs Umrah - there is no blame upon him for walking between them Hajj and Umrah performers worship their Lord by walking the distance between Al-Safa and Al-Marwah seven times, as did our Noble Messenger (peace be upon him).",
                "Al-Safa and Al-Marwah are two small mountains that Hajar, the mother of Isma'il (peace be upon him) used to climb in search of livelihood. The Saa’i starts from Mount Al-Safa at the visible rocks on the ground floor and the Saa’i ends at Mount Al-Marwah. It is an act of Sunnah for Hajj and Umrah performers upon reaching the beginning of Al-Safa or Al-Marwah at the beginning of each round to raise their hands facing the Qiblah while supplicating Allah and saying Takbeer before the start of the new round. It is desirable for men who can jog between the two green lights to do so, following the example of the Messenger of Allah (peace be upon him). Also, the person engaged in Saa’i should not stop to offer prayer in a place that obstructs traffic and causes crowds. They must adhere to the instructions of the security men and assistants in the Grand Mosque.",
                "",
                "Saa'i for Hajj",
                "The pilgrim has to perform one Saa’i during his Hajj. He should make Saa'i seven times between Al-Safa and Al-Marwah, starting from Al-Safa and heading towards Al-Marwah. In terms of Saa’i, the pilgrims have different situations:",
                "The Tamattu’ pilgrim who has already performed Umrah on his arrival, then exited Ihram and then entered Ihram for Hajj must perform the Tawaf for Hajj after Tawaf Al-Ifadah. This is because his first Saa’i was for Umrah.",
                "The Qiran pilgrim, i.e. who combines Hajj and Umrah, and the person who enters Ihram for Hajj only, have two cases:",
                "If he made Tawaf and Saa’i on his arrival to Makkah, his Saa’i counts for Hajj, and he does not have to do any other Saa’i.",
                "If he did not perform Saa’i previously, he must do Saa’i after the Tawaf of Al-Ifadah.",
                "",
                "Performing Saa'i in wheelchairs",
                "It is permissible for a person who cannot walk, or who feels tired, ill, or exhausted, to make Saa'i in a wheelchair. However, he must remain awake and conscious because he is engaged in worship, and should spend his time in supplication and invoking Allah, and saying Takbeer every time he reaches up to Al-Safa or Al-Marwah.",
                "",
                "Tips for Saa'i",
                "When you complete Tawaf, inside the Grand Mosque, you will find guiding boards that will guide you to the Massa and to Al-Safa, where the Saa’i begins.",
                "Go to the Massa on the upper floors to avoid crowding on the ground floor, and also to relieve yourself and your Muslim brethren.",
                "Spend the time of Saa’i in the remembrance of Allah, supplication to Him, and reciting the Qur’an, while stopping in a place that does not obstruct traffic and cause congestion. Adhere to the instructions of the security men and assistants in the Grand Mosque.",
                "Only men can jog between the two green lights while making Saa’i.",
                "If the Iqamah for prayer is established, the person engaged in Saa’i should join prayer in the congregation, then complete his Saa’i from the place where he stopped.",
                "If you are diabetic, start Saa’i after taking adequate treatment and food, and keep your feet from everything that hurts them. You should rest when you feel a low blood sugar level.",
                "Use wheelchairs if you feel sick and tired.",
                "Do not cut your hair inside the Massa, but rather in the barbershops near the Grand Mosque.",
                "",
                "Shaving and cutting hair short",
                "The hair of the head may be shaved or cut short in devotion to Allah after completing the rituals, just as the restriction of shaving/cutting short during the time of Ihram was an act of worship. It is better to shave for both Umrah and Hajj because the Messenger (peace be upon him) asked for Allah’s forgiveness and mercy for those who shaved three times, and for those who cut their hair short once only. Therefore, shaving is generally preferable. However, if the Umrah is near the Hajj, it is better to cut the hair short so that shaving would be possible during the Hajj because the Hajj is more complete than the Umrah; so the most perfect state is for the most perfect type of worship. However, if the Umrah is far from the Hajj, and the hair of the head can grow again in that period, it may be shaved entirely to obtain the associated virtue of shaving. According to the most correct sayings of scholars, it is not permissible to cut short or shave part of the head and leave the other part. Rather, it is obligatory to shave the entire head or cut the hair short. It is better to start with the right part of the head for shaving or cutting short",
                "Shaving/shortening hair in Hajj is done after stoning Jamrat Al-Aqabah on the Day of Sacrifice, while in Umrah it is done after completing Tawaf and Saa’i. Women may only cut their hair short, but not shave it entirely, whether for Hajj or Umrah. It is to be gathered together and the ends are cut equal to 1-2 cm. The Hajj and Umrah performers should shave their heads in the designated places to keep the Grand Mosque clean and protect it from infections."
            ]
        }
    },
    {
        "id": 6,
        "title": {
            "ar": "منى",
            "en": "Mina"
        },
        "mainImagePath": "assets/images/hajj/mina.jpg",
        "details": {
            "ar": [
                "",
                "ما هو مَشعَر مِنى؟",
                "منى وادٍ صغير يضم الجَمرات، ومسجد الخَيف. هو أقرب مشاعر الحج إلى المسجد الحرام، ويحتضن الحجيج في بداية رحلتهم، من يوم الثامن من ذي الحجة إلى تمام الحج، مروراً بيوم النحر وأيام التشريق. وهو مكان تقرُّ فيه مشاعر الحجاج وذكرياتهم، ليس اليوم فقط، بل منذ تاريخ قديم. فقد عرفه الأنبياء -عليهم السلام- وصلّوا وأقاموا فيه.",
                "",
                "معالم مِنى",
                "يضُمّ مَشعر مِنى معالم رئيسة هي مسجد الخيف الذي يعدُّ أعظم مساجدها. في الخيف أقام وصلى الرسول -صلى الله عليه وسلم- في حجة الوداع، ومِن قبله نزل وصلى فيه الأنبياء صلوات الله عليهم. فقد روي أنه صلى في الخيف سبعون نبياً. وعلى الحاج عدم النوم في المسجد والافتراش فيه، وإتاحة المجال للمصلين. ويضُمّ مَشعر مَنى مسجد البيعة الذي أقيم على الأرض التي شهدت أول بيعة في الإسلام، إذ بايع رسولَ الله -صلى الله عليه وسلّم- 12 رجلًا من قبيلتي الأوس والخزرج في تلك البقعة على النصر والمؤازرة عام 12 من البعثة/621م. وفي مَشعر مَنى أيضاً الجمرات الثلاث الجمرة الأولى التي تسمى الصغرى أو الدنيا، وهي أول جمرة بعد مسجد الخيف، سمّيت دنيا من الدنو؛ لأنها أقرب الجمرات إلى مسجد الخيف. والجمرة الثانية التي تسمى الوسطى. وأخيراً جمرة العقبة التي تسمّى (الجمرة الكبرى) وتقع في آخر منى جهة مكة. كذلك في منى مجرّ الكبش ، تلك البقعة التي يروى إن إبراهيم -عليه السلام- عندما استجاب أمر الله وأراد نحر ابنه إسماعيل فيها، نزل عليه جبريل ومعه الكبش يبشره بتصديق الرؤيا، فذبح -عليه السلام- الكبش على الصفاة التي اتخذت فيما بعد مصلى.",
                "",
                "مِنى في يوم التروية",
                "يمكث أغلبُ الحجاج في مِنى يوم الثامن من ذي الحجة، اقتداءً بسنّة النبي -صلى الله عليه وسلم- فيصلّون فيه الظهر محرمين، ويمكثون حتى فجر اليوم التاسع، استعداداً للانطلاق بعد ذلك إلى مشعر عرفات. وقد سُمي هذا اليوم يوم التروية من ريّ الماء، لأن الناس كانوا قديماً يحملون الماء معهم استعداداً ليوم عرفة. والحمد لله على تيسيره وفضله هذه الأيام حيث تتوفر مياه الشرب في كل مشاعر الحج."
            ],
            "en": [
                "",
                "What is the sacred site of Mina?",
                "Mina is a small valley that houses the Jamarat and Al-Khaif Mosque. Of all the holy sites of Hajj, it is the closest to the Grand Mosque. It accommodates the pilgrims at the beginning of their journey, from the eighth day of Dhul-Hijjah to the completion of the Hajj, passing through the Day of Sacrifice and the Days of Tashreeq. It is a place where the feelings and memories of the pilgrims are calmed, not only today but also since ancient history. The prophets (peace be upon them) knew this place where they prayed and stayed.",
                "",
                "Mina landmarks",
                "The shrine of Mina includes the main landmarks of Hajj. These include Al-Khaif Mosque, which is considered the greatest of its mosques. The holy site of Mina includes the main landmarks of Hajj, including Al-Khaif Mosque, which is considered the greatest of its mosques. It was narrated that seventy prophets prayed in Al-Khaif Mosque. The pilgrim should not sleep or squat in the mosque and should allow space for other worshipers. The holy site of Mina includes Al-Bai’ah Mosque, which was established on the land that witnessed the first allegiance in Islam, as 12 men from the Aws and Khazraj tribes pledged allegiance to the Messenger of Allah (peace be upon him) in that spot to give him assistance and support in the year 12 of the Mission / 621 AD. There are also three Jamarat in Mina: The first Jamrah is called the Al-Sughra or Al-Dunya, which is the first Jamrah after Al-Khaif Mosque. It was called “Al-Dunya” because it is the nearest of all Jamarat to Al-Khaif Mosque. The second Jamrah is called Al-Wusta. Finally, Jamrat Al-Aqabah is also called Al-Jamrah Al-Kubra and is located at the end of Mina in the direction of Makkah. Likewise, in Mina, there is Majar Al-Kabsh. They say that when Ibrahim (peace be upon him) responded to Allah's command and wanted to sacrifice his son Isma’il in this spot, Jibril descended upon him with a ram, giving him good tidings of the fulfillment of the vision. So, Ibrahim (peace be upon him) slaughtered the ram on Al-Safah, which was later appointed as a prayer place.",
                "",
                "Mina on the Day of Al-Tarwiyah",
                "Most of the pilgrims stay in Mina on the eighth day of Dhul-Hijjah, following the Sunnah of the Prophet (peace be upon him) and they pray the Zhuhr (noon) prayer in Ihram. They stay there until the dawn of the ninth day, in preparation for setting off after that for the holy site of Arafah. This day was called the day of “Al-Tarwiyah” because in the past people used to carry water with them in preparation for the Day of Arafah. Now, thanks to Allah, potable water is available in all the sites of Hajj."
            ]
        }
    },
    {
        "id": 7,
        "title": {
            "ar": "عرفة",
            "en": "Arafah"
        },
        "mainImagePath": "assets/images/hajj/arafa.jpg",
        "details": {
            "ar": [
                "",
                "عرفة وفضلها",
                "تعرف منطقة عرفة بأنها تقع عند جبل صخري طوله تقريباً 300م يقع بين مكة المكرمة والطائف، وتبعد عن الحرم المكي نحو 23 كم، وعلى بُعد 10 كم من منى، و 6 كم من مزدلفة، وفي عرفة الحج الأكبر والوقفة التي هي ركن من أركان الحج لقول النبي -صلى الله عليه وسلم-: (الحج عرفة)، وفي وسط الجبل شاخص إسمنتي طوله 7م يميزه عن باقي الجبال.",
                "سميت عرفة بهذا الاسم نسبة إلى الجبل الذي يقال إن الناس كانوا يتعارفون فيه، وقيل أيضاً سمي بذلك لأن آدم وحواء عندما هبطوا من الجنة التقوا فيه فعرفها وعرفته، وهناك روايات أخرى تدل على نفس المعنى المخصوص بالاسم.",
                "يوم عرفة يوم يجتمع فيه شرف المكان والزمان، في لحظات إيمانية تعم فيها رحمة الله، وهو اليوم التاسع من ذي الحجة، ومن أفضاله كثرة عتق الله لعباده من النار، قال -صلى الله عليه وسلم-: (ما من يومٍ أكثر من أن يعتق الله فيه عبدًا من النار من يوم عرفة). وهو يوم يباهي فيه الله -عز وجل- ملائكته بما يصنع أهل عرفة قال -صلى الله عليه وسلم-: (إن الله يباهي ملائكته عشية عرفة بأهل عرفة، فيقول: انظروا إلى عبادي أتوني شعثاً غبراً). كما أن الدعاء فيه خير الدعاء وأعظمه، قال -صلى الله عليه وسلم-: (خير الدعاء دعاء عرفة).",
                "",
                "كيف يقضي الحاج يوم عرفة؟",
                "الوقوف بعرفة لحظات إيمانية لا تتكرر، وعلى الحاج استثمارها، وذلك بأن:",
                "يصلي الحاج الظهر والعصر جمعاً وقصراً في جماعة بعد الزوال مباشرة، أو بعد الوصول إن حدث بعد الزوال.",
                "يحرص الحاج على البقاء في مخيمه وعدم الخروج إلا لحاجة، فقد يتسبب الخروج في صعوبة العودة للمخيم، بسبب تشابه طرق عرفة.",
                "يستغل وقته، وينوع العبادات، ليبعد عن نفسه الملل، ويتذكر أنها لحظات ستمضي ويبقى الأجر، ومن هذه العبادات تلاوة القرآن والدعاء والتلبية والذكر.",
                "لا يُشرَع للحاج صيام يوم عرفة رغم عظمته، ولكن خيراته وبركاته ينالها المسلمون، ولهذا فقد شرع الله لغير الحاج صيام يوم عرفة وثوابه كفارة للذنوب، قال -صلى الله عليه وسلم-: (صيام يوم عرفة أحتسب على الله أن يكفر السنة التي قبله والسنة التي بعده).",
                "",
                "مسجد نمرة",
                "مسجد نمرة هو أحد أهم المعالم في عرفة، والتي يشاهدها الحجاج أثناء رحلتهم لأداء المناسك. في يوم عرفة يصلي فيه الآلاف من ضيوف الرحمن الذين يأتون إلى الحج من مختلف بلاد العالم كل عام، وقد أقيم هذا المسجد في المكان الذي صلى فيه رسول الله -صلى الله عليه وسلم- وخطب فيه خطبةَ الوداع. حيث تقام فيه صلاتا الظهر والعصر جمعاً وقصراً بعد خطبة يوم عرفة والتي تنقلها العديد من التلفزيونات والإذاعات الإسلامية.",
                "يعود سبب التسمية إلى قرية كانت خارج عرفة أقام فيها النبي -صلى الله عليه وسلم- ثم سار منها إلى بطن الوادي حيث صلى الظهر والعصر وخطب في المسجد، كما شهد المسجد في عهد الدولة السعودية أضخم توسعة ليصبح بذلك ثاني أكبر مسجد بمنطقة مكة المكرمة من ناحية المساحة بعد المسجد الحرام، حيث تبلغ مساحته أكثر من 110 آلاف متر مربع، وله 6 مآذن وثلاث قباب، ويتسع لأكثر من 350 ألف مصلٍ.",
                "",
                "الوقوف على جبل عرفة",
                "جبل عرفة سهل منبسط محاط بقوس من الجبال، ويسمى هذا الجبل بأسماء مختلفة، مثل جبل عرفة، جبل التوبة، جبل الرحمة، ووُضع على قمة الجبل شاخص يبلغ ارتفاعه 7م، توضع عليه بعض التنبيهات، والصعود عليه ليس من السنن المتعلقة بالحج، فقد وقف رسول الله –صلى الله عليه وسلم- أسفل الجبل ولم يصعد عليه، وقال حين وقف: (وقفتُ ها هنا، وعرفة كلها موقف)، فلا يستحب للمسلم أن يتعبد الله بصعود الجبل، اقتداء برسول الله -صلى الله عليه وسلم-. وفي الاقتداء برسول الله سلامة للحاج من مفارقة الجماعة الحملة وحر الشمس ووعورة الجبل."
            ],
            "en": [
                "",
                "Arafah and its virtues",
                "The area of Arafah is known as being located at a rocky mountain whose height is approximately 300 m. It is located between Makkah and Taif. It is about 23 km away from the Grand Mosque, 10 km from Mina, and 6 km from Muzdalifah. Arafah is the greater pilgrimage, including the standing which is one of the pillars of Hajj, according to the words of the Prophet (peace be upon him): “Hajj is Arafah.” In the middle of the mountain is a 7-meter-tall concrete sign that distinguishes it from the rest of the mountains",
                "Arafah was given that name in relation to the mountain in which it is said that people used to get to know each other. It was also said that the name relates to Adam and Eve when they descended from Paradise and met in Arafah (literally means he/she knew), so he knew her and she knew him. There are other narrations indicating the same meaning of the name.",
                "The day of Arafah is a day in which the merit of place and time meet, in moments of faith in which Allah’s mercy prevails. It is the ninth day of Dhul-Hijjah, and among its virtues is the abundance of Allah’s freeing of His servants from the Fire. The Prophet (peace be upon him) said: There is no day when Allah sets free more servants from Hell than the Day of Arafah. It is a day when Allah, the Mighty, boasts to His angels about what the people of Arafah are doing. The Prophet (peace be upon him) said: “Verily, Allah, the Almighty, boasts to His angels of the pilgrims on the afternoon of the day of Arafat, saying: ‘Look at My servants, coming to Me disheveled and dusty’.” Also, supplication on that day is the best and greatest supplication. The Prophet (peace be upon him) said: The best supplication is that of the Day of Arafah.",
                "",
                "How does the pilgrim spend the day of Arafah?",
                "Standing at Arafah is a moment of faith that cannot be repeated, and the pilgrim must make use of it:",
                "The pilgrim prays the Zhuhr and Asr prayers combined and shortened in congregation immediately after noon, or after arriving if it occurs after noon.",
                "The pilgrim should stay in his camp and not go out except for a need, as going out may cause difficulty in returning to the camp, due to the similarity of the roads to Arafah.",
                "He should make use of his time and diversify the acts of worship, to keep boredom away from himself, and remember that these moments will pass and the reward will remain. Among these acts of worship are recitation of the Qur’an, supplication, Talbiyah, and Dhikr.",
                "It is not prescribed for the pilgrim to fast on the day of Arafah despite its greatness, but its bounties and blessings are attained by all Muslims. For this reason, Allah prescribed for non-pilgrims to fast on the day of Arafah and its reward is an expiation for sins. The Prophet (peace be upon him) said: Fast the Day of Arafah, for indeed I anticipate that Allah will forgive (the sins) of the year after it, and the year before it",
                "",
                "Namirah Mosque",
                "Namirah Mosque is one of the most important landmarks in Arafah, which pilgrims see during their journey to perform the rituals. On the day of Arafah, thousands of visitors who come to Hajj from different countries around the world every year pray inside it. This mosque was built in the place where the Messenger of Allah (peace be upon him) prayed and delivered his farewell sermon. The Zhuhr and Asr prayers are performed combined and shortened after the sermon on the Day of Arafah is delivered. This sermon is transmitted by many Islamic televisions and radio stations.",
                "The reason for the name goes back to a village that was outside Arafah, in which the Prophet (peace be upon him) stayed, then walked from it to the bottom of the valley, where he prayed Zhuhr and Asr and delivered sermons in the mosque. During the era of the Saudi state, the mosque witnessed the largest expansion, thus becoming the second-largest mosque in the Makkah region in terms of area after the Grand Mosque. Its current area is more than 110 thousand square meters, and it has 6 minarets and three domes. It can accommodate more than 350 thousand worshipers.",
                "",
                "Standing on Mount Arafah",
                "Mount Arafah is a flat plain surrounded by an arc of mountains. This mountain is called by different names, such as Mount Arafah, Mount of Repentance, and Mount of Mercy. A 7-meter-high figure has been placed on the top of the mountain on which warnings are placed. Climbing this mountain is not one of the Sunnah acts related to Hajj. The Messenger of Allah (peace be upon him) stood at the bottom of the mountain and did not ascend it. He said when he stood: I have stayed here and the whole of Arafah is a place to stay. A Muslim should not deem the climbing of the mountain as an act of devotion, but should rather follow the example of the Messenger of Allah (peace be upon him). Following the example of the Messenger of Allah provides safety for the pilgrim from straying from the group (in this context, it is the campaign), the heat of the sun, and the ruggedness of the mountain"
            ]
        }
    },
    {
        "id": 8,
        "title": {
            "ar": "مزدلفة",
            "en": "Muzdalifah"
        },
        "mainImagePath": "assets/images/hajj/muzdalefa.jpg",
        "details": {
            "ar": [
                "",
                "ما هو مشعَر مزدلفة؟",
                "مزدلفة من المشاعر المقدسة التي يمرُّ بها الحجاج في رحلة حجهم إلى بيت الله الحرام. ويعود سبب تسميتها إلى أحد أمرين، الأول لأن الناس يزدلفون منها، أي يقتربون إلى الحرم، والثاني لأن الناس يقضون فيها زُلفاً من الليل، أي أوقاتاً وساعات من الليل. ويسمى مزدلفة كذلك: جَ مْ ع ، لأن الناس يجتمعون فيها، ويسمى كذلك: المشعَ ر الحرام ، لأنها من الحرم، كما جاء في القرآن، قوله تعالى: ﴿فَإِذَا أَفَضْتُم منْ عَرَفَاتٍ فَاذْكُرُوا الله عِندَ الْمَشْعَرِ الْحَرَامِ﴾. ويعتبر مَشعر مزدلفةُ كله مكاناً يصحُّ فيه الوقوف، كما قال -صلى الله عليه وسلم: (وقفتُ ههنا وجَمْع مزدلفة كلها موقف).",
                "من فضائل مزدلفة أنه يشترك مع عرفات في اجتماع الناس بهما في وقت محدد؛ إذ في عرفات يجتمع الناس نهاراً حتى تغرب الشمس يدعون الله تعالى ويذكرونه، وفي مزدلفة يجتمعون للمبيت والاستراحة من تعب النهار. وإذ تُجمع في عرفات صلاة الظهر وصلاة العصر وتقصران، تُجمع في مزدلفة صلاة المغرب وصلاة العشاء وتقصران. وقد جمعَ الله بين عرفات ومزدلفة في الأجر العظيم، فقد قال -عليه الصلاة والسلام: (معاشرَ الناسِ، أَتاني جبرائيل آنفاً، فأقرأني من رَبي السلامَ، وقال: إنّ الله عز وجل غفرَ لأهلِ عرفاتٍ، وأَهل المَشْعَر، وضَمِنَ عنهم التبعاتِ).",
                "",
                "موقع وجغرافيا المزدلفة",
                "يقع مَشعر مزدلفة جنوب - شرق مكة المكرمة، متوسطاً مشعريْ منى وعرفات، ويبعد عن المسجد الحرام حوالي 10 كلم. ويفصل مزدلفة عن منى وادي محسّر، وقد اتصل هذان المشعران ببعضهما الآن، حيث إن خيام منى قد تداخلت مع حدود المزدلفة ممتدة عبر وادي محسّر. وتبعد مزدلفة عن عرفات نحو 9 كلم، يربط بينهما 11 طريقاً حديثاً. منها طريق مخصص للمشاة مزود بصنابير مياه، يشرب منها الحجاج الذين يقطعون المسافة سيراً على الأقدام.",
                "من أهم معالم مزدلفة مسجد المشعر الحرام، وهو مسجد أقيم في المكان الذي نزل فيه رسول الله -صلى الله عليه وسلم- في مزدلفة في حجة الوداع. وقد كان هذا المسجد في بداية القرن الثالث الهجري مربع الشكل، صغير المساحة، ولم يكن مسقوفاً، ثم توسّع في العهد السعودي حتى أصبح يستوعب أكثر من 12 ألف مُصَلّ.",
                "",
                "ماذا أصنع في مزدلفة؟",
                "تختلف حملات الحج في تجهيز مكان مزدلفة، وأكثرها يجهز سجاداً وفرشاً للنوم ووجبات خفيفة. ويستخدم الحجاج دورات المياه العامة. وبعد وصولك من عرفة إلى مزدلفة بإمكانك قضاء وقتك بما يلي:",
                "أداء صلاتي المغرب والعشاء جمعاً وقصراً مع حملتك.",
                "ذكر الله وحمده وتلبيته.",
                "الاستراحة والنوم استعداداً ليوم العيد.",
                "استشعر قدر نعمة الله عليك بأن هداك ويسّر لك الحج وبلّغك عرفة ووفقك لدعائه والتضرع إليه، كما قال تعالى: ﴿فَاذْكُرُوا الله عِندَ الْمَشْعَرِ الْحَرَامِ ۖ وَاذْكُرُوهُ كَمَا هَدَاكُمْ وَإِن كُنتُم من قَبْلِهِ لَمِنَ الضّالين﴾.",
                "",
                "وقت الوقوف في مزدلفة",
                "يبدأ وقت الوقوف بمزدلفة من بعد غروب شمس يوم عرفة (التاسع من ذي الحجة). وقد تعدّدت المذاهب الفقهية في القدر اللازم للبقاء في مزدلفة:",
                "بين من يقول: يكفي المرور وقدر وضع الرّحْل، أي: يكفي أن يبقى الحاج في مزدلفة بقَدرِ الوقت الكافي لإنزال الأمتعة والتمكّن من الإقامة في المكان، سواء وُضعَت الرحال بالفعلِ أو لم توضع.",
                "ومن يقول: يلزَم البقاء إلى منتصف الليل، أو ثلثَي الليل، أو حتى الفجر.",
                "وقد بقي رسول الله – صلى الله عليه وسلم - في مزدلفة حتى صلى الفجرَ، ثم دعا ربّه، ثم انصرف إلى منى قبل الإشراق. كما أذِن رسولُ الله –صلى الله عليه وسلم- لمن استأذنه من النساء ومن معهم من المرافقين أن يخرجوا من مزدلفة قبل الفجر، وكان منهم ابن عباس -رضي الله عنه. وينبغي للحاج أن يلتزم موعد الحملة في الانتقال من مزدلفة، لأن الأمر ممّا وسّع فيه الشرع، ورسول الله –صلى الله عليه وسلم- أذِن لمن استأذنه من الصحابة، ولا تخلو الحملات من وجود النساء وكبار السن.",
                "",
                "الاستعداد لجمرة العقبة",
                "يُشرع للحاج أن يلتقط قبل خروجه من مزدلفة 7 حصيات (جمرات) سيرمي بها جمرة العقبة يوم العيد، وإن التقطها من مِنى أو أي مكان جاز له. وبخصوص التقاط الحصى لبقية الجمرات فيكون من مِنى أيّ مكان حتى لا يثقل الأمر على الحاج.",
                "صِفة الحصى أن تكون صغيرة أصغر من ثمرة البُ ندق ، قريبة من حبوب البازلاء أو نوى التمر بطول 1 سم تقريباً، تزيد وتنقص. ويُنصح بالابتعاد عن الحصى الكبيرة وعدم التكلف في اختيار شكل الحصى وتطابق حجمها، قال -صلى الله عليه وسلم- بعد أن جمع الجمار في يده وقبضها: (أمثال هؤلاء فارموا، وإياكم والغلو في الدين، فإنما أهلك من كان قبلكم الغلو في الدين). وليس من السنّة غسل الجمرات ولا تطييبُها.",
                "",
                "كيف أرمي الجمرات؟",
                "وأنت تستعد لرمي جمرة العقبة، تذكّر قصة رؤيا إبراهيم -عليه السلام- حينما أمره الله بذبح ولده إسماعيل -عليه السلام- فاستجاب الخليلُ لأمر الله وهمّ بتنفيذه. وفي الأثناء حاول الشيطان إثناء إبراهيم، لكنه –عليه السلام- كان كلما اعترضه الشيطان يغيّر مكانه، ويرمي بسبع حصيات، حتى انتهى أمر الشيطان واختفى. ثم شرعَ إبراهيم -عليه السلام- في تنفيذ الأمر، فوضع ابنَه على جبينه ليذبحه، فناداه اللهُ بقوله: ﴿وَنَادَيْنَاهُ أَن يَا إِبْرَاهِيمُ*قَدْ صَدّقْتَ الرُّؤْيَا ۚ إِنَّا كَذَٰلِكَ نَجْزِي الْمُحْسِنِينَ* إِنَّ هَٰذَا لَهُوَ الْبَلَاءُ الْمُبِينُ﴾ أي: قد امتثلتَ وسلمت لأمر الله ونجحتَ في هذا الابتلاء والاختبار. ونحن اليوم نرمي الجمرات خضوعاً وانقيادًا لأمر الله تعالى، وتعبداً له وحده لا شريك له.",
                "وقت الوقوف في مزدلفة",
                "يسلك الحاج طريق الجمرات والدور المحدد له حسب التوجيهات والتعليمات التي تلقّاها.",
                "الجمرة ليست هي الجدار ولا الشاخص الذي يُرمى تجاهه في المنتصف، بل هي المرمى المحيطُ بذلك الجدار والشاخص، فعلى الحاج أن يرمي الحصاة حتى تقع في داخل الحوض الذي يحيط بالجدار.",
                "يبدأ الحاج بالجمرة الصغرى، وهي أول ما سيلقاه من الجمرات، فيرميها بسبع حصيات، يكبر مع كل رمية.",
                "ثم يبتعد عن الجمرة قليلاً، بعيداً عن الزحام، ويتنحى عن الطريق حتى لا يؤثر على طريق الحجاج، ويستقبل القبلة ويرفع يديه بالدعاء، ويتضرع لله بما يريد.",
                "ينتقل بعد ذلك إلى الجمرة الوسطى (الثانية) فيرميها كما رمى التي قبلها بسبع حصيات، يكبر مع كل رمية.",
                "ثم يبتعد عنها متجهاً إلى جمرة العقبة ويتنحى عن الطريق ويدعو الله ويبتهل إليه بما شاء.",
                "ثم ينطلق إلى جمرة العقبة الكبرى (الثالثة) فيرميها كما رمى التي قبلها بسبع حصيات.",
                "",
                "الطريق إلى الجمرات",
                "نحثّك على الالتزام بوقت الرمي الذي تحدّده الحملة بعد تنسيقها مع الجهات المختصة، واطمئن فجميع الأوقات المقررة تتوافق مع آراء فقهاء وعلماء شرعيين معتبرين.",
                "تعتبر جميع أيام التشريق وقتاً للرمي حتى غروب شمس يوم الثالث عشر من ذي الحجة، وعلى الحاج أن يرمي جميع الجمرات الثلاث في كل يوم، حسب تعجّله أو تأخّره.",
                "تتنوع طرق الوصول إلى الجمرات حسب الحملة ووقتها وموقعها، وينبغي على الحاج التزام جدول التنظيم والتفويج المتبع في حملته.",
                "قطار المشاعر: قسم من الحجاج يصلون إلى الجمرات عبر قطار المشاعر، وسيبقى على الحاج مسافة يقطعها مشياً وصولاً إلى مكان الرمي.",
                "مسارات المشاة: والذين يصلون إلى الجمرات مشياً على الأقدام يجدُر بهم حمل مظلة شمسية تقيهم أشعة الشمس إن كان رميهم نهاراً، مع ارتداء حذاء مريح يُعين على المشي الطويل.",
                "الحافلات: قسم يصل إلى الجمرات عبر الحافلات المخصصة للحملات.",
                "سيارات الغولف: لنقل كبار السن ومن يثقل عليهم المشي عند صعود جسر الجمرات.",
                "جميع هذه الطرق متاحة وميسّرة بفضل -الله تعالى- ويبقى على الحاج الرمي بالطريقة الصحيحة، والتزام وصايا وتوجيهات رمي الجمرات."
            ],
            "en": [
                "",
                "What is the sacred site of Muzdalifah?",
                "Muzdalifah is one of the holy sites that pilgrims pass through on their pilgrimage to the Sacred House of Allah. The reason for naming it so is due to one of two things: the first is because through it people get closer (Arabic ‘yazdalifuna’) to the Grand Mosque; and the second is because people spend therein the very beginning of the night (Arabic ‘zulafan’), that is, times and hours of the night. Muzdalifah is also called: Jama', because people gather in it; it is also called: Al-Mash'ar Al-Haram, because it is part of the Haram, as stated in the Qur’an: But when you depart from 'Arafat, remember Allah at Al- Mash'ar Al-Haram. All of Muzdalifah is considered a place where it is valid to stand, as the Prophet (peace be upon him) said: I have stood here, but all Jama' (Al-Muzdalifah) is a place for standing.",
                "One of the virtues of Muzdalifah is that it shares with Arafah the gathering of people at a specific time. In Arafah, people gather during the day until the sun sets, supplicating Allah, the Almighty, and remembering Him. In Muzdalifah, they gather to spend the night and rest from the fatigue of the day. While in Arafah the Zhuhr (noon) and ‘Asr (afternoon) prayers are combined and shortened, in Muzdalifah the Maghrib (sunset) and Isha (night) prayers are combined and shortened. Allah brought Arafah and Muzdalifah together in terms of the great reward. The Prophet (peace be upon him) said: “Oh, people, Jibril came to me just now, and conveyed to me the greeting of peace from my Lord, and said: ‘Allah forgave the people of Arafah and He forgave the people of Al-Mash‘ar Al-Haram and Allah bore on behalf of all the consequences of what they committed.",
                "",
                "Location and geography of Muzdalifah",
                "The Muzdalifah site is located in the southeast of Makkah, in the middle of the sites of Mina and Arafah; it is about 10 km away from the Grand Mosque. Muzdalifah is separated from Mina by Wadi Muhassir. These two holy sites are now connected, as the tents of Mina overlapped with the borders of Muzdalifah extending through Wadi Muhassir. Muzdalifah is about 9 km away from Arafah, and 11 modern roads connect them. These include a pedestrian path equipped with water taps, from which pilgrims who walk the distance drink.",
                "One of the most important landmarks of Muzdalifah is Al-Mash’ar Al-Haram Mosque, which is a mosque erected at the place where the Messenger of Allah (peace be upon him) stayed in Muzdalifah during the Farewell Hajj. At the beginning of the third century AH, this mosque was square in shape, small in size, and not roofed. Then it was expanded during the Saudi era to accommodate more than 12,000 worshipers.",
                "",
                "What do I do in Muzdalifah?",
                "Hajj campaigns differ in preparing the place for Muzdalifah, and most of them prepare carpets, sleeping mats, and light meals. Pilgrims use public toilets.After you arrive from Arafah to Muzdalifah, you can spend your time doing the following:",
                "Performing the Maghrib and Isha prayers combined and shortened with your campaign.",
                "Remembering Allah, praising Him, and saying Talbiyah.",
                "Resting and sleeping in preparation for the day of Eid.",
                "Appreciating Allah’s grace upon you that He guided you, facilitated Hajj for you, brought you to Arafah, and guided you to supplicate and beseech Him, as He, the Almighty, said: Remember Allah at Al- Mash'ar Al-Haram. And remember Him, as He has guided you, for indeed, you were before that among those astray.",
                "",
                "Standing time in Muzdalifah",
                "The time for standing in Muzdalifah begins after sunset on the Day of Arafah (the ninth of Dhul-Hijjah). Many schools of jurisprudence differed as regards the extent necessary to stay in Muzdalifah:",
                "According to one view: It is enough to pass by and spend the time needed for unloading the baggage. In other words, it is sufficient for the pilgrim to remain in Muzdalifah for the amount of time sufficient to unload the baggage and be able to stay in the place, whether the baggage is unloaded or not.",
                "According to another view: It is necessary to stay until midnight, two-thirds of the night, or until dawn.",
                "The Messenger of Allah (peace be upon him) remained in Muzdalifah until he prayed the dawn prayer, then he supplicated to his Lord, then he left for Mina before sunrise. The Messenger of Allah (peace be upon him) also permitted those who sought his permission among the women and those accompanying them to leave Muzdalifah before dawn. Ibn ‘Abbas (may Allah be pleased with him) was one of those who sought permission to leave. The pilgrim should stick to the timing set by the campaign for moving from Muzdalifah because the matter is flexible. The Messenger of Allah (peace be upon him) permitted those who sought his permission to leave from among the Companions. Most likely, campaigns have women and elderly people.",
                "",
                "Getting ready for Jamrat Al-Aqabah",
                "A pilgrim may pick up 7 pebbles (jamarat) before leaving Muzdalifah, which he will throw at Jamrat Al-Aqabah on the day of Eid. If he picks them up from Mina or any other place, this is permissible for him. As for the rest of the Jamarat, the pebbles could be picked up anywhere in Mina so that the matter does not burden the pilgrim.",
                "The pebbles should be smaller than a hazelnut, and more like peas or date stones, about 1 cm long, a little bigger or a little smaller. It is advised to avoid large pebbles and not to exceed proper limits as regards choosing the shape of the pebbles and matching their size. After picking up pebbles, the Prophet (peace be upon him) grasped them in his hand and said: Throw something like these, and beware of exaggeration in religious matters, for those who came before you were doomed because of exaggeration in religious matters. It is not an act of Sunnah to wash or perfume pebbles.",
                "",
                "How to throw Jamarat?",
                "As you prepare to throw Jamrat Al-Aqabah, remember the story of Ibrahim's (peace be upon him) vision when Allah commanded him to sacrifice his son Isma’il (peace be upon him) and he responded to Allah's command and was about to accomplish it. In the meantime, Satan tried to dissuade Ibrahim (peace be upon him). Whenever Satan intercepted him, he (peace be upon him) changed his place and threw seven pebbles, until Satan gave up and disappeared. Then Ibrahim (peace be upon him) proceeded to carry out the order. So he put his son on his forehead to slaughter him, when Allah called him, saying: We called to him, 'Oh, Abraham, You have fulfilled the vision.' Indeed, We thus reward the doers of good. Indeed, this was the clear trial. The meaning is: You complied and surrendered to Allah's command and successfully passed this trial and test. Today, we throw pebbles at the Jamarat in submission and compliance to the command of Allah, the Almighty, and as an act of devotion to Him alone, without a partner",
                "Standing time in Muzdalifah",
                "The pilgrim walks the way to the Jamarat and abides by the designated turn according to the directions and instructions he received.",
                "The Jamrah is not the wall or pillar that is found in the middle at which pebbles are thrown. Rather the Jamrah is the basin surrounding this wall or pillar. Therefore, a pilgrim has to throw pebbles to fall inside the basin surrounding the wall.",
                "The pilgrim begins with the Al-Jamarah Al-Sughra, which is the first Jamarah he will come across. He should throw seven pebbles at it, saying the Takbeer with each throw.",
                "Then he should move a little away from the Jamrah to avoid the crowds and step away from the path so as not to hinder the pilgrims.He should face the Qiblah, raise his hands in supplication, and ask Allah for whatever he wants.",
                "After that, he moves to Al-Jamrah Al-Wusta (the second) and throws seven pebbles at it, the way he did in the former Jamrah, saying the Takbeer with each throw.",
                "Then he turns away from it, heading to Jamrat Al-Aqabah, avoiding the middle of the road, and supplicates to Allah and beseeches Him as he wishes.",
                "then he goes to Jamrat Al-Aqabah Al-Kubra (the third) and throws seven pebbles at it as he did in the previous one.",
                "",
                "The means of reaching the Jamarat",
                "then he goes to Jamrat Al-Aqabah Al-Kubra (the third) and throws seven pebbles at it as he did in the previous one.We urge you to adhere to the throwing time set by the campaign after coordinating it with the competent authorities. Rest assured that all the prescribed times are in accordance with the opinions of respected legal scholars and jurists.",
                "All the days of Al-Tashreeq are considered a time for throwing until sunset on the thirteenth day of Dhul-Hijjah. The pilgrim must throw at all three Jamarat every day, according to his rushed/delayed plan of departure.",
                "The means of reaching the Jamarat vary according to the campaign, its time, and location. The pilgrim must adhere to the schedule and the group dispatching plan set by his campaign.",
                "Mashaer Train: Some of the pilgrims arrive at the Jamarat via the Mashaer Train. The pilgrim will have to walk a distance to reach the place of throwing",
                "Pedestrian paths: Those who reach the Jamarat on foot should carry an umbrella to protect them from the sunrays should they throw during the day. They should wear comfortable shoes that help with the long walk.",
                "Buses: A group of them reaches the Jamarat via campaign buses.",
                "Golf cars: Golf cars are used for transporting the elderly and those who are burdened by walking when going up the Jamarat Bridge.",
                "All these means are available and easy by the grace of Allah, the Almighty. It remains the duty of the pilgrim to throw the pebbles correctly and to adhere to the instructions and directives for throwing the Jamarat."
            ]
        }
    },
    {
        "id": 9,
        "title": {
            "ar": "يوم النحر",
            "en": "Day of Sacrifice"
        },
        "mainImagePath": "assets/images/hajj/naher.jpg",
        "details": {
            "ar": [
                "",
                "فضل يوم النحر",
                "يوم عيد الأضحية (يوم النحر) هو اليوم العاشر من شهر ذي الحجة، وهو أفضل أيام السنة على الإطلاق، وفيه يؤدي الحجاج معظم أعمال الحج لذلك يسمى أيضاً بـ (يوم الحج الأكبر). قال النبي- صلى الله عليه وسلم (أفضل الأيام عند الله يوم النحر). ويأتي يوم النحر بعد يوم عرفة العظيم، وتليه أيام التشريق المباركة، وكل هذه الأيام هي أعياد للمسلمين، قال عنها رسول الله -صلى الله عليه وسلم- (يوم عرفة ويوم النحر وأيام التشريق عيدنا أهل الإسلام، وهي أيام أكل وشرب). يقوم الحاج في يوم النحر بأعمال جليلة وهي",
                "في ليلته يكون المبيت بمزدلفة، ويكون ذكر الله تعالى ودعاؤه من بعد صلاة الفجر حتى طلوع الشمس.",
                "قطع التلبية، وبدء التكبير، فتجتمع فيه التلبية والتكبير، وهما شعيرتان عظيمتان.",
                "فيه يرمي الحاج جمرة العقبة.",
                "فيه تذبح الأضاحي طاعة لله.",
                "فيه يحلق الحاج شعر رأسه، ويتحلّل من إحرامه.",
                "فيه يطوف الحاج بالبيت، ويسعى بين الصفا والمروة.",
                "",
                "أعمال يوم النحر",
                "يصاحب يوم النحر أعمالاً عظيمة، هي من أكثر مناسك الحج وأجلّها، فيها يوم العيد، يوم فرح وسرور للمسلمين، قال عنه نبينا -صلى الله عليه وسلم- (إن أعظم الأيام عند الله تبارك وتعالى يوم النحر ثم يوم القر)، ويوم القرّ هو ثاني أيام العيد، وقد سمي بذلك لأن الحجاج يَقِرون فيه بمنى بعدما أدوا أعمالهم، وتتمثل الأعمال في الآتي",
                "رمي جمرة العقبة",
                "يبدأ وقتها من منتصف الليل للمتعجل، ويستمر كامل يوم العيد.",
                "ذبح الهدي لمن كان عليه هدي",
                "يجب الهدي على المتمتع والقارن، ولا يجب على المفرِد.",
                "الحلق والتقصير",
                "يحلق الحاج شعر رأسه أو يقصره تعبداً لله تعالى، بعد أن ينتهي من رمي جمرة العقبة، والحلق أفضل من التقصير.",
                "طواف الإفاضة",
                "هو ركن من أركان الحج، ولا يصح الحج بدونه، ويصح أن يبدأ من منتصف ليلة العاشر من ذي الحجة، وينتهي وقته بانتهاء آخر أيام شهر ذي الحجة.",
                "سعي الحج",
                "إذا أتم الحاج طواف القدوم، فإنه يسعى بين الصفا والمروة، وبذلك يكون قد أدى سعي الحج.",
                "",
                "موعد جمرة العقبة",
                "جمرة العقبة هي أبعد جمرة عند القدوم للرمي، وتقع في آخر منى تجاه مكة، وهي الجمرة الوحيدة التي يرميها الحاج يوم العيد، يبدأ وقت رميها من منتصف الليل لمن تعجل وخرج من مزدلفة ليلاً، ويستمر وقت الرمي كامل يوم العيد، علماً أن الأَوْلى عدم تأخير الرمي حتى فجر يوم الحادي عشر من ذي الحجة لمن استطاع، فقد رمى- رسول الله صلى الله عليه وسلم- جمرة العقبة بعد أن خرج من مزدلفة بعد صلاة الفجر وقبل طلوع الشمس، فوصل إلى الجمرة في وقت الضحى. طريقة رمي جمرة العقبة:",
                "اخرج للرمي مع حملتك وفي وقت التفويج المحدد لضمان عدم الافتراق، ولتفادي الزحام ومضايقة حجاج آخرين.",
                "ارمي الجمرة بسبع حصيات متفرقات، في كل رمية حصاة واحدة.",
                "كبِّر مع كل رمية قائلاً: (الله أكبر).",
                "احرص على الابتعاد عن الزحام، واقترب من الجمرة من جهة أقل زحاماً.",
                "وجّه رميك للجدار الظاهر أمامك وسط الجمرة، حتى تسقط الحصاة في حوض ومكان الجمرة.",
                "احرص ألا تؤذي أحداً بما ترميه.",
                "واصل السير ولا تتوقف بعد رمي الجمرة، حتى لا تعرض نفسك للحصى المتطاير، وأيضاً لتعطي فرصة رمي الجمرة لبقية الحجاج .",
                "التوكيل في الرمي",
                "الواجب على الحاج أن يرمي الجمرات بنفسه، ويجوز للعاجز وكبير السن والضعيف والمريض والحامل ومن يخشى على نفسه الضرر، أن يوكل من يرمي عنه الجمرات من الحجاج، وترتيب الرمي للموكّل يكون أن يرمي الجمرة عن نفسه أولاً، ثم يرمي عمّن أنابه، ثم ينتقل إلى الجمرة التالية، ويكرر الرمي بذات الطريقة حتى النهاية.",
                "",
                "التكبير",
                "يُشرع التكبير خلال يوم النحر (عيد الأضحى) بقول: الله أكبر الله أكبر، لا إله إلا الله، الله أكبر الله أكبر، ولله الحمد ، الله أكبر كبيراً، والحمد لله كثيراً، وسبحان الله بكرةً وأصيلاً ، وللتكبير في عيد الأضحى نوعان:",
                "التكبير المطلَق:",
                "هو الذي يقال في كل وقت، ويبدأ من أول شهر ذي الحجة إلى غروب شمس آخر يوم من أيام التشريق.",
                "التكبير المقيّد:",
                "هو الذي يقال بعد الصلوات الخمس، ويبدأ من صلاة فجر يوم عرفة إلى عصر آخر أيام التشريق، وهو اليوم الثالث عشر من ذي الحجة.",
                "",
                "طواف الإفاضة",
                "يسمى أيضاً طواف الحج، وهو ركن من أركان الحج لا يصح الحج إلّا به. والطواف هو عبادة لله تظهر الافتقار والتوجه بالقلب والجوارح إلى الله، يقوم فيها المسلم بالطواف حول الكعبة سبع مرات، عبادة لربه وتقرباً إليه، ويبدأ وقت طواف الإفاضة من منتصف ليلة العاشر من ذي الحجة (يوم العيد)، ولا ينتهي وقته إلا بانتهاء آخر أيام شهر ذي الحجة. فقد طاف النبي -صلى الله عليه وسلم- طواف الإفاضة يوم العيد (العاشر من ذي الحجة)، بعد أن رمى جمرة العقبة وحلق رأسه واغتسل ولبس ثيابه.",
                "يجوز للحاج أن يطوف طواف الإفاضة بلباسه المعتاد، من غير إحرام، إن كان قد رمى جمرة العقبة وحلق أو قصر رأسه، كما يجوز له أن يؤخر طواف الإفاضة ويجمعه مع طواف الوداع (الذي يختم به الحاج بقاءه في مكة) في طواف واحد، وينوي به طواف الإفاضة. أما المرأة التي تخاف من العذر الشرعي، يجب ألا تؤخر الطواف ما استطاعت.",
                "",
                "من يجب عليه الهدي؟",
                "يجب الهدي (ذبح الإبل أو البقر أو الغنم) على نوعينِ من الحجاج هما:",
                "المتمتع، وهو من اعتمر في سفرته، ثم تحلل من إحرامه، ثم أحرم مرة أخرى بالحج.",
                "القارن، وهو من جمع بين العمرة والحج في نسكه.",
                "ولا يجب الهدي على المُفرِد الذي أحَرَم بالحج فقط.",
                "أما الأصناف التي يؤدَى منها الهدي فهي",
                "الخراف أو الماعز وتكفي الواحدة منها عن حاج.",
                "الإبل أو البقر وتكفي الواحدة منها سبعة من الحجاج.",
                "أما من لم تكن لديه القدرة على ذبح الهدي فيصوم عشرة أيام؛ ثلاثة أيام في الحج، قبل يوم عرفة، وله أن يصومها في أيام التشريق (11، 12، 13 من ذي الحجة)، وسبعة أيام بعد الحج، إذا رجع إلى أهله. قال الله تعالى: ﴿َفمَنْ تَمَتّعَ بِالْعُمْرَةِ إِلَى الْحَجّ فَمَا اسْتَيْسَرَ مِنَ الْهَدْيِ فَمَنْ لَمْ يَجِدْ فَصِيَامُ ثَلاثَةِ أَيّامٍ فِي الْحَجّ وَسَبْعَةٍ إِذَا رَجَعْتُمْ تِلْكَ عَشَرَةٌ كَامِلَةٌ﴾.",
                "",
                "النيابة والتوكيل",
                "مع تزايد توافد الحجاج بكثرة من مختلف بلدان العالم، اعتاد الحجاج توكيل الجهات المختصة ليذبحوا نيابة عنهم، ويمكن القيام بذلك عبر شراء قسائم ورقية أو إلكترونية تنتشر في عدة مواقع في منى، أو عبر الخدمات الإلكترونية، وهذا أيسر للحاج وأقرب لوصول لحم الذبيحة للمحتاجين.",
                "موقع مشروع أضاحي (www.adahi.org).",
                "المسار الإلكتروني لوزارة الحج والعمرة (www.haj.gov.sa)",
                "منصة إحسان (www.ehsan.sa).",
                "البريد السعودي (www.splonline.com.sa).",
                "جمعية هدية الحاج والمعتمر الخيرية (www.hadiyah.org.sa)",
                "منافذ بيع حول الحرمين الشريفين وفي المشاعر المقدسة.",
                "مصرف الراجحي (www.alrajhibank.com.sa).",
                "بنك البلاد (www.bankalbilad.com).",
                "كيف أتأكد من أني وكلت المشروع؟ ومتى سيتم ذبح الهدي؟",
                "بمجرد خصم قيمة الهدي من حسابك، أو وصول السند إليك، فإنك قد وكلت المشروع بذبح الهدي نيابة عنك، وبَرَأتْ ذمتك، وسوف يذبح هديك في مدته الشرعية المحددة.",
                "",
                "التحلل الأول",
                "التحلل هو الخروج من الإحرام، وأن يحل ما كان محظوراً على الحاج وهو مُحرِم. ففي يوم عيد الأضحى (العاشر من ذي الحجة) يرمي الحاج الجمرة الكبرى، ويذبح هديه في منى أو مكة، ويحلق شعره أو يقصّره، وبهذا يتحلل الحاج التحلل الأول، ويجوز له بعد ذلك كل شيء كان محظوراً عليه إلا زوجته، ويشرع له أن يغتسل ويتطيب، وينزع ملابس الإحرام ويلبس ملابس العيد، ويحزم أمتعته.",
                "كون الحلق أو التقصير مرتبط ارتباطاً وثيقاً بالتحلل الأول، وكونه أحد واجبات الحج، فهناك أماكن مجهزة للحلاقة يجدها الحاج بعد أن يرمي جمرة العقبة مباشرة، فاحرص على اختيار حلاق مرخص في مكان محدد لذلك، وابتعد عن حلاقي الطرقات والأرصفة، ولا تعّرض نفسك للأمراض المعدية بسبب الحلاقة، وعند الحلاق تأكد من:",
                "أنه يستخدم الأمواس ذات المقابض البلاستيكية، والتي تستعمل لمرة واحدة.",
                "أنه قام بتغيير أدوات الحلاقة بعد الحاج السابق، وأخرج أدوات جديدة.",
                "أنه غسل يديه بالماء والصابون قبل أن يبدأ الحلاقة.",
                "",
                "التقديم والتأخير في أعمال يوم النحر",
                "أجاز رسول الله -صلى الله عليه وسلم- للحجاج التقديم والتأخير في أعمال يوم النحر بما هو أيسر عليهم، وكل من جاء يسأله -صلى الله عليه وسلم- في تقديم أو تأخير عمل على عمل أذن له، كما جاء في الحديث الشريف: (فما سئل عن شيء قدم ولا أخر إلا قال: افعل ولا حرج). التقديم والتأخير في أعمال يوم النحر من التيسير على المسلمين، ومن شفقة النبي الكريم بأمته، لأن وقت الحج وقت شديد، فيه من المشقات والضروريات ما يضطر معه الناس إلى فعل بعض الأمور دون ترتيب، فرفع النبي -صلى الله عليه وسلم- الحرج عن الناس في الترتيب، والمهم هو القيام بأعمال الحج، وبالرغم من اختلاف ظروف الحجاج، إلا أنه ينصح باتباع برنامج الحملة في ترتيب الأعمال وأوقاتها، لما في ذلك من التسهيل على الحاج نفسه وبقية الحجاج."
            ],
            "en": [
                "",
                "Virtues of the Day of Sacrifice",
                "The Day of Eid Al-Adha (the Day of Sacrifice) is the tenth day of the month of Dhul-Hijjah, and it is the best day of the year of all. On this day, the pilgrims perform most of the acts of Hajj, so it is also called (the Day of the Greater Hajj). The Prophet (peace be upon him) said: 'The best of days before Allah is the Day of Sacrifice. ''The Day of Sacrifice comes after the great day of Arafah, and it is followed by the blessed days of Tashreeq. All of these days are Eid days for Muslims, about which the Messenger of Allah (peace be upon him) said: The Day of Arafah, the Day of Sacrifice, and the Days of Al-Tashreeq are our Eid, the people of Islam, and they are days of eating and drinking'. On the Day of Sacrifice, the pilgrim performs great deeds, which are:",
                "On its night, pilgrims stay overnight in Muzdalifah, remember Allah, the Almighty, and supplicate Him after the Fajr prayer until sunrise.",
                "Ending the Talbiyah and beginning the Takbeer, in which the Talbiyah and the Takbeer come together, are two great rituals.",
                "On this day, the pilgrim throws Jamrat Al-Aqabah.",
                "The sacrifices are slaughtered in obedience to Allah.",
                "Pilgrims shave their heads and exit their Ihram.",
                "The pilgrims make Tawaf around the Sacred House and Sa'i between Al-Safa and Al-Marwah.",
                "",
                "Deeds on the Day of Sacrifice",
                "The Day of Sacrifice is the time when some great acts of worship are made. These include the most important and esteemed rituals of Hajj. The Day of Eid is a day of joy and happiness for Muslims. Our Prophet (peace be upon him) said about it: 'The Day of Resting is the second day after Eid. It was called so because the pilgrims rest in Mina on this day after they have done their work. The actions are as follows::'",
                "Throwing Jamrat Al-Aqabah:",
                "Its time starts at midnight for those who are in a hurry and lasts the whole day of Eid.",
                "Slaughtering a sacrificial animal for those who have to sacrifice",
                "The sacrifice is obligatory for a pilgrim who is performing the Tamattu’/Qiran types of Hajj, but it is not obligatory in the case of Ifrad Hajj.",
                "Shaving or cutting the hair short:",
                "The hair of the head may be shaved or cut short in devotion to Allah after completing the throwing of Jamrat Al-Aqabah, and shaving is preferable to cutting the hair short.",
                "Tawaf Al-Ifadah:",
                "It is one of the pillars of Hajj, without which Hajj is not valid. It may start at midnight of the tenth of Dhul-Hijjah, and its time ends with the end of the last days of the month of Dhul-Hijjah.",
                "Saa'i for Hajj:",
                "When the pilgrim completes the Arrival Tawaf, he should perform the Saa’i between Al-Safa and Al-Marwah, which is the Saa’i of Hajj.",
                "",
                "Time for Jamrat Al-Aqabah:",
                "Jamrat Al-Aqabah is the farthest Jamrah for the comer to throw. It is located at the end of Mina towards Makkah. It is the only Jamrah that the pilgrim throws on the day of Eid. The time for throwing Jamarat starts at midnight for those who hurry to leave Muzdalifah at night. The throwing time lasts the entire day of Eid. It should be noted that it is better not to delay throwing Jamarat until dawn on the eleventh day of Dhul-Hijjah for those who can. The Messenger of Allah (peace be upon him) threw pebbles at Jamrat Al-Aqabah after he left Muzdalifah following the Fajr prayer and before sunrise. He reached the Jamrah at the time of the forenoon. How to throw Jamrat Al-Aqabah:",
                "Go out for throwing Jamarat with your campaign at the specified time so as not to miss your group and to avoid crowds and causing discomfort to other pilgrims.",
                "Throw the Jamrah with seven different pebbles, one pebble in each throw.",
                "Say Takbeer with each throw: Allah Akbar [Allah is the Greatest]",
                "Make sure to stay away from the crowds, and approach the Jamrah from a less crowded side.",
                "Direct your throw at the wall in front of you in the middle of the Jamrah, so that the pebbles fall into the basin and the designated place.",
                "Be careful not to hurt anyone with what you throw.",
                "Continue walking and do not stop after throwing the pebbles, so as not to get hit by the flying pebbles, and allow the rest of the pilgrims to throw their pebbles.",
                "Throwing pebbles by proxy",
                "The pilgrim must throw the pebbles in person. It is permissible for the disabled, the elderly, the weak, the sick, the pregnant, and whoever fears harm for himself, to delegate one of the pilgrims to throw the pebbles on his behalf. The proxy should first throw the pebbles for himself, then throw pebbles on behalf of the person who appointed him, then move to the next Jamrah, and repeat the throwing of pebbles in the same manner until the end.",
                "",
                "Takbeer",
                "It is recommended to say Takbeer during the Day of Sacrifice (Eid Al-Adha) in this formula: Allahu akbar, Allahu akbar, Allahu akbar la ilaha illa-Allah, wa Allahu akbar, Allah akbar, wa Lillah il-hamd (Allah is Most Great, Allah is Most Great, Allah is Most Great, there is no god but Allah, Allah is Most great, Allah is Most great, and to Allah be praise) Allahu akbaru kabira wa alhamdu Lillahi kathira wa subhan Allahi bukratan wa asila… (There is no god but Allah, Allah is Most Great, Allah is Most Great, much praise be to Allah and glory be to Allah at the beginning and end of the day). There are two types of Takbeer for Eid Al-Adha:",
                "Unrestricted Takbeer (mutlaq):",
                "It is not limited to a specific time. It starts from the beginning of the month of Dhul-Hijjah (i.e., from sunset on the last day of Dhul-Qi’dah) until the end of the days of Al-Tashreeq, which is when the sun sets on the thirteenth day of Dhul-Hijjah).",
                "Restricted Takbeer (muqayyad):",
                "It is limited to the time immediately after the five daily prayers. It starts from Fajr on the day of Arafah and lasts until the sun sets on the last day of the days of Tashreeq, which is the thirteenth of Dhul-Hijjah.",
                "",
                "Tawaf Al-Ifadah",
                "It is also called the Tawaf of Hajj, and it is one of the pillars of the Hajj, without which the Hajj is not valid. Tawaf is an act of worship to Allah that shows man’s need and the turning of the heart and limbs to Allah, in which the Muslim goes around the Ka’bah seven times, worshiping his Lord and drawing closer to Him. The time for Tawaf Al-Ifadah begins at midnight on the night of the tenth of Dhul-Hijjah (the day of Eid), and its time extends until the end of the last day of the month of Dhul-Hijjah. The Prophet (peace be upon him) did Tawaf Ifadah on the day of Eid (the tenth of Dhul-Hijjah), after he threw Jamrat Al-Aqaba, shaved his head, took a bath, and put on his clothes.",
                "It is permissible for the pilgrim to perform the Tawaf Al-Ifadah in his usual clothes, without entering Ihram, if he has thrown Jamrat Al-Aqabah and shaved his head or cut short his hair. It is also permissible for him to delay Tawaf Al-Ifadah and combine it with the Farewell Tawaf (with which the pilgrim ends his stay in Makkah) in one Tawaf, therewith intending to perform Tawaf Al-Ifadah. As for the woman who is afraid of a legitimate excuse (menstruation), she should not delay Tawaf as much as she can.",
                "",
                "Who must offer a sacrificial animal?",
                "The sacrifice (slaughtering of camels, cows, or sheep) is obligatory on two types of pilgrims:",
                "Tamattu' pilgrim, the one who performed Umrah on his journey, then exited his ihram, then entered Ihram again for Hajj.",
                "Qiran pilgrim, the one who combines Umrah and Hajj in his rituals.",
                "The sacrifice is not obligatory for the Ifrad pilgrim who entered Ihram for Hajj only.",
                "As for the types from which the sacrifice is offered, they are:",
                "Sheep or goats, one of which suffices for a pilgrim.",
                "Camels or cows, one of which is sufficient for seven pilgrims.",
                "As for those who cannot afford to slaughter a sacrificial animal, they should fast for ten days: three days during Hajj, before the day of Arafah, which may also be observed during the days of Al-Tashreeq (11, 12, 13 of Dhul-Hijjah), and seven days after Hajj, when he returns to his family. Allah, the Almighty, said: Then whoever performs Umrah [during the Hajj months] followed by Hajj [offers] that can be obtained with ease of sacrificial animals. And whoever cannot find [or afford such an animal] - then a fast of three days during Hajj and of seven when you have returned [home]. Those are ten complete [days].",
                "",
                "Authorization",
                "With the increasing number of pilgrims from different countries of the world, pilgrims used to authorize the competent authorities to slaughter on their behalf. This can be done by purchasing paper or electronic vouchers that are distributed in several locations in Mina, or through electronic services. This is easier for the pilgrims and allows an opportunity that the meat of the sacrifice to reach the needy.",
                "Adahi Project website (www.adahi.org).",
                "The electronic path of the Ministry of Hajj and Umrah (www.haj.gov.sa)",
                "Ehsan Platform (www.ehsan.sa).",
                "Saudi Post (www.splonline.com.sa).",
                "Hadiyah Charity Association (www.hadiyah.org.sa)",
                "Sales outlets around the Two Holy Mosques and in the holy sites.",
                "Al Rajhi Bank (www.alrajhibank.com.sa).",
                "Bank Albilad (www.bankalbilad.com).",
                "How do I make sure that I have authorized the project? When will the sacrifice be slaughtered?",
                "As soon as the value of the sacrifice is deducted from your account, or the voucher reaches you, you have authorized the Project to slaughter the sacrifice on your behalf. You have discharged your obligation, and your sacrifice will be slaughtered within the specified legal period.",
                "",
                "The first Tahallul",
                "Tahallul is to exit the state of Ihram and to lift the restrictions imposed on the pilgrim while in the state of Ihram. On the day of Eid Al-Adha (the tenth of Dhul-Hijjah), the pilgrim throws the Al-Jamrah Al-Kubra, slaughters his sacrificial animal in Mina or Makkah, and shaves his hair or cuts it short. By doing these things, the pilgrim has completed the first stage of exiting Ihram. Hence it becomes permissible for him to do all the things that were forbidden to him whilst in Iham, apart from intercourse. He may take a bath and perfume himself, remove the Ihram clothes, wear the Eid clothes, and pack his luggage.",
                "The fact of shaving or cutting hair short is closely related to the first stage of exiting Ihram, and is one of the duties of Hajj; there are places equipped for shaving that the pilgrim finds immediately after throwing Jamrat Al-Aqabah. So be sure to choose a licensed barber in a place specifically equipped for that purpose. Stay away from the barbers on roads and sidewalks, and do not expose yourself to infectious diseases due to shaving. At the barber’s shop, make sure of:",
                "Using disposable cut-throat razors with plastic handles for one-time use only.",
                "Using new tools for new persons.",
                "Washing hands with soap and water before starting.",
                "",
                "Order of the rituals on the Day of Sacrifice",
                "The Messenger of Allah (peace be upon him) allowed the pilgrims a flexible order of the rituals on the Day of Sacrifice in a manner that is easier for them. It was narrated in a hadith: Whoever asked the Prophet (peace be upon him) about anything done before or after the other, he told him: 'No harm done. Go and do (whatever you missed)'The flexible order of the rituals on the Day of Sacrifice brings about facilitation for Muslims and a sign of the Prophet’s (peace be upon him) compassion toward his Ummah. The time of Hajj is a severe time, in which some hardships and necessities force people to do some things without order. Therefore, the Prophet (peace be upon him) eased order restrictions. The most important thing is to complete the Hajj rituals. Despite the different circumstances of the pilgrims, it is advised to follow the campaign program in arranging the rituals and their times. This will make it easier for the pilgrim himself and the rest of the pilgrims."
            ]
        }
    },
    {
        "id": 10,
        "title": {
            "ar": "أيام التشريق",
            "en": "Days of Al-Tashreeq"
        },
        "mainImagePath": "assets/images/hajj/arafa.jpg",
        "details": {
            "ar": [
                "",
                "ما هي أيام التشريق؟",
                "أيام التشريق هي ثلاثة أيام بعد عيد الأضحى (11 – 12 – 13) من ذي الحجة، وهي أيام عيد وفرح بتمام الحج. سميت أيام التشريق لأن الناس كانوا بعد ذبح الهدي يوم العيد يقطعون اللحم ويبرزونه تحت الشمس كي يجف ولا يفسد، وهذا هو التشريق. وهذه الطريقة معروفة في كثير من البلدان قديماً بأسماء مختلفة. وفي فضل هذه الأيام قال النبي -صلى الله عليه وسلم-: (أيام التشريق أيام أكلٍ وشربٍ وذكرٍ لله)، فيشرع التوسّع في الأكل والشرب فيها، ما لم يصل ذلك إلى حدّ الإسراف والتبذير والتهاون بالنعم. كما يحرص الحاج فيها على ذكر الله تعالى، بالتكبير بعد الصلوات وفي كل الأوقات.",
                "",
                "التكبير في أيام التشريق",
                "تكبير الله تعالى من أعظم أنواع الذكر وأجلّها، وقد أمر الله به نبيه -صلى الله عليه وسلم- في بدايات البعثة النبوية، فقال: ﴿يَا أَيّهَا الْمُدّثر * قُمْ فَأَنْذِرْ * وَرَبّكَ فَكَبّرْ﴾. والتكبير معناه يدل على تعظيم الله تعالى وإجلاله، واعتقاد أنه لا شيء أكبر ولا أعظم منه، فهو أعظم من كل شيء، وهو من يصغر دون عظمته كل كبير، ويتضاءل أمام جلاله كل جليل.",
                "لعظم شأن التكبير؛ فإن الله تعالى شرعه في أشرف المواضع وأعلاها مكانة، مثل الصلوات والحج والأعياد، وقد أمر الله تعالى بذكره في أيام التشريق المباركة (11، 12، 13 من ذي الحجة)،",
                "فقال: ﴿وَاذْكُرُوا اللهَ فِي أَيّامٍ مَعْدُودَاتٍ﴾. وأخبر النبي -عليه الصلاة والسلام- أنه ينبغي الإكثار من ذكر الله تعالى في هذه الأيام، فقال: (أيام التشريق أيام أكل وشرب وذكر لله). والتكبير من أعظم الذكر، فيُسَن للحاج أن يكبر الله ويذكره أيامَ التشريق، في كل أوقاته، وخصوصاً بعد الصلوات المفروضة، فيقول: ”الله أكبر الله أكبر، لا إله إلا الله، الله أكبر الله أكبر، ولله الحمد“، ”الله أكبر كبيراً، والحمد لله كثيراً، وسبحان الله بكرةً وأصيلاً",
                "",
                "رمي الجمرات في أيام التشريق",
                "في أيام التشريق يبيت الحجاج في مشعر منى، ويرمون الجمرات الثلاث يوم الحادي عشر ويسمّى يوم القرّ ، ويرمون الجمرات يوم الثاني عشر، وكذلك الثالث عشر -لمن تأخّر- كل ذلك بعد الزّوال ويمتد وقته إلى غروب الشمس. كل جمرة بسبع حصيات، أي في كل يوم يرمون 21 حصاة، قال جابر -رضي الله عنه-: (رمى رسول الله -صلى الله عليه وسلم- الجمرة يوم النحر ضحى، وأما بعد [يعني: في أيام التشريق]، فإذا زالت الشمس).",
                "يجب الترتيب في رمي الجمرات أيام التشريق، فيبدأ الحاج بالجمرة الأولى -وهي الصغرى أقرب الجمرات لمسجد الخيف- فيرميها بسبع حصيات، ثم يقف فيدعو طويلاً، ثم ينصرف إلى الجمرة التي تَلِيها -وهي الوسطى- فيرميها مثل التي قبلها، ثم يقف ويدعو طويلاً، ثم ينصرف إلى جمرة العقبة -أبعد الجمرات من منى- فيرميها كذلك ولا يقف عندها بل ينصرف إذا رمى.",
                "وللحاج خلال أيام التشريق الاستفادة من طرق النقل المتوفرة وصولاً إلى الجمرات، منها قطار المشاعر، وطرق المشاة، والحافلات، والدراجات النارية. وعند صعود الجمرات، تتوفر سيارات جولف لنقل كبار السن ومن يثقل عليه المشي. ومن تيسير الله تعالى على عباده في الحج، أنه شرع ويسّر التوكيل في الرمي، وذلك لمن أعجزه المرض والتعب عن الرمي. فيجوز لكبار السن والضعفاء والمرضى والحوامل، ومن يخشى على نفسه الضرر، أن يوكل من يرمي عنه الجمرات من الحجاج، وعلى الوكيل الذي سيتولى الرمي أن يرمي الجمرة عن نفسه أولاً، ثم يرمي عمّن أنابه، ثم ينتقل إلى الجمرة التالية ويفعل نفس الشيء.",
                "",
                "التعجّل والتأخّر",
                "يجوز للحاج أن يتعجّل في حجه، فيخرج من منى يوم الثاني عشر، أو يتأخر فيخرج يوم الثالث عشر من ذي الحجة، كما قال تعالى: ﴿فَمَن تَعَجّلَ فِي يَوْمَيْنِ فَلَا إِثْمَ عَلَيْهِ وَمَن تَأَخّرَ فَلَا إِثْمَ عَلَيْهِ﴾. ويعني ذلك أن من تعجل في يومين من أيام التشريق، فنفر في اليوم الثاني من منى؛ فلا إثم عليه في تعجّله، ومن تأخر عن النفر إلى اليوم الثالث فلا إثم عليه في تأخره.",
                "هل يرمي المتعجّل جمرات يوم الثالث عشر في يوم الثاني عشر؟",
                "إن كان الحاج من المتعجلين فإنه يرمي الجمرات يوم الحادي عشر ثم يوم الثاني عشر فقط، ويكتفي بذلك، ولا يُشرع له أن يرمي في يوم الثاني عشر رمياً ثانياً عوضاً عن يوم الثالث عشر الذي لن يقضيه في منى.",
                "",
                "طواف الوداع",
                "هو تحية بيت الله الأخيرة قبل مغادرة الحاج لمكة. فكما بدأ الحاج زيارته طوافاً بالبيت فإنه يختمها به، ويستثنى من ذلك المرأة إذا كانت حائضاً أو نفساء، فليس عليها طواف وداع. ووقت طواف الوداع مرتبط بوقت مغادرة مكة بعد الحج، وهو عادة ما يكون بعد رمي الجمرات في اليوم الثاني عشر للمتعجّل، أو اليوم الثالث عشر للمتأخّر. وإن أراد الحاج السكن بمكة بعد خروجه من منى فإنه لا يلزمه طواف الوداع حتى يهم بالخروج منها.",
                "يجوز لمن أخّر طواف الإفاضة -طواف الحج- أن يطوف بالبيت وينوي أنه طواف الحج، ويكفيه ذلك عن طواف الوداع، والمهم أن ينوي به طواف الحج الذي لا يقوم الحج إلا به؛ لأنه الأصل الذي عليه العناية به، وبه يتحقق إن صار آخر عهده بالبيت الطواف.",
                "",
                "ماذا بعد الحج؟",
                "انقضى موسمُ الحج، ومرّت الأيام المعدودات، وهكذا تنقضي مواسم الخير بسرعة، ويذهب تعبها، ثم يجني المسلم ما أودعه فيها من حسنات، وينعم بأثرِ الحج على سلوكه وحياته ومجتمعه، قال تعالى: ﴿فَإِذَا قَضَيْتُمْ مَنَاسِكَكُمْ فَاذْكُرُوا اللهَ كَذِكْرِكُمْ آبَاءَكُمْ أَوْ أَشَدّ ذِكْرًا﴾. فقد أوصى سبحانه الحاج أن يستمر مبتعداً عن المحرمات كما كان في أيام حجه. وكما كان في تلك الأيام متّصفاً بمحاسن الأخلاق، فإنه يواصل الاتّصاف بها.",
                "",
                "توفّر ماء زمزم في المطارات",
                "مطار الملك عبدالعزيز الدولي بجدة:",
                "يُتاح شراء وشحن عبوة بسعة 5 ليترات، من إحدى نقاط البيع في صالات المطار.",
                "الحد المسموح به هو عبوة واحدة لكل مسافر.",
                "مطار الأمير محمد بن عبدالعزيز الدولي بالمدينة المنورة:",
                "يُتاح شراء وشحن عبوة بسعة 5 ليترات، من مركز مبيعات مياه زمزم في المطار.",
                "الحد المسموح به هو عبوة واحدة لكل مسافر."
            ],
            "en": [
                "",
                "What are the Days of Al-Tashreeq?",
                "The Days of Al-Tashreeq are three days following Eid Al-Adha (11th, 12th, and 13 of Dhul-Hijjah). These are days of Eid and the joy of completing the Hajj. The days of Al-Tashreeq were named so because, after slaughtering the sacrifice on the day of Eid, people used to cut the meat and put it out under the sun so that it would dry and not spoil. This practice is called “Tashreeq”. In the past, this practice was known in different places taking different names. Concerning the virtues of these days, the Prophet (peace be upon him) said: The Days of Al-Tashreeq are days of eating, drinking, and remembering (dhikr) of Allah. It is allowed to eat and drink in abundance, as long as it does not reach the point of extravagance, waste, and misuse of blessings. In addition, the pilgrim should be keen to remember Allah, the Almighty, by saying the Takbeer after the prayers and at all times.",
                "",
                "Takbeer during the Days of Al-Tashreeq",
                "Takbeer (glorification) of Allah, the Almighty, is one of the greatest and most solemn types of remembrance. At the beginning of the Prophet’s Mission, Allah commanded His Prophet (peace) to stick to Takbeer and said: Oh, you who covers himself [with a garment]; Arise and warn; And your Lord glorify. Takbeer indicates the glorification and majesty of Allah, the Almighty, believing that there is nothing greater or more glorified than Him. He is greater than everything; every great person/thing diminishes before His greatness and every majestic person/thing diminishes before His majesty.",
                "Owing to the great significance of Takbeer, Allah, the Almighty, made it a practice to be followed on the most honorable and dignified occasions, such as prayers, Hajj, and Eids. Allah, the Almighty, commanded that He be remembered during the blessed days of Al-Tashreeq (11th, 12th, and 13th of Dhul-Hijjah), and said: And remember Allah during [specific] numbered days. The Prophet (peace be upon him) told us that we should remember Allah, the Almighty, a lot in these days, and said: The days of Al-Tashreeq are days of eating, drinking, and remembering (dhikr) of Allah. Takbeer (glorification) of Allah, the Almighty, is one of the greatest types of dhikr. It is recommended for the pilgrim to say Takbeer and remember Him on the Days of Al-Tashreeq, at all times, especially after the obligatory prayers, in this formula: Allahu akbar, Allahu akbar, Allahu akbar la ilaha illa-Allah, wa Allahu akbar, Allah akbar, wa Lillah il-hamd (Allah is Most Great, Allah is Most Great, Allah is Most Great there is no god but Allah, Allah is Most Great, Allah is Most great, and to Allah be praise) Allahu akbaru kabira wa alhamdu Lillahi kathira wa subhan Allahi bukratan wa asila. (There is no god but Allah, Allah is Most Great, Allah is Most Great, much praise be to Allah and glory be to Allah at the beginning and end of the day).",
                "On the days of Al-Tashreeq, the pilgrims stay overnight in Mina, and throw the three Jamarat on the eleventh day, which is called “Yawm Al-Qarr.” They then throw the Jamarat on the twelfth, as well as the thirteenth, for those who would stay a day longer, all after the meridian. The time of throwing extends until sunset. Seven pebbles per Jamrah, i.e. every day they throw 21 pebbles. Jabir (may Allah be pleased with him) said: Allah's Messenger (peace be upon him) threw pebbles at the Jamrah on the Day of Sacrifice in the forenoon, and next [meaning on the Days of Al-Tashreeq] when the sun had passed the meridian.",
                "",
                "Throwing Jamarat on the Days of Al-Tashreeq",
                "It is obligatory to throw the Jamarat during the days of Al-Tashreeq in the specified sequence. The pilgrim starts with the first Jamrah, i.e. Al-Sughra, which is the closest to Al-Khaif Mosque. After seven pebbles are thrown at it, the pilgrim stands and prays for a long time. He then goes to the next Jamrah, which is Al-Wusta, throws it like the one before it, then stands and prays for a long time. He then goes to Jamrat Al-Aqabah, the farthest Jamrah from Mina, and throws it likewise. After throwing the pebble, he should leave without standing.",
                "During the days of Al-Tashreeq, the pilgrim can take advantage of the transportation methods available to reach Jamarat, including the Mashaer Train, pedestrian roads, buses, and motorcycles. When going up to the Jamarat, golf cars are available to transport the elderly and those who are burdened by walking.",
                "The sick and fatigued people are allowed to throw Jamarat by proxy. This is one of the manifestations of Allah’s facilitation for His servants in Hajj. It is permissible for the elderly, the weak, the sick, the pregnant, and whoever fears harm for himself, to delegate one of the pilgrims to throw the pebbles on his behalf. The proxy should first throw the pebbles for himself, then throw pebbles on behalf of the person who appointed him, then move to the next Jamrah, and repeat the throwing of pebbles in the same manner until the end.",
                "",
                "Early departure or waiting for Dhul-Hijjah 13th",
                "It is permissible for the pilgrim to leave Mina on the twelfth of Dhul-Hijjah, or wait and leave on the thirteenth, as Allah, the Almighty, said: Then whoever hastens [his departure] in two days - there is no sin upon him; and whoever delays [until the third] - there is no sin upon him This means that whoever hastens in the two days of Al-Tashreeq and leaves Mina on the second day there is no sin on him, and whoever delays the march until the third day, there is no sin on him.",
                "Can the early leaver throw the Jamarat of the thirteenth on the twelfth?",
                "If the pilgrim is in a hurry, he should throw the Jamarat on the eleventh and then on the twelfth only, and that suffices him. It is not prescribed for him to throw twice on the twelfth day to make up for the thirteenth day, which he will not spend in Mina.",
                "",
                "Farewell Tawaf",
                "It is the last greeting to Allah's House before the pilgrim leaves Makkah. Just as the pilgrim begins his visit with Tawaf around the House, he ends it with the same, except for menstruating or postpartum women for they do not have to perform the Farewell Tawaf. The time of the Farewell Tawaf is related to the time of leaving Makkah after the Hajj, which is usually after throwing the Jamarat on the twelfth day for the early leavers, or the thirteenth day for the leavers on that day. If the pilgrim wants to stay in Makkah after leaving Mina, he does not have to perform the Farewell Tawaf until he intends to leave it.",
                "It is permissible for the one who delays Tawaf Al-Ifadah, i.e. the Tawaf of Hajj, to circumambulate the House and intend that it is the Tawaf of Hajj, and that suffices him for the Farewell Tawaf as well. What is important is to intend Hajj with such Tawaf, without which Hajj is not established. Since it is the last Tawaf, it will count as the Farewell Tawaf as well.",
                "",
                "What is after Hajj?",
                "The season of Hajj is over, and the number of days has passed. This is how the seasons of goodness pass quickly, and their fatigue goes away. Then the Muslim reaps the outcome of the good deeds he did on these days and enjoys the impact of Hajj on his behavior, his life, and his society. Allah, the Almighty, said: And when you have completed your rites, remember Allah like your [previous] remembrance of your fathers or with [much] greater remembrance. Allah, the Almighty, commands the pilgrim to continue to stay away from prohibitions, as he was during the days of Hajj. Just as he fostered good morals in those days, he should keep them up later.",
                "",
                "Zamzam water is available at airports",
                "King Abdulaziz International Airport in Jeddah:",
                "It is possible to purchase and ship a 5-liter bottle from one of the points of sale in the airport halls.",
                "The limit is one bottle per passenger.",
                "Prince Muhammad bin Abdulaziz International Airport in Madinah",
                "It is possible to purchase and ship a 5-liter bottle from the Zamzam water sales center at the airport.",
                "The limit is one bottle per passenger."
            ]
        }
    },
    {
        "id": 11,
        "title": {
            "ar": "سنن ومستحبات الحج",
            "en": "Sunnah and desirable acts of Hajj"
        },
        "mainImagePath": "assets/images/hajj/sonan.jpg",
        "details": {
            "ar": [
                "",
                "قربى إلى الله",
                "السُّنن والمستحبات، يثاب فاعلها امتثالاً ولا يعاقب تاركها. لها ثمرات عظيمة على المؤمن؛ حيث يؤديها رغبة في ثواب الله تعالى والتقرب إليه والفوز بمحبته ورضاه. فهي صيانة ووقاية للواجبات، فمن كان مؤدياً للنوافل والمستحبات؛ فإنه بالطبع أشد التزاماً بالواجبات، أما من اقتصر على الواجبات؛ فإنه معرض لفواتها بسبب أو آخر. كما أن السُّنن والمستحبات أسرع إيصالاً في سلم الكمال، ومن الأحاديث الواردة في ذلك الحديث القدسي: (وما يزال عبدي يتقرّب إلي بالنوافل حتى أُحبه).",
                "",
                "تعرف على أهم السنن والمستحبات في رحلة حجّك:",
                "الاغتسال للإحرام.",
                "تقليم الأظافر وتهذيب اللحية.",
                "حلق شعر العانة والإبطين.",
                "تطييب الجسد والثياب قبل نيّة الإحرام.",
                "الإحرام عَقب صلاة فريضة أو صلاة ركعتين.",
                "لبس إزار ورداء أبيضين.",
                "الإكثار من التلبية.",
                "الاشتراط عند الخوف من عدم إتمام النسك.",
                "المبيت بمِنى ليلة عرفة.",
                "الدعاء عند الصفا والمروة.",
                "الهرولة بين العلمين عند السعي للرجال.",
                "صلاة ركعتين خلف مقام إبراهيم بعد الطواف.",
                "استلام الحجر الأسود وتقبيله.",
                "طواف القدوم.",
                "الاضطباع عند طواف القدوم.",
                "قراءة القرآن والذكر.",
                "استقبال القبلة وجبل الرحمة في عرفة.",
                "التقاط سبع حصيات لرمي جمرة العقبة.",
                "التقاط إحدى وعشرين حصاة كل يوم لرمي الجمرات.",
                "الأكل من الهدْي."
            ],
            "en": [
                "",
                "A means of drawing near to Allah",
                "As for the Sunnah and recommended acts, the one who does them will be rewarded in compliance while the one who abandons them will not be punished. A believer who performs them seeking the reward and nearness to Allah and His pleasure shall have a great reward. Sunnah acts are protective of obligatory acts, so whoever performs the supererogatory and desirable things, of course, will be more committed to duties. As for those who perform duties only, they are running the risk of missing them due to one reason or another. Also, the Sunnah and desirable acts are faster in reaching the grades of perfection. According to a relevant Qudsi hadith: My slave keeps on coming closer to Me through performing Nawafil (supererogatory acts of worship) until I love him",
                "",
                "Learn about the most important Sunnah and desirable acts on your Hajj journey:",
                "Taking a bath for Ihram.",
                "Nail trimming and beard grooming",
                "Shaving pubic hair and armpits.",
                "Perfuming the body and clothes before the intention of entering Ihram.",
                "Assuming Ihram after an obligatory prayer or a two-rak'ah prayer.",
                "Wearing two white towels, one for the upper part of the body, and the other for the lower part.",
                "Pronouncing too much Talbiyah.",
                "Condition when fear of not completing the ritual.",
                "Staying overnight in Mina on the night of Arafah.",
                "Supplication at Safa and Marwa.",
                "Jogging between the two sign posts for men while performing Saa'i.",
                "Offering two Rak'ahs of prayer behind Maqam Ibrahim after finishing Tawaf",
                "Touching and kissing the Black Stone",
                "Arrival Tawaf",
                "Al-Idtibaa (leave their right shoulder bare) during the arrival Tawaf.",
                "Reciting the Quran and remembrance of Allah.",
                "Facing the Qiblah and the Mount of Mercy in Arafa.",
                "Picking up seven pebbles to throw at Jamrat Al-Aqaba.",
                "Picking up twenty-one pebbles every day for stoning the Jamarat.",
                "Eating from the meant of the sacrificial animal."
            ]
        }
    },
    {
        "id": 12,
        "title": {
            "ar": "تطبيق نسك",
            "en": "Nusuk » Application"
        },
        "mainImagePath": "assets/images/omrah/nusuk.jpeg",
        "details": {
            "ar": [
                "نُسُك تعد أول منصة رسمية سعودية تتيح لك خيار التخطيط والحجز وعيش تجربة العمرة أو الحج الخاصة بك. نُسُك تتيح للمسافرين من جميع أنحاء العالم تنظيم وتخطيط جميع تفاصيل زيارتهم بسهولة، بدءا من التقدم بطلب الحصول على تأشيرة إلكترونية إلى حجز الفنادق والرحلات الجوية. مستقبلًا، سيمكنك نُسُك من جدولة الزيارات للمواقع المهمة، والعثور على وسائل النقل، وتنظيم مسارات الرحلات، والوصول إلى الخدمات على أرض الواقع مثل تعقب الطواف وغيره الكثير.",
                "",
                "https://www.nusuk.sa/ar"
            ],
            "en": [
                "Use Nusuk, the first-ever official planning, booking and experience platform, to create your Hajj or Umrah itinerary to Makkah, Madinah, and beyond. With Nusuk, travelers from all over the world can easily organize their entire visit, from applying for an eVisa to booking hotels and flights. In the future, Nusuk can also be used to schedule visits to important sites, find transportation, curate itineraries, and access on-ground tools such as the Tawaf tracker and more.",
                "",
                "https://www.nusuk.sa/en"
            ]
        }
    }
]