[
    {
        "id": 1,
        "title": {
            "ar": "الإحرام",
            "en": "Ihram"
        },
        "mainImagePath": "assets/images/omrah/ihram.jpg",
        "details": {
            "ar": [
                "الإحرام لغةً هو: الدخول في الحُرمة ويقال: أحرم الرجل، إذا دخل في حرمة عهدٍ أو ميثاقٍ فيحرُم عليه ما كان حلالاً له، والإحرام اصطلاحاً: هو نية الدخول في النُّسك، وهذا مذهب الجمهور؛ فهو الركن الأول من أركان العمرة، فعن عمر بن الخطاب -رضي الله عنه- أن النبي -صلى الله عليه وسلم- قال: (إنما الأعمال بالنيات، وإنما لكل امرئ ما نوى)، ووجه الدلالة أنه لا يصح العمل ولا يثبت إلا بوقوع النية.",
                "من الإحرام تبدأ نية أداء النسك بالقلب، ويتلفظ بها باللسان: 'لبيك اللهم عمرة'، ولا مانع بإتمامها بإضافة الاشتراط، فيقول: 'فإن حبسني حابس فمحلي حيث حبستني' عند الخوف من عدم التمكن من أداء النسك لمرضٍ أو ظرفٍ متوقع، ويجب على الرجل أن يتجرد من المخيط كله، ويرتدي إزاراً ورداءً، ولا يغطي رأسه بشيء، أما المرأة فتحرم في ملابسها العادية، غير أنها لا تلبس النقاب أو القفازين.",
                "تتمثل الحكمة من مشروعية الإحرام بتحقيق العبودية لله، وتعظيمه، والامتثال لأمره، وإظهار المساواة بين جميع المسلمين حاكمهم ومحكومهم، غنيهم وفقيرهم، وكذلك التذكير باليوم الآخر والحشر.",
                "",
                "لباس الإحرام",
                "بالنسبة للرجل : يحرم عليه لبس المخيط، أي يجب عليه أن يخلع ملابسه المعتادة، فيزيل عنه أغطية الرأس، كالقبعة والعمامة وغيرها، وكذلك اللباس المعتاد المفصِّل للجسم، مثل: القميص، والبنطلون، والجوربين، والقفازين وما يشبههما، وكذلك الأحذية المحيطة بكامل القدم مع الكعبين، لقول النبي -صلى الله عليه وسلم- لما سئل عما يلبس المحرم: (لا يلبس القميص، ولا العمائم، ولا السراويل، ولا البرانس، ولا الخفاف، إلا أحد لا يجد نعلين فيلبس الخفين، وليقطعهما أسفل من الكعبين)، فيلبس الرجل إزاراً يُحيط بأسفل بدنه، ورداءً يغطي أعلاه، ويشرع أن يكون أبيض اللون، وله كذلك أن يلبس نعالاً مناسباً لا يغطي كامل القدم.",
                "بالنسبة للمرأة : لا يحرم على المرأة لبس المخيط، وهي مخيرة عند إحرامها فيما تلبسه، فتحرم بما شاءت من الثياب والألبسة بألوانها وأشكالها، بشرط أن تكون تلك الملابس فضفاضة تسترها، ولا تعيق حركتها، وليس فيها زينة ظاهرة تفتن بها الرجال، قال النبي -صلى الله عليه وسلم- فيما أرشد إليه المحرم: (ولا تَنتقِب المرأَةُ ولا تلبس القفّازينِ يعني: في الإحرام).",
                "ويمنع على المرأة أن تغطي الوجه وتلبس النقاب، وإذا كانت بحضرة أجانب فلها أن تغطي وجهها. تلبس القفازين",
                "طريقة لبس الإحرام : إحرام الرجل يكون بإزارٍ يغطي أسفل جسده، ورداءٍ يغطي أعلى الجسد، والسُّنة للمحرم أن يجعل الرداء على كتفيه جميعاً، وأن يجعل طرفيه على صدره، وهذا هو الذي فعله النبي -عليه الصلاة والسلام-، فإذا أراد أن يطوف طواف القدوم، اضطبع، أي جعل وسط ردائه تحت إبطه الأيمن وأطرافه على عاتقه الأيسر، وكشف منكبه الأيمن في حالة الطواف، أما الذي يكشف منكبه دائماً يخالف السنة، إلا في حال كان ذلك لأكله وشرابه أو قضاء حاجته.",
                "'لبّيك عمرة' تبدأ التلبية من بداية الإحرام، فعند دخول المعتمر في الإحرام، ينوي أداء عمرته ويقول: 'لبّيك عمرةً'، وبذلك يكون محرماً، ثم يرفع صوته ملبياً بتلبية النبي -صلى الله عليه وسلم-: (لبّيكَ اللهُم لبّيكَ، لبّيكَ لا شريكَ لك لبّيك، إنّ الحمْدَ والنّعمةَ لك والْمُلْك، لا شريكَ لك)، وتنتهي التلبية في العمرة عند رؤية البيت أو بدء الطواف.",
                "الإحرام من الطائرة : يجوز للمعتمر القادم بالطائرة أن يحرم في طائرته، وذلك قبل وصوله إلى مدينة جدة، عند محاذاة الميقات، حيث يتم الإعلان في الطائرات عادةً عن محاذاة الميقات قبل الوصول إليه بزمن كافٍ، ثم يعاد التنبيه عند محاذاته، وعلى من أراد العمرة أن يستعد بلباس الإحرام، ويتجنب محظورات الإحرام قبل الإعلان عن المحاذاة بمدةٍ كافية.",
                "الاشتراط في الإحرام : قال -سبحانه وتعالى-: ﴿يريد الله بكم اليسر ولا يريد بكم العسر﴾، ومن مظاهر هذا: التيسير على المسلم في أداء العبادات، ومراعاة الظروف التي قد تمنعه من إكمال نسكه الذي نواه في العمرة، فيشرع له إن خاف ألّا يُكمل نسكه لأي سبب كان أن يشترِط في إحرامه، ويكون الاشتراط عند الخوف من عدم إتمام النسك، إما لمرض أو لعذر شرعي، فيُشرع عند الإحرام الاشتراط في النية، وذلك أن يقول: 'فإن حبسني حابسٌ فمحلي حيث حبستني' بعد قوله: 'لبيك عمرة'، فإذا قالها واشترط، وحصل أمرٌ منعه من إتمام العمرة؛ جاز له الخروج من الإحرام، والتوقف عن إكمال العمرة، وليس عليه شيء.",
                "",
                "يُسنُّ للمُحرِم عدد من الأمور",
                "قبل الإحرام: الاغتسال أو الوضوء، سواء في الميقات أو المنزل. النظافة الشخصية، من قص الأظافر وإزالة شعر الإبط ونحوه. تطييب البدن.",
                "أثناء الإحرام: الإحرام بعد صلاة مكتوبة. استقبال القبلة عند التلبية، ورفع الصوت فيها للرجال.",
                "بعد الإحرام: تعظيم شعائر الله وأوامره ونواهيه الابتعاد عن كل ما يخدش الإحرام من الخصام ورفع الصوت والإيذاء والجدال. الإكثار من التلبية، فهي ذكرٌ ودعاءٌ عظيم لا يشرع إلا في هذه اللحظات."
            ],
            "en": [
                "Linguistically, Ihram means entering into a state of prohibition. One says “a man entered into Ihram” when he enters into the prohibition of a treaty or covenant. Thus, what used to be permissible for him is now prohibited. Technically, it is assuming the intention to perform rituals. This is the doctrine of the majority. Ihram is the first pillar of Umrah. ‘Umar ibn al-Khattāb, may Allah be pleased with him, reported that the Prophet, peace be upon him, said: 'Verily, the reward of deeds depends on the intentions, and each person will be rewarded according to what he intended”. That is, the deed is not valid or proven except by the occurrence of the intention.",
                "During Ihram, the intention to perform Umrah begins with the heart, and is expressed through the tongue: “Labbayk Allahumma Umrah”. As it is acceptable to include a condition, he can say: 'If something prevents me, then my place is where you halted me' if there is a fear that he will not be able to perform the ritual due to illness or an expected condition. The man must take off his usual clothes, put on an Izar and Rida, and not cover his head. In Ihram, women should wear their normal clothing and shouldn't wear gloves or Niqab.",
                "The reason behind Ihram being legislated includes embodying servitude to Allah, exalting Him, and obeying His command, manifesting equality among all Muslims, rulers and subjects, rich and poor, and reminding them of the Last Day and resurrection.",
                "",
                "Ihram costume",
                "For a man: It is forbidden for a man to wear sewn clothes, that is, he must take off his usual clothes, so he removes his head coverings, such as hat or turban. Also, the usual sewn clothing, such as shirts, pants, socks, and gloves. As well as shoes that cover the entire foot and ankles. According to the saying of the Prophet when he was asked about what a Muhrim should wear: 'He should not wear a shirt, a turban, trousers, a hooded cloak, or leather socks except if he cannot find sandals; he may wear leather socks after cutting them to make them lower than the ankles.",
                "For a woman: It is not forbidden for a woman to wear sewn clothes, she can choose what she wants to wear. She can enter into the state of Ihram in whatever color of clothes she likes, provided that they are loose, cover the body without impeding movement, and does not have apparent adornments that may tempt men. The Prophet, peace be upon him, said:” And women should not cover their faces when in Ihram, or wear gloves.",
                "A woman in Ihram is forbidden from the following: Covering the face and wearing Niqab, yet, if she is in the presence of non-Mahram men, she may cover her face. Wearing gloves",
                "How to wear Ihram? A man’s Ihram consists of an Izar that covers the lower part of his body, and Rida that covers the top of the body. The Sunnah for the person in Ihram is to place Rida on all shoulders, and both ends on chest. This is what the Prophet, peace be upon him, did. He used to do Idtibaa when he wanted to perform Tawaf Al Qudoom. Idtibaa means placing the middle of Rida under the right armpit and its ends over the left shoulder, while exposing the right shoulder during Tawaf. A person who always exposes his shoulder violates the Sunnah, unless he is eating, drinking, or relieving himself.",
                "'Labbayka Umrah' Talbiyah begins from the beginning of Ihram. When performer of Umrah enters Ihram, he intends to perform his Umrah and says: “Labbaik Umrah,” and thus he is in Ihram. Then he raises his voice, reciting the Talbiyah to the Prophet: (Labayk, Allahumma labayk, labayk la sharika laka labayk. Inna'l-hamda wa'n-nimata laka wa'l-mulk, la sharika lak.). Talbiyah in Umrah ends when you see the Ka’bah or start Tawaf.",
                "'Entering Ihram state on plane' Performer of Umrah arriving by plane may enter Ihram on his plane before arriving in Jeddah when the plane is aligned with the Miqat. On a plane, the alignment with the Miqat is usually announced well before reaching it, followed by another announcement when the plane actually reaches it. A person who wants to perform Umrah must prepare his Ihram clothes and remove what is forbidden to him while in Ihram well before the announcement of the plane's alignment to the Miqat.",
                "'Conditional Ihram' Allah Almighty said: (Allah intends for you ease and does not want to make things difficult for you). One of the manifestations of this facilitation for Muslims in performing acts of worship is considering the circumstances that may prevent them from completing Umrah rituals. If the performer of Umrah fears that he will not be able to complete his rituals due to a disease or a lawful excuse or for a reason beyond his control, it is allowed for him to make a condition in his utterance of Umrah intention. One does so by saying “If something prevents me, then my place is where you halted me' after saying 'Labbayka Umrah.” If the performer of Umrah says this and stipulates a condition, and then something prevents him from completing the ritual, it is permissible for him to leave the state of Ihram without further obligation.",
                "",
                "Recommended acts for people in Ihram",
                "Before entering Ihram: Taking a shower or Wudu (ablution), whether at the Miqat or at home. Maintaining personal hygiene, such as clipping nails and removing armpit hair. Perfuming the body.",
                "During Ihram: Ihram after an obligatory prayer. Facing the Qiblah when reciting the Talbiyah, while raising the voice for men.",
                "After Ihram: Glorifying Allah’s rituals, commands, and prohibitions. Avoiding all acts that violate or desecrate your Ihram, such as quarrels, raising your voice, arguing with others or bothering them. Reciting Talbiyah as much as you can, for it is a great supplication that is only prescribed in these times."
            ]
        }
    },
    {
        "id": 2,
        "title": {
            "ar": "الطواف",
            "en": "Tawaf"
        },
        "mainImagePath": "assets/images/omrah/tawaf.jpg",
        "details": {
            "ar": [
                "الطواف لغةً هو: دوران الشيء على الشيء، واصطلاحاً هو: التعبد لله -عز وجل- بالدوران حول الكعبة على صفة مخصوصة، وهو عبادة لله؛ تُظهر الافتقار والتوجه بالقلب والجوارح إليه سبحانه، وهو الركن الثاني من أركان العمرة، ويقوم فيه المسلم بالطواف حول بيته الكريم -الكعبة- تعبداً لرب البيت وتقرباً إليه بما شَرع، وتشترط الطهارة من الحدث الأكبر و الأصغر في الطواف لأنه كالصلاة، وصفته أن يبتدئ المعتمر طوافه من الركن الذي فيه الحجر الأسود، حيث توجد علامة خضراء تبين ذلك في الأدوار العلوية، ثم يكبر المعتمر في كل شوط بمجرد محاذاته للحجر الأسود، وليس شرطاً أن يكون التكبير في نقطة محددة لا يصح التكبير قبلها أو بعدها، بل الأمر تقريبي، فإذا وجد المعتمر نفسه قد حاذى الحجر فإنه يكبّر.",
                "",
                "صفة الطواف",
                "يُشير المعتمر بيده إلى الحجر الأسود، ثم يبتدئ طوافه بحيث تكون الكعبة عن يساره (عكس عقارب الساعة)، وإن استطاع أن يقبّل الحجر الأسود فقد أدى السُّنة، وإن لم يتيسر له ذلك -في أيام المواسم والزحام- فلا شيء عليه، ويستحب للطائف أن يكثر من الدعاء إلى الله والابتهال إليه، كما يستحب أيضاً إذا وصل للركن الذي يسبق الحجر الأسود، ويسمى (الرّكن اليماني)، أن يمسح عليه إن تيسر له، ويكرر ما يفعله حتى يتم أشواطه السبعة.",
                "",
                "الرّمَل",
                "هو سنة في طواف العمرة في الأشواط الثلاثة الأولى، وصفته الإسراع في المشي، ويسمى كذلك الجذب، أما الأشواط الأربعة الأخيرة فيمشي فيها مشياً مثل المشي المعتاد، تأسياً بفعل المصطفى رسول الله -صلى الله عليه وسلم-، أما بالنسبة للنساء، فلا يسرعن، لأنها سُنة مخصصة للرجال.",
                "",
                "الاضطباع",
                "هو طريقة في لبس رداء الإحرام للرجال عند الطواف، وهي سُنة من سنن المصطفى -صلى الله عليه وسلم-، وتتمثل في أن يُظهر الرجل كتفه الأيمن في طواف العمرة، وقد جاءت مشروعية الاضطباع حينما ورد أن قريشاً قالت عن النبي -صلى الله عليه وسلم- وصحابته: (يقدم عليكم قوم قد أوهنهم المرض)، فأراد رسول الله -صلى الله عليه وسلم- وصحابته أن يُظهروا قوتهم ونشاطهم من خلال إبراز أكتافهم.",
                "",
                "الطواف بالعربات",
                "يجوز لمن لا يستطيع المشي، أو أحس بالإعياء والمرض والتعب، أن يطوف راكباً، وعليه أن يبقى مستيقظاً منتبهاً، لأن فيه عبادة، وأن يشغل وقته بالدعاء والتضرع إلى الله، وتتوفر في الحرم أنواع من العربات للطواف بها، ويمكن الوصول إلى هذه العربات بمختلف أنواعها في مناطق متعددة:",
                "العربات اليدوية (مجانية لكبار السن والأشخاص ذوي الإعاقة) في: الساحة الشرقية (مدخل النقل الجماعي) الساحة الغربية (مدخل الشبيكة).",
                "العربات الكهربائية (متاحة للحجز عبر تطبيق 'تنقل') وفي: الدور الأول ميزانين. مواقع التذاكر في الحرم: أجياد - الشبيكة - المروة",
                "خدمة دافعي العربات في: المطاف الأرضي (خط النية). المطاف الأول (خط النية).",
                "سُنة الصلاة بعد الطواف يُسن للطائف بعد أن ينهي طوافه أن يصلي ركعتين، وهي من السنن المؤكدة لكل من طاف بالكعبة، ويشرع له أن يقرأ في الركعة الأولى (سورة الكافرون)، وفي الركعة الثانية (سورة الإخلاص)، ولأن الطواف شعار التوحيد وإفراد العبادة -لله وحده لا شريك له-؛ فشرع له أن يعلن ذلك في السور التي يقرؤها عند إتمام طوافه.",
                "",
                "سنن الطواف",
                "للطواف سننٌ فعلَها رسول الله -صلى الله عليه وسلم-، وتابعها عليه صحابته الكرام، وقد قال -صلى الله عليه وسلم-: (خذوا عني مناسككم).",
                "التكبير، لمن حاذى الحجر الأسود أو الضوء الأخضر في الأدوار العليا عند بداية كل شوط ونهايته. الدعاء، حيث يُعد الطواف بالكعبة من أعظم مواقف الدعاء والتضرع إلى الله. الاضطباع، وهو سنة للرجال. الرّمَل، وهو سنة للرجل في تعجيل الخطى في الأشواط الثلاثة الأولى. صلاة ركعتي الطواف."
            ],
            "en": [
                "Linguistically, Tawaf means revolving around an object. Technically, it means worshipping Allah, Mighty and Majestic, by circumambulating around the Ka`bah in a specific manner. Tawaf is one of the pillars of Umrah. It is an act of worship in which, by directing our hearts and bodies to Allah, we are humbled to confess our needs to the Almighty. In this act of worship, the servant circumambulates the Ka`bah, offering worship to the Lord and drawing close to Him as He has instructed. Purity is required for both major and minor impurities during tawaf because it is like prayer. It is when the Umrah performer begins circumambulation from the corner where the Black Stone is located. Performer of Umrah should say Takbir in each round when he is parallel to the Black Stone. However, Takbir does not have to be uttered at this point. Neither Takbir before nor after it is invalid; rather, one can say Takbir somewhere near it. So, if the Umarh performer sees that he has already passed the Black Stone, he can still utter Takbir.",
                "",
                "Way of Tawaf",
                "Performer of Umrah shall point with his hand at the Black Stone, and then starts circumambulating with the Ka'aba to his left (counterclockwise). If he is able to kiss the Black Stone, then he has fulfilled the Sunnah. It is acceptable if he cannot do so during seasons and crowds. It is recommended for Umrah performer to supplicate Allah a lot and pray to Him. It is also recommended that when he reaches the corner that precedes the Black Stone, which is called (the Yemeni Corner), he wipes over it if possible, and repeats what he does until he completes his seven rounds of Tawaf.",
                "",
                "Ramal (Jogging)",
                "It is recommended to perform Ramal in the first three rounds of Umrah’s Tawaf. It means walking fast. As for the last four rounds, the Umrah performer should walk without doing Ramal, as the Messenger of Allah, peace be upon him, did. Women should not perform Ramal, since it is recommended only for men.",
                "",
                "Idtibaa",
                "It is a way of wearing the Ihram Rida for men when performing Tawaf. It is one of the Sunnahs of the Messenger, peace be upon him. It is for a man to uncover his right shoulder during Tawaf. Idtibaa came into practice when the Quraish people said about the Prophet and his companions: 'There would come to you a people whom the fever has made weak and they have suffered severely from it”, so the Messenger of Allah, peace be upon him, and his companions wanted to show their strength and briskness.",
                "",
                "Performing Tawaf in wheelchairs",
                "It is permissible for a person who is unable to walk or feels ill or tired to perform Tawaf in a wheelchair. However, he must remain awake and attentive because he is doing an act of worship. He should fill his time with Allah's remembrance and supplicating Him. Various types of wheelchairs are available for Tawaf in the Sanctuary. These wheelchairs can be found in multiple areas:",
                "Manual wheelchairs (free to the elderly and people with disabilities) are available at: The Eastern square (Mass Transit) Entrance. The Western Square (Shubaikah Gate).",
                "Electric wheelchairs (Available for booking on “Tnaqol” app): The first Mezzanine floor. Ticket locations in the Sanctuary: Ajyad - Al- Shubaikah - Al-Marwa.",
                "Wheelchair pushing service: Ground floor. 1st floor.",
                "The sunnah of prayer after Tawaf After completing Tawaf, it is recommended to pray two Rak’ahs. This is a confirmed Sunnah for everyone who has circumambulated the Ka’bah. It is prescribed to recite (Surat Al Kafirun) in the first Rak’ah, and (Surat Al Ikhlaas) in the second one.",
                "",
                "Recommended acts of Tawaf",
                "The Messenger of Allah, peace be upon him, practiced some acts during Tawaf. His companions followed him in this respect, as he, peace be upon him, said: Learn your rituals from me.",
                "Takbir: It is Sunnah for those who are in line with the Black Stone or the green light in the upper floors at the beginning and the end of each round.",
                "Supplication: The Ka’bah circumambulation is one of the greatest occasions of supplication Allah. Idtibaa: It is a Sunnah for men.",
                "Ramal: It is Sunnah for men to speed up in the first three rounds. Praying two Rak’ahs after Tawaf.",
                ""
            ]
        }
    },
    {
        "id": 3,
        "title": {
            "ar": "السعي",
            "en": "Saa’i"
        },
        "mainImagePath": "assets/images/omrah/saai.jpg",
        "details": {
            "ar": [
                "السعي بين الصفا والمروة ثالث أركان العمرة، وشعيرة عظيمة من الشعائر، قال تعالى: ﴿إن الصّفَا وَالْمَرْوَةَ مِن شَعَائِرِ اللهِ فمن حج البيت أو اعتمر فلا جناح عليه أن يطوف بهما﴾، ولا تشترط فيه الطهارة من الحدث الأصغر، وإن تطهر المعتمر فهو أفضل، وإن سعى على غير طهارة فلا حرج في ذلك، حيث يتعبد المعتمر ربه بقطع المسافة بين الصفا والمروة 7 مرات، كما فعل رسوله الكريم -صلى الله عليه وسلم-.",
                "الصفا والمروة جبلان صغيران كانت تصعد عليهما هاجَرُ أم إسماعيل -عليه السلام- بحثاً عن الطعام أو الماء، يمتد السعي بدايةً من جبل الصفا عند الصخور الظاهرة في الدور الأرضي، وعند جبل المروة ينتهي السعي، ويُسن عند الوصول إلى أول الصفا أو المروة في بداية كل شوط أن يرفع الحاج والمعتمر يديه متجهاً للقبلة، مع دعاء الله وتكبيره قبل بداية الشوط التالي، ويستحب للرجال القادرينَ الهرولةُ بين العلمين الأخضرين، كما فعل رسول الله -صلى الله عليه وسلم-.",
                "",
                "السعي بالعربات",
                "يجوز لمن لا يستطيع المشي، أو أحس بالإعياء والمرض والتعب، أن يطوف راكباً، وعليه أن يبقى مستيقظاً منتبهاً، لأن فيه عبادة، وأن يشغل وقته بالدعاء والتضرع إلى الله، وتتوفر في الحرم أنواع من العربات للطواف بها، ويمكن الوصول إلى هذه العربات بمختلف أنواعها في مناطق متعددة:",
                "العربات اليدوية (مجانية لكبار السن والأشخاص ذوي الإعاقة)",
                "",
                "وصايا السعي",
                "توجد داخل المسجد الحرام لوحات إرشادية تدلك على المسعى، وتشير إلى الصفا حيث مكان بداية السعي. تجنب الزحام في المسعى الأرضي، والتوجه إلى المسعى في الأدوار العلوية. استغلال وقت السعي بالذكر والدعاء وقراءة القرآن. الإسراع أثناء السعي للرجال يكون بين العلمين الأخضرين فقط، ولا يشمل كل مسافة السعي. استخدام العربات عند الإحساس بالمرض أو الإعياء. تجنب تلويث الحرم بقص الشعر داخل المسعى."
            ],
            "en": [
                "Saa’i between Safa and Marwa is the third pillar of Umrah. Allah said: “Indeed, Safa and Marwa are among the symbols of Allah. So, whoever makes Hajj to the House or performs Umrah - there is no blame upon him for walking between them.” It is not required to be pure from minor impurities. If the one performing Umrah purifies himself, that is better, and if he performs the Saa’i without being pure, it's acceptable too. Performer of Umrah worships his Lord by crossing the distance between Safa and Marwa seven times, as did his Messenger, peace be upon him.",
                "Safa and Marwa are two small hills on which Ismail's mother, Hagar, climbed in search of food or water. Saa’i extends from Mount Al-Safa at the rocks visible on the ground floor, and at Mount Al-Marwa the Saa’i ends. Upon reaching the beginning of Al-Safa or Al-Marwa at the beginning of each round, it is Sunnah to raise your hands, face the Qiblah and supplicate to Allah, saying: “Allahu Akbar” before starting the next round. It is recommended for capable men to run between the two green signs, following the example of the Messenger of Allah, peace be upon him.",
                "",
                "Saa’i in wheelchairs",
                "It is permissible for a person who is unable to walk or feels ill or tired to perform Saa’i in a wheelchair. However, he must remain awake and attentive because he is doing an act of worship. He should fill his time with Allah's remembrance and supplicating Him. Various types of wheelchairs are available for Saa’i in the Grand Mosque. These wheelchairs can be found at:",
                "Manual wheelchairs (free to the elderly and people with disabilities)",
                "",
                "Recommended acts of Saa’i",
                "Inside the Grand Mosque, you can find guide signs to the Massa and Al-Safa, the place where Saa’i begins. Avoid crowds on the ground floor and use the upper floors. Use the time of Saa’i for remembrance, supplication, and reading Qur’an. Men should speed up during Saa'i only between the two green flags, and not throughout the whole duration of Saa'i. You can use a wheelchair if you feel ill or tired. Beware of polluting the Grand Mosque by cutting hair inside Massa."
            ]
        }
    },
    {
        "id": 4,
        "title": {
            "ar": "الحلق أو التقصير",
            "en": "Halq or Taqsir"
        },
        "mainImagePath": "assets/images/omrah/halq.png",
        "details": {
            "ar": [
                "يُشرع حَلقُ شَعر الرأس أو تقصيرُه تعبداً لله بعد تمام النسك كما كان المحرم يتعبد الله بعدم حلقه لشعره فهو في الحالين عابد لله مستسلم له، والأفضل الحلق، لأن الرسول -صلى الله عليه وسلم- دعا للمحلقين ثلاثاً بالمغفرة والرحمة، وللمقصرين واحدة، فالأفضل الحلق، وهذا بالنسبة للرجل، أما المرأة فإنها تقص من شعرها قدر أنملة، وهناك العديد من المرافق المصرح لها بالحلاقة للمعتمرين حول الحرم المكي"
            ],
            "en": [
                "Upon completion of the Umrah rituals, it is a commendable practice to demonstrate devotion to Allah by either shaving or trimming the hair of the head. Just as the person in Ihram showed worship by not shaving, these actions symbolize worship towards Allah. For men, shaving is preferable, as the Prophet, peace be upon him, supplicated for those who shaved three times and trimmed their hair once. Women, on the other hand, may trim their hair to the length of a fingertip. Several authorized facilities near the Grand Mosque in Makkah provide safe and hygienic shaving services. These facilities are well-equipped to ensure a healthy and satisfactory experience"
            ]
        }
    },
    {
        "id": 5,
        "title": {
            "ar": "المواقيت",
            "en": "Temporal and Spatial Miqats"
        },
        "mainImagePath": "assets/images/omrah/mawakeet.jpg",
        "details": {
            "ar": [
                "تنقسم مواقيت الإحرام المحددة لقاصدي المسجد الحرام بنية تأدية الحج أو العمرة إلى قسمين:",
                "1- المواقيت الزمانية",
                "2- المواقيت المكانية",
                "وقد حددها الله تعالى تعظيماً وحرمةً لبيته الحرام، وتبرز الحكمة من مشروعيتها في تعظيم شعائره، وتعرف بأنها المواقيت التي لا يجوز للراغب في الحج أو العمرة تجاوزها إلا بإحرام، أما زمن العمرة فلا يقتصر على مدة معينة، ويصحّ أداؤها في أي وقتٍ على مدار العام.",
                "شرع الله -سبحانه وتعالى- مواقيت مكانية لأهل البلاد الإسلامية، وحددها رسوله -صلى الله عليه وسلم-، فيجب على كل من أراد العمرة أن يُحرم من الميقات الذي يمر به في طريقه، فعند وصوله إلى ميقات بلده يجب عليه التوقف للإحرام، ويحرم تجاوز الميقات دون إحرام، فإن تجاوزه دون إحرام وجب عليه الرجوع إليه، وإن أحرم بعده فعليه الفدية، عن ابن عبّاس -رضي الله عنهما-، أن النبي -صلى الله عليه وسلم- (وَقَّتَ لِأَهْلِ الْمَدِينَةِ: ذَا الْحُلَيْفَةِ، وَلِأَهْلِ الشّامِ: الْجُحْفَةَ، وَلِأَهْلِ نَجْدٍ: قَرْنَ الْمَنَازِلِ، وَلِأَهْلِ الْيَمَنِ: يَلَمْلَمَ، وقال: هُنَّ لَهُنَّ وَلِمَنْ أَتَى عَلَيْهِنَّ مِنْ غَيْرِهِنَّ مِمَّنْ أَرَادَ الْحَجَّ وَالْعُمْرَةَ).",
                "",
                "أنواع المُحرمين بالنسبة للمواقيت",
                "تختلف حالة المُحرم مع المواقيت بحسب مكانه، فهل مكانهُ بعد الميقات؟ أو بين مكة والميقات؟ أو في مكة نفسها؟ وسنوضح ذلك فيما يلي:",
                "",
                "1. من كان في مكة:",
                "يُحرم للعُمرة من أقرب مكان خارج الحرم، مثل مسجد أم المؤمنين عائشة في التنعيم.",
                "",
                "2. من كان مكانه بين مكة والميقات:",
                "يُحرم من مكانه للعُمرة، مثل أهل جدة.",
                "",
                "3. من كان مكانه بعد الميقات:",
                "يَلزَمه الإحرام من أحد المواقيت الخمسة، حسب الطريق الذي قدم منه، سواء كان بالطائرة أو عن طريق البر، ولا يتجاوزها دون إحرام.",
                "",
                "إذا كنت قادماً عبر الطريق البري، فستكون أمامك عدة مواقيت للإحرام، وهي:",
                "ذو الحُلَيْفة: ميقات أهل المدينة المنورة ومن في طريقهم.",
                "الجُحْفة: ميقات أهل الشام ومن في طريقهم.",
                "قرن المنازل: ميقات أهل نجد ومن في طريقهم.",
                "يَلَمْلَمُ: ميقات أهل اليمن ومن في طريقهم.",
                "ذات عِرْق: ميقات أهل العراق ومن في طريقهم.",
                "",
                "وفي حال قدومك بالطائرة، فسيكون عليك فقط الإحرام والتلبية عند محاذاة الميقات، وارتداء إحرامك قبل الإقلاع أو قبل محاذاة الميقات."
            ],
            "en": [
                "Ihram Miqats are divided into two parts:",
                "1- Temporal.",
                "2- Spatial.",
                "Its legitimacy lies in glorifying rituals. In order to perform Hajj or Umrah, a person must enter a state of Ihram at certain times and places. As for the time of Umrah, it is not limited to a specific period, and it is valid throughout the year. Allah prescribed spatial Miqats for Muslims in different countries, and His Messenger, peace be upon him, determined them. Anyone who wants to perform Umrah must enter Ihram from the Miqat he encounters on his way. When he reaches the Miqat of his country, he must stop to enter into Ihram. It is forbidden to pass the Miqat without assuming Ihram. If he passes it without entering Ihram, he must pay Fidyah (compensation).",
                "Narrated Ibn Abbas: Allah's Messenger, peace be upon him, made Dhul-Huiaifa as the Miqat for the people of Medina; Al-Juhfa for the people of Sham; Qarn-al-Manazil for the people of Najd; and Yalamlam for the people of Yemen; and these Mawaqit are for the people at those very places, and besides them for those who come thorough those places with the intention of performing Hajj and Umrah; and whoever is living within these boundaries can assume lhram from the place he starts, and the people of Makkah can assume Ihram from Makkah.",
                "",
                "Types of people in Ihram regarding Miqats",
                "Depending on where he lives, the Muhrim's relation with the Miqat varies. Is he located beyond the Miqat? Or between Makkah and the Miqat? Or in Makkah? All of that would be explained as follows:",
                "",
                "1. Residents of Makkah:",
                "They enter into the state of Ihram for Umrah from the nearest place outside the Grand Mosque, such as Masjid Aisha in Al Taneem.",
                "2. Who live between Makkah and the Miqat:",
                "They enter into the state of Ihram from the very place they are in, like residents of Jeddah.",
                "3. Who live beyond the Miqats:",
                "They shall enter into the state of Ihram for Umrah from one of the five Miqats, depending on the route they came by, whether by plane or by road. They should not go beyond them without entering the state of Ihram.",
                "",
                "When embarking on a road trip to perform Umrah or Hajj, there are several designated Miqats for Ihram, each serving as the official Ihram's official point for specific regions and those traveling from surrounding areas.",
                "Al-Juhfah: The Miqat for the people of the Levant and those on their way.",
                "Qarn Al Manazil: The Miqat for the people of Najd and those on their way.",
                "Yalamlam: The Miqat for the people of Yemen and those on their way.",
                "Dhat Irq: The Miqat for the people of Iraq and those on their way.",
                "",
                "For those arriving by plane, entering the state of Ihram involves reciting the Talbiyah and donning the Ihram garments before takeoff or upon approaching and aligning with the designated Miqat point. This spiritual step marks the beginning of the sacred journey for Umrah or Hajj."
            ]
        }
    },
    {
        "id": 6,
        "title": {
            "ar": "تطبيق نسك",
            "en": "Nusuk » Application"
        },
        "mainImagePath": "assets/images/omrah/nusuk.jpeg",
        "details": {
            "ar": [
                "نُسُك تعد أول منصة رسمية سعودية تتيح لك خيار التخطيط والحجز وعيش تجربة العمرة أو الحج الخاصة بك. نُسُك تتيح للمسافرين من جميع أنحاء العالم تنظيم وتخطيط جميع تفاصيل زيارتهم بسهولة، بدءا من التقدم بطلب الحصول على تأشيرة إلكترونية إلى حجز الفنادق والرحلات الجوية. مستقبلًا، سيمكنك نُسُك من جدولة الزيارات للمواقع المهمة، والعثور على وسائل النقل، وتنظيم مسارات الرحلات، والوصول إلى الخدمات على أرض الواقع مثل تعقب الطواف وغيره الكثير.",
                "",
                "https://www.nusuk.sa/ar"
            ],
            "en": [
                "Use Nusuk, the first-ever official planning, booking and experience platform, to create your Hajj or Umrah itinerary to Makkah, Madinah, and beyond. With Nusuk, travelers from all over the world can easily organize their entire visit, from applying for an eVisa to booking hotels and flights. In the future, Nusuk can also be used to schedule visits to important sites, find transportation, curate itineraries, and access on-ground tools such as the Tawaf tracker and more.",
                "",
                "https://www.nusuk.sa/en"
            ]
        }
    }
]