Repository: abd-hussain/IslamMob-mobile
Catalog: lib/l10n/app_*.arb
Languages: fa, ru, tr

# termsdesc33
source: - Termination: Islam_Mob reserves the right to suspend or terminate accounts that violate these terms or engage in unauthorized activities.
fa: - خاتمه: اسلام‌موب حق تعلیق یا خاتمه حساب‌هایی را که این شرایط را نقض می‌کنند یا در فعالیت‌های غیرمجاز دخیل می‌شوند، برای خود محفوظ می‌دارد.
ru: - Прекращение: Islam_Mob оставляет за собой право приостановить или прекратить действие учетных записей, которые нарушают данные условия или занимаются несанкционированной деятельностью.
tr: - Hesap Kapatma: Islam_Mob, bu şartları ihlal eden veya izinsiz etkinliklerde bulunan hesapları askıya alma veya kapatma hakkını saklı tutar.

# termstitle4
source: 4. Privacy Policy
fa: 4. سیاست حفظ حریم خصوصی
ru: 4. Политика конфиденциальности
tr: 4. Gizlilik Politikası

# termsdesc4
source: We are committed to protecting your privacy. Please review our Privacy Policy to understand how we collect, use, and safeguard your information.
fa: ما متعهد به حفاظت از حریم خصوصی شما هستیم. لطفاً سیاست حفظ حریم خصوصی ما را برای اطلاع از نحوه جمع‌آوری، استفاده و محافظت از اطلاعاتتان مطالعه کنید.
ru: Мы обязуемся защищать вашу конфиденциальность. Пожалуйста, ознакомьтесь с нашей Политикой конфиденциальности, чтобы узнать, как мы собираем, используем и защищаем вашу информацию.
tr: Gizliliğinizi korumayı taahhüt ediyoruz. Bilgilerinizi nasıl topladığımızı, kullandığımızı ve koruduğumuzu öğrenmek için lütfen Gizlilik Politikamızı inceleyin.

# termstitle5
source: 5. Intellectual Property
fa: 5. مالکیت فکری
ru: 5. Интеллектуальная собственность
tr: 5. Fikri Mülkiyet

# termsdesc5
source: All content within Islam_Mob, including text, graphics, logos, and software, is the property of Islam_Mob or its content suppliers and is protected by intellectual property laws. Unauthorized use of this content is prohibited.
fa: تمام محتوای اسلام‌موب، از جمله متن، گرافیک، لوگوها و نرم‌افزار، متعلق به اسلام‌موب یا تأمین‌کنندگان محتوای آن است و تحت قوانین مالکیت فکری محافظت می‌شود. استفاده غیرمجاز از این محتوا ممنوع است.
ru: Все материалы в Islam_Mob, включая тексты, графику, логотипы и программное обеспечение, принадлежат Islam_Mob или его поставщикам контента и защищены законами об интеллектуальной собственности. Несанкционированное использование этого контента запрещено.
tr: Islam_Mob içindeki tüm içerik — metinler, grafikler, logolar ve yazılımlar dahil — Islam_Mob veya içerik sağlayıcılarının mülkiyetindedir ve fikri mülkiyet yasaları ile korunmaktadır. Bu içeriğin izinsiz kullanımı yasaktır.

# termstitle6
source: 6. User Conduct
fa: 6. رفتار کاربر
ru: 6. Поведение пользователей
tr: 6. Kullanıcı Davranışı

# termsdesc61
source: Users agree not to:
fa: کاربران متعهد می‌شوند که:
ru: Пользователи соглашаются не:
tr: Kullanıcılar şunları yapmamayı kabul eder:

# termsdesc62
source: - Engage in activities that violate applicable laws or regulations.
fa: - در فعالیت‌هایی که ناقض قوانین یا مقررات جاری هستند، شرکت نکنند.
ru: - Заниматься деятельностью, нарушающей применимые законы или нормативные акты.
tr: - Geçerli yasa veya düzenlemeleri ihlal eden faaliyetlerde bulunmak.

# termsdesc63
source: - Post or transmit harmful, offensive, or inappropriate content.
fa: - محتوای مضر، توهین‌آمیز یا نامناسب ارسال یا منتشر نکنند.
ru: - Публиковать или передавать вредоносный, оскорбительный или неприемлемый контент.
tr: - Zararlı, saldırgan veya uygunsuz içerik yayınlamak veya göndermek.

# termsdesc64
source: - Attempt to interfere with the apps operation or security.
fa: - سعی در ایجاد اختلال در عملکرد یا امنیت برنامه نداشته باشند.
ru: - Пытаться мешать работе или безопасности приложения.
tr: - Uygulamanın işleyişini veya güvenliğini engellemeye çalışmak.

# termstitle7
source: 7. Limitation of Liability
fa: 7. محدودیت مسئولیت
ru: 7. Ограничение ответственности
tr: 7. Sorumluluğun Sınırlandırılması

# termsdesc7
source: Islam_Mob is provided 'as-is' without warranties of any kind. We are not liable for any damages arising from the use or inability to use the app.
fa: اسلام‌موب «همان‌طور که هست» ارائه می‌شود و هیچ ضمانتی از هیچ نوعی داده نمی‌شود. ما در قبال هرگونه خسارتی که از استفاده یا ناتوانی در استفاده از برنامه به وجود می‌آید، مسئول نیستیم.
ru: Islam_Mob предоставляется «как есть» без каких-либо гарантий. Мы не несем ответственности за любой ущерб, возникающий при использовании или невозможности использовать приложение.
tr: Islam_Mob, hiçbir garanti sunmaksızın “olduğu gibi” sağlanır. Uygulamanın kullanımından veya kullanılamamasından kaynaklanan herhangi bir zarardan sorumlu değiliz.

# termstitle8
source: 8. Changes to Terms
fa: 8. تغییرات در شرایط
ru: 8. Изменения в условиях
tr: 8. Şartların Değiştirilmesi

# termsdesc8
source: We may update these Terms and Conditions periodically. Continued use of the app after changes indicates acceptance of the new terms.
fa: ما ممکن است دوره‌ای این شرایط و قوانین را به‌روزرسانی کنیم. ادامه استفاده از برنامه پس از تغییرات به معنای پذیرش شرایط جدید است.
ru: Мы можем периодически обновлять данные Положения и условия. Продолжение использования приложения после внесения изменений означает принятие новых условий.
tr: Bu Şartlar ve Koşulları periyodik olarak güncelleyebiliriz. Değişikliklerden sonra uygulamayı kullanmaya devam etmeniz, yeni şartları kabul ettiğiniz anlamına gelir.

# quranSettingIndex
source: Index
fa: فهرست
ru: Индекс
tr: Dizin

# quranSowarIndex
source: Sowar Index
fa: فهرست سوره‌ها
ru: Индекс сур
tr: Sure Dizin

# quranPartsIndex
source: Parts Index
fa: فهرست اجزاء
ru: Индекс частей
tr: Cüz Dizin

source: Fajr
fa: فجر
ru: Фаджр
tr: Sabah

# sherooq
source: Sunrise
fa: طلوع آفتاب
ru: Восход
tr: Güneş

source: Zhur
fa: ظهر
ru: Зухр
tr: Öğle

source: Asr
fa: عصر
ru: Аср
tr: İkindi

source: Maghrib
fa: مغرب
ru: Магриб
tr: Akşam

source: Isha
fa: عشا
ru: Иша
tr: Yatsı

source: After
fa: پس از
ru: После
tr: Sonra

source: Saturday
fa: شنبه
ru: Суббота
tr: Cumartesi

source: Sunday
fa: یکشنبه
ru: Воскресенье
tr: Pazar

source: Monday
fa: دوشنبه
ru: Понедельник
tr: Pazartesi

source: Tuesday
fa: سه‌شنبه
ru: Вторник
tr: Salı

source: Wednesday
fa: چهارشنبه
ru: Среда
tr: Çarşamba

source: Thursday
fa: پنج‌شنبه
ru: Четверг
tr: Perşembe

source: Friday
fa: جمعه
ru: Пятница
tr: Cuma

# qurankareem
source: Holy Quran
fa: قرآن کریم
ru: Священный Коран
tr: Kur'ân-ı Kerîm

# mawaqeetalsalah
source: Prayer times
fa: اوقات نماز
ru: Время намаза
tr: Namaz Vakitleri

# mawaqeetalsalahdetails
source: Allow your location to be determined to accurately determine prayer times according to your location
fa: اجازه دسترسی به موقعیت شما را بدهید تا اوقات نماز بر اساس محل دقیق شما تعیین شود
ru: Разрешите определять ваше местоположение, чтобы точно рассчитать время намаза в зависимости от вашего региона
tr: Namaz vakitlerini konumunuza göre doğru belirlemek için konumunuza erişime izin verin

# mawaqeetalsalahdetails2
source: You can change that later from the settings
fa: شما می‌توانید این تنظیم را بعداً تغییر دهید
ru: Позже вы сможете изменить это в настройках
tr: Bunu daha sonra ayarlardan değiştirebilirsiniz

# allowgetlocation
source: Allow to get your location
fa: اجازه دسترسی به موقعیت
ru: Разрешить доступ к вашему местоположению
tr: Konumunuza erişime izin verin

# whyyoushouldallowlocation
source: Why should you allow your site to be accessed?
fa: چرا باید اجازه دسترسی به موقعیت را صادر کنید؟
ru: Почему вы должны разрешить доступ к вашему местоположению?
tr: Neden konum erişimini etkinleştirmelisiniz?

# whyyoushouldallowlocationdetails
source: Without allowing your location, we will not be able to accurately determine prayer times based on your location.
fa: بدون اجازه دسترسی به موقعیت، امکان تعیین دقیق اوقات نماز بر اساس مکان شما وجود نخواهد داشت.
ru: Без разрешения на определение вашего местоположения мы не сможем точно определять время намаза, основываясь на вашей локации.
tr: Konum erişimi olmadan namaz vakitlerini konumunuza göre doğru bir şekilde belirleyemeyiz.

# nolocationPermissionButton
source: Activate from settings
fa: فعال‌سازی از طریق تنظیمات
ru: Активировать в настройках
tr: Ayarlar üzerinden etkinleştir

# locationPermissionSuccses
source: Your location is correct
fa: موقعیت شما صحیح است
ru: Ваше местоположение определено корректно
tr: Konumunuz doğru

# locationPermissionSuccsesButton
source: Continue
fa: ادامه
ru: Продолжить
tr: Devam Et

source: Allow sending notifications
fa: اجازه ارسال اعلان‌ها
ru: Разрешить отправку уведомлений
tr: Bildirim gönderimine izin verin

# allowSendingNotificationsdetails
source: Allowing notifications will allow us to remind you of prayer, Khatmat, Dhikr, and other important events.
fa: اجازه اعلان‌ها به ما کمک می‌کند تا شما را در مورد نماز، ختم قرآن، ذکر و سایر رویدادهای مهم مطلع کنیم.
ru: Разрешение на уведомления позволит нам напоминать вам о намазе, хатме, зикре и других важных событиях.
tr: Bildirimlere izin vermek, sizi namaz, Hatim, Zikir ve diğer önemli etkinlikler konusunda uyarmamıza olanak sağlayacaktır.

source: Allow notifications
fa: اجازه اعلان‌ها
ru: Разрешить уведомления
tr: Bildirimlere izin ver

# notNowNotifications
source: Not Now , Will Allow it Later
fa: الان نه، بعداً اجازه می‌دهم
ru: Не сейчас, разрешу позже
tr: Şimdi Değil, Daha Sonra İzin Veririm

# whyyoushouldallownotificationdetails
source: Without allowing notifications, you will not be able to receive important notifications about prayer, Khatmat, Dhikr, and other important events.
fa: بدون اجازه اعلان‌ها، شما اعلان‌های مهم مربوط به نماز، ختم قرآن، ذکر و سایر رویدادها را دریافت نخواهید کرد.
ru: Без уведомлений вы не сможете получать важные уведомления о намазе, хатме, зикре и других важных событиях.
tr: Bildirim izni olmadan namaz, Hatim, Zikir ve diğer önemli etkinlikler hakkında önemli uyarıları alamazsınız.

# whyyoushouldallownotification
source: Why should you allow notifications?
fa: چرا باید اعلان‌ها را فعال کنید؟
ru: Почему следует разрешить уведомления?
tr: Neden bildirimlere izin vermelisiniz?

# notificationPermissionSuccses
source: Notifications are enabled
fa: اعلان‌ها فعال شدند
ru: Уведомления включены
tr: Bildirimler etkinleştirildi

source: Start your journey
fa: سفر خود را آغاز کنید
ru: Начните свое путешествие
tr: Yolculuğa Başlayın

source: Notification Settings
fa: تنظیمات اعلان‌ها
ru: Настройки уведомлений
tr: Bildirim Ayarları

source: Share App
fa: اشتراک‌گذاری برنامه
ru: Поделиться приложением
tr: Uygulamayı Paylaş

# prayCalculationSettings
source: Prayer Calculation Settings
fa: تنظیمات محاسبه اوقات نماز
ru: Настройки расчета времени намаза
tr: Namaz Hesaplama Ayarları

source: Today
fa: امروز
ru: Сегодня
tr: Bugün

source: Tomorrow
fa: فردا
ru: Завтра
tr: Yarın

source: After Two Day
fa: دو روز بعد
ru: Через два дня
tr: İki Gün Sonra

source: After Three Day
fa: سه روز بعد
ru: Через три дня
tr: Üç Gün Sonra

source: Yesterday
fa: دیروز
ru: Вчера
tr: Dün

source: Two Day Before
fa: دو روز قبل
ru: Два дня назад
tr: İki Gün Önce

source: Three Day Before
fa: سه روز قبل
ru: Три дня назад
tr: Üç Gün Önce

source: Midnight
fa: نیمه‌شب
ru: Полночь
tr: Gece Yarısı

# last3ofnight
source: Last 1/3 of Night
fa: یک‌سوم پایانی شب
ru: Последняя треть ночи
tr: Gecenin Son Üçte Biri

# shareMessageTitle
source: 🌿 Elevate Your Soul with IslamMob
fa: 🌿 روحتان را با اسلام‌موب تعالی بخشید
ru: 🌿 Поднимите свою душу с IslamMob
tr: 🌿 Ruhunuzu IslamMob ile Yükseltin

# shareMessageBody
source: 🌿 Read, Remember, and Elevate Your Soul with IslamMob, 📖 A comprehensive app that brings you the Quran, daily supplications, prayers, and much more 💡 Easy to use, inspiring spirituality and filling your heart with peace ☘ 🌷 Download now and bring yourself closer to Allah
fa: 🌿 بخوانید، به یاد بیاورید و روحتان را با اسلام‌موب ارتقا دهید. 📖 یک برنامه جامع که قرآن، ادعیه روزانه، نمازها و موارد دیگر را در اختیارتان می‌گذارد. 💡 کاربری آسان و الهام‌بخش روحانیت، همراه با آرامش قلبی ☘ 🌷 همین حالا دریافت کنید و به خداوند نزدیک‌تر شوید
ru: 🌿 Читайте, поминайте и возвышайте свою душу с IslamMob. 📖 Это универсальное приложение, которое предлагает Коран, ежедневные молитвы, намазы и многое другое. 💡 Удобное в использовании, оно вдохновляет к духовности и наполняет сердце спокойствием ☘ 🌷 Скачайте сейчас и приблизьтесь к Аллаху
tr: 🌿 Oku, hatırla ve ruhunu IslamMob ile yücelt. 📖 Sana Kur'an, günlük dualar, namazlar ve çok daha fazlasını sunan kapsamlı bir uygulama. 💡 Kolay kullanım, ruhunuzu güçlendiren ilham ve kalbinizi huzurla doldurur ☘ 🌷 Hemen indir ve Allah'a daha da yaklaş

source: Mathhab
fa: مذهب
ru: Мазхаб
tr: Mezhep

# mathhabdetails
source: Will Change Asr Prayer Time With One Hour Degree
fa: زمان نماز عصر را با یک درجه (ساعت) تغییر می‌دهد
ru: Изменит время намаза Аср на один час (по градусам)
tr: İkindi namazının vaktini bir saat (derece) ileri alır

# mathhab1Shafi
source: Shafi
fa: شافعی
ru: Шафи
tr: Şâfiî

# mathhab2Hanafi
source: Hanafi
fa: حنفی
ru: Ханафи
tr: Hanefî

source: Calculation Method
fa: روش محاسبه
ru: Метод расчета
tr: Hesaplama Yöntemi

# calculationMethodDetails
source: Change the times of Fajr and Isha prayers according to the degree or angle of Fajr and Isha
fa: زمان نماز فجر و عشا را بر اساس درجه یا زاویه تنظیم می‌کند
ru: Изменяет время Фаджр и Иша в соответствии с углом (градусом) Фаджр и Иша
tr: Sabah (Fajr) ve Yatsı (Isha) vakitlerini, derece veya açı esasına göre değiştirir

# calculationMethod1
source: Jafari / Shia Ithna-Ashari
fa: جعفری / شیعه اثنی‌عشری
ru: Джафари / Шиа Ифна-Ашари
tr: Caferî / Şiî İsna Aşerî

# calculationMethod2
source: University of Islamic Sciences, Karachi
fa: دانشگاه علوم اسلامی کراچی
ru: Университет исламских наук, Карачи
tr: University of Islamic Sciences, Karaçi

# calculationMethod3
source: Islamic Society of North America
fa: جامعه اسلامی آمریکای شمالی
ru: Исламское общество Северной Америки

# calculationMethod4
source: Muslim World League
fa: رابطهٔ جهان اسلام
ru: Мусульманская Всемирная Лига

# calculationMethod5
source: Umm Al-Qura University, Makkah
fa: دانشگاه ام‌القری (مکه)
ru: Умм Аль-Кура (Мекка)
tr: Umm Al-Qura University, Mekke

# calculationMethod6
source: Egyptian General Authority of Survey
fa: سازمان کل نقشه‌برداری مصر
ru: Главное управление по исследованиям (Египет)
tr: Mısır Genel Araştırma Kurumu

# calculationMethod7
source: Institute of Geophysics, University of Tehran
fa: مؤسسه ژئوفیزیک دانشگاه تهران
ru: Институт геофизики при Тегеранском университете
tr: Tahran Üniversitesi Jeofizik Enstitüsü

# calculationMethod8
source: Gulf Region
fa: منطقه خلیج فارس
ru: Регион Персидского залива
tr: Körfez Bölgesi

# calculationMethod9
source: Kuwait
fa: کویت
ru: Кувейт
tr: Kuveyt

# calculationMethod10
source: Qatar
fa: قطر
ru: Катар
tr: Katar

# calculationMethod11
source: Majlis Ugama Islam Singapura, Singapore
fa: مجلس علمای اسلام سنگاپور
ru: Majlis Ugama Islam Singapura (Сингапур)
tr: Majlis Ugama Islam Singapura, Singapur

# calculationMethod13
source: Diyanet İşleri Başkanlığı, Turkey
fa: سازمان دیانت ترکیه
ru: Управление по делам религии, Турция (Диянет)
tr: Diyanet İşleri Başkanlığı, Türkiye

# calculationMethod14
source: Spiritual Administration of Muslims of Russia
fa: اداره روحانیت مسلمانان روسیه
ru: Духовное управление мусульман России
tr: Rusya Müslümanları Ruhani İdaresi

# calculationMethod15
source: Dubai
fa: دبی
ru: Дубай

# calculationMethod17
source: Tunisia
fa: تونس
ru: Тунис
tr: Tunus

# calculationMethod18
source: Algeria
fa: الجزایر
ru: Алжир
tr: Cezayir

# calculationMethod19
source: KEMENAG - Kementerian Agama Republik Indonesia
fa: KEMENAG - وزارت امور دینی جمهوری اندونزی
ru: KEMENAG — Министерство по делам религии Республики Индонезия
tr: KEMENAG - Endonezya Cumhuriyeti Din İşleri Bakanlığı

# calculationMethod20
source: Morocco
fa: مراکش
ru: Марокко
tr: Fas

# calculationMethod22
source: Ministry of Awqaf, Islamic Affairs and Holy Places, Jordan
fa: وزارت اوقاف، امور اسلامی و مقدسات اردن
ru: Министерство по делам вакфов, исламских дел и святых мест (Иордания)
tr: Ürdün Evkaf, İslami İşler ve Mukaddes Mekanlar Bakanlığı

# calculationMethod23
source: Custom
fa: سفارشی
ru: Пользовательский
tr: Özel

source: Time Zone
fa: منطقه زمانی
ru: Часовой пояс
tr: Saat Dilimi

# timezoneDetails
source: Control The Time Zone Of The Calculation
fa: تنظیم منطقه زمانی برای محاسبه
ru: Управление часовым поясом при расчёте
tr: Hesaplamanın saat dilimini kontrol edin

source: Save
fa: ذخیره
ru: Сохранить
tr: Kaydet

source: Factory Reset
fa: بازنشانی به تنظیمات کارخانه
ru: Сброс к заводским настройкам
tr: Fabrika Ayarlarına Dön

source: Device Time
fa: ساعت دستگاه
ru: Время устройства
tr: Cihaz Saati

source: Application Time
fa: ساعت برنامه
ru: Время приложения
tr: Uygulama Saati

source: High Latitude
fa: عرض جغرافیایی بالا
ru: Высокая широта
tr: Yüksek Enlem

# highLatitudeDetails
source: Method of calculation in regions of high latitude
fa: روش محاسبه در مناطق با عرض جغرافیایی بالا
ru: Метод расчета для регионов с высокой широтой
tr: Yüksek enlem bölgelerinde hesaplama yöntemi

# hightLatitudeCaluclationNone
source: None
fa: هیچ
ru: Нет
tr: Yok

# hightLatitudeCaluclationAngleBasedMethod
source: Angle based method
fa: روش مبتنی بر زاویه
ru: Угловой метод
tr: Açı Temelli Yöntem

# hightLatitudeCaluclationMidnight
source: Midnight
fa: نیمه‌شب
ru: Полночь
tr: Gece Yarısı

# hightLatitudeCaluclationOneSeventh
source: 1/7 Part of the night
fa: یک‌هفتم شب
ru: 1/7 часть ночи
tr: Gecenin 1/7'si

# editPrayTimeMinManual
source: Edit Pray Time In Minutes, Manually
fa: ویرایش دستی اوقات نماز بر حسب دقیقه
ru: Редактировать время намаза вручную (в минутах)
tr: Namaz vakitlerini dakikalar bazında elle düzenle

# editPrayTimeMinManualDetails
source: Edit Pray Time In Minutes, Manually by degree
fa: تنظیم دستی اوقات نماز بر حسب درجه
ru: Настроить время намаза вручную, основываясь на градусах
tr: Derece bazında, namaz vakitlerini dakikalarla manuel olarak ayarla

# fajirCorrectionTitle
source: Fajir correction (minites)
fa: تصحیح فجر (دقیقه)
ru: Коррекция Фаджр (минуты)
tr: Sabah (Fajr) düzeltmesi (dakika)

# sunriseCorrectionTitle
source: Sunrise correction (minites)
fa: تصحیح طلوع آفتاب (دقیقه)
ru: Коррекция восхода (минуты)
tr: Güneş doğuşu düzeltmesi (dakika)

# duhorCorrectionTitle
source: Zhur correction (minites)
fa: تصحیح ظهر (دقیقه)
ru: Коррекция Зухр (минуты)
tr: Öğle (Dhuhr) düzeltmesi (dakika)

# asrCorrectionTitle
source: Asr correction (minites)
fa: تصحیح عصر (دقیقه)
ru: Коррекция Аср (минуты)
tr: İkindi (Asr) düzeltmesi (dakika)

# maghribCorrectionTitle
source: Maghrib correction (minites)
fa: تصحیح مغرب (دقیقه)
ru: Коррекция Магриб (минуты)
tr: Akşam (Maghrib) düzeltmesi (dakika)

# ishaCorrectionTitle
source: Isha correction (minites)
fa: تصحیح عشا (دقیقه)
ru: Коррекция Иша (минуты)
tr: Yatsı (Isha) düzeltmesi (dakika)

# midnightCorrectionTitle
source: Midnight correction (minites)
fa: تصحیح نیمه‌شب (دقیقه)
ru: Коррекция полуночи (минуты)
tr: Gece Yarısı düzeltmesi (dakika)

# lastThirdOfTheNightCorrectionTitle
source: Last 1/3 of Night correction (minites)
fa: تصحیح یک‌سوم پایانی شب (دقیقه)
ru: Коррекция последней трети ночи (минуты)
tr: Gecenin Son 1/3'ü düzeltmesi (dakika)
