Repository: abd-hussain/IslamMob-mobile
Catalog: lib/l10n/app_*.arb
Languages: fa, ru, tr

# appName
source: Islam Mob
fa: اسلام‌موب

# appshortdesc
source: For Every Muslim
fa: برای هر مسلمان
ru: Для каждого мусульманина
tr: Her Müslüman için

source: Submit
fa: ارسال
ru: Отправить
tr: Gönder

# quranSettingLighting
source: Lighting
fa: نور
ru: Освещение
tr: Aydınlatma

# quranSettingAddBookMark
source: Add Bookmark
fa: افزودن نشانک
ru: Добавить закладку
tr: Yer İşareti Ekle

# quranSettingRemoveBookMark
source: Remove Bookmark
fa: حذف نشانک
ru: Удалить закладку
tr: Yer İşaretini Kaldır

# quranSettingSupportUs
source: Support Us
fa: حمایت از ما
ru: Поддержать нас
tr: Bize Destek Olun

# quranSettingMushaf
source: Mus7af
fa: مصحف
ru: Мусхаф
tr: Mushaf

# reportOrSuggestion
source: Report or Suggest issue in the app
fa: گزارش مشکل یا پیشنهاد در برنامه
ru: Сообщить о проблеме или внести предложение в приложении
tr: Uygulamada bir sorun bildir veya öneride bulun

# changeSelectedLanguage
source: Change Language
fa: تغییر زبان
ru: Сменить язык
tr: Dili Değiştir

# quranJuz
source: Juz
fa: جزء
ru: Джуз
tr: Cüz

# quranSorahName1
source: Al-Fatiha
fa: سوره الفاتحه
ru: Аль-Фатиха
tr: Fâtiha

# quranSorahName2
source: Al-Baqarah
fa: سوره البقره
ru: Аль-Бакара
tr: Bakara

# quranSorahName3
source: Al-Imran
fa: سوره آل‌عمران
ru: Аль-Имран
tr: Âl-i İmrân

# quranSorahName4
source: An-Nisa
fa: سوره النسا
ru: Ан-Ниса
tr: Nisâ

# quranSorahName5
source: Al-Ma'idah
fa: سوره المائده
ru: Аль-Маида
tr: Mâide

# quranSorahName6
source: Al-An'am
fa: سوره الانعام
ru: Аль-Анам
tr: En'âm

# quranSorahName7
source: Al-A'raf
fa: سوره الاعراف
ru: Аль-Араф
tr: A'râf

# quranSorahName8
source: Al-Anfal
fa: سوره الانفال
ru: Аль-Анфаль
tr: Enfâl

# quranSorahName9
source: At-Tawbah
fa: سوره التوبه
ru: Ат-Тауба
tr: Tevbe

# quranSorahName10
source: Yunus
fa: سوره یونس
ru: Юнус
tr: Yûnus

# quranSorahName11
source: Hud
fa: سوره هود
ru: Худ
tr: Hûd

# quranSorahName12
source: Yusuf
fa: سوره یوسف
ru: Юсуф
tr: Yûsuf

# quranSorahName13
source: Ar-Ra'd
fa: سوره الرعد
ru: Ар-Ра'д
tr: Ra'd

# quranSorahName14
source: Ibrahim
fa: سوره ابراهیم
ru: Ибрахим
tr: İbrâhîm

# quranSorahName15
source: Al-Hijr
fa: سوره الحجر
ru: Аль-Хиджр
tr: Hicr

# quranSorahName16
source: An-Nahl
fa: سوره النحل
ru: Ан-Нахль
tr: Nahl

# quranSorahName17
source: Al-Isra
fa: سوره الاسراء
ru: Аль-Исра
tr: İsrâ

# quranSorahName18
source: Al-Kahf
fa: سوره الکهف
ru: Аль-Кахф
tr: Kehf

# quranSorahName19
source: Maryam
fa: سوره مریم
ru: Марьям
tr: Meryem

# quranSorahName20
source: Ta-Ha
fa: سوره طه
ru: Та-Ха
tr: Tâ-Hâ

# quranSorahName21
source: Al-Anbiya
fa: سوره الانبیا
ru: Аль-Анбийа
tr: Enbiyâ

# quranSorahName22
source: Al-Hajj
fa: سوره الحج
ru: Аль-Хадж
tr: Hac

# quranSorahName23
source: Al-Mu'minun
fa: سوره المؤمنون
ru: Аль-Му’минун
tr: Mü’minûn

# quranSorahName24
source: An-Nur
fa: سوره النور
ru: Ан-Нур
tr: Nûr

# quranSorahName25
source: Al-Furqan
fa: سوره الفرقان
ru: Аль-Фуркан
tr: Furkân

# quranSorahName26
source: Ash-Shu'ara
fa: سوره الشعراء
ru: Аш-Шуара
tr: Şuarâ

# quranSorahName27
source: An-Naml
fa: سوره النمل
ru: Ан-Намль
tr: Neml

# quranSorahName28
source: Al-Qasas
fa: سوره القصص
ru: Аль-Касас
tr: Kasas

# quranSorahName29
source: Al-Ankabut
fa: سوره العنکبوت
ru: Аль-Анкабут
tr: Ankebût

# quranSorahName30
source: Ar-Rum
fa: سوره الروم
ru: Ар-Рум
tr: Rûm

# quranSorahName31
source: Luqman
fa: سوره لقمان
ru: Лукман
tr: Lokmân

# quranSorahName32
source: As-Sajda
fa: سوره السجده
ru: Ас-Саджда
tr: Secde

# quranSorahName33
source: Al-Ahzab
fa: سوره الاحزاب
ru: Аль-Ахзаб
tr: Ahzâb

# quranSorahName34
source: Saba
fa: سوره سبأ
ru: Саба
tr: Sebe'

# quranSorahName35
source: Fatir
fa: سوره فاطر
ru: Фатыр
tr: Fâtır

# quranSorahName36
source: Ya-Sin
fa: سوره یاسین
ru: Йа-Син
tr: Yâsîn

# quranSorahName37
source: As-Saffat
fa: سوره الصافات
ru: Ас-Саффат
tr: Sâffât

# quranSorahName38
source: Sad
fa: سوره ص
ru: Сад
tr: Sâd

# quranSorahName39
source: Az-Zumar
fa: سوره الزمر
ru: Аз-Зумар
tr: Zümer

# quranSorahName40
source: Ghafir
fa: سوره غافر
ru: Гафир
tr: Gâfir

# quranSorahName41
source: Fussilat
fa: سوره فصلت
ru: Фуссилат
tr: Fussilet

# quranSorahName42
source: Ash-Shura
fa: سوره الشوری
ru: Аш-Шура
tr: Şûrâ

# quranSorahName43
source: Az-Zukhruf
fa: سوره الزخرف
ru: Аз-Зухруф
tr: Zuhruf

# quranSorahName44
source: Ad-Dukhan
fa: سوره الدخان
ru: Ад-Духан
tr: Duhân

# quranSorahName45
source: Al-Jathiya
fa: سوره الجاثیه
ru: Аль-Джасийа
tr: Câsiye

# quranSorahName46
source: Al-Ahqaf
fa: سوره الاحقاف
ru: Аль-Ахкаф
tr: Ahkâf

# quranSorahName47
source: Muhammad
fa: سوره محمد
ru: Мухаммад
tr: Muhammed

# quranSorahName48
source: Al-Fath
fa: سوره الفتح
ru: Аль-Фатх
tr: Fetih

# quranSorahName49
source: Al-Hujurat
fa: سوره الحجرات
ru: Аль-Худжурат
tr: Hucurât

# quranSorahName50
source: Qaf
fa: سوره ق
ru: Каф
tr: Kaf

# quranSorahName51
source: Adh-Dhariyat
fa: سوره الذاریات
ru: Аз-Зарият
tr: Zâriyât

# quranSorahName52
source: At-Tur
fa: سوره الطور
ru: Ат-Тур
tr: Tûr

# quranSorahName53
source: An-Najm
fa: سوره النجم
ru: Ан-Наджм
tr: Necm

# quranSorahName54
source: Al-Qamar
fa: سوره القمر
ru: Аль-Камар
tr: Kamer

# quranSorahName55
source: Ar-Rahman
fa: سوره الرحمن
ru: Ар-Рахман
tr: Rahmân

# quranSorahName56
source: Al-Waqi'a
fa: سوره الواقعه
ru: Аль-Вакиа
tr: Vâkıa

# quranSorahName57
source: Al-Hadid
fa: سوره الحدید
ru: Аль-Хадид
tr: Hadîd

# quranSorahName58
source: Al-Mujadila
fa: سوره المجادله
ru: Аль-Муджадиля
tr: Mücâdile

# quranSorahName59
source: Al-Hashr
fa: سوره الحشر
ru: Аль-Хашр
tr: Haşr

# quranSorahName60
source: Al-Mumtahina
fa: سوره الممتحنه
ru: Аль-Мумтахина
tr: Mümtehîne

# quranSorahName61
source: As-Saff
fa: سوره الصف
ru: Ас-Саф
tr: Saf

# quranSorahName62
source: Al-Jumu'a
fa: سوره الجمعه
ru: Аль-Джумуа
tr: Cuma

# quranSorahName63
source: Al-Munafiqun
fa: سوره المنافقون
ru: Аль-Мунафикун
tr: Münâfikûn

# quranSorahName64
source: At-Taghabun
fa: سوره التغابن
ru: Ат-Тагабун
tr: Teğâbün

# quranSorahName65
source: At-Talaq
fa: سوره الطلاق
ru: Ат-Талак
tr: Talâk

# quranSorahName66
source: At-Tahrim
fa: سوره التحریم
ru: Ат-Тахрим
tr: Tahrîm

# quranSorahName67
source: Al-Mulk
fa: سوره الملک
ru: Аль-Мульк
tr: Mülk

# quranSorahName68
source: Al-Qalam
fa: سوره القلم
ru: Аль-Калям
tr: Kalem

# quranSorahName69
source: Al-Haqqah
fa: سوره الحاقه
ru: Аль-Хакка
tr: Hâkka

# quranSorahName70
source: Al-Ma'arij
fa: سوره المعارج
ru: Аль-Мааридж
tr: Meâric

# quranSorahName71
source: Nuh
fa: سوره نوح
ru: Нух
tr: Nûh

# quranSorahName72
source: Al-Jinn
fa: سوره الجن
ru: Аль-Джинн
tr: Cin

# quranSorahName73
source: Al-Muzzammil
fa: سوره المزمل
ru: Аль-Муззаммиль
tr: Müzzemmil

# quranSorahName74
source: Al-Muddathir
fa: سوره المدثر
ru: Аль-Муддассир
tr: Müddessir

# quranSorahName75
source: Al-Qiyama
fa: سوره القیامه
ru: Аль-Кияма
tr: Kıyâmet

# quranSorahName76
source: Al-Insan
fa: سوره الانسان
ru: Аль-Инсан
tr: İnsan

# quranSorahName77
source: Al-Mursalat
fa: سوره المرسلات
ru: Аль-Мурсалят
tr: Mürselât

# quranSorahName78
source: An-Naba
fa: سوره النبا
ru: Ан-Наба
tr: Nebe

# quranSorahName79
source: An-Nazi'at
fa: سوره النازعات
ru: Ан-Назиат
tr: Nâziât

# quranSorahName80
source: Abasa
fa: سوره عبس
ru: Абаса
tr: Abese

# quranSorahName81
source: At-Takwir
fa: سوره التکویر
ru: Ат-Таквир
tr: Tekvîr

# quranSorahName82
source: Al-Infitar
fa: سوره الانفطار
ru: Аль-Инфитар
tr: İnfitar

# quranSorahName83
source: Al-Mutaffifin
fa: سوره المطففین
ru: Аль-Мутаффифин
tr: Mutaffifîn

# quranSorahName84
source: Al-Inshiqaq
fa: سوره الانشقاق
ru: Аль-Иншикак
tr: İnşikâk

# quranSorahName85
source: Al-Buruj
fa: سوره البروج
ru: Аль-Бурудж
tr: Burûc

# quranSorahName86
source: At-Tariq
fa: سوره الطارق
ru: Ат-Тарик
tr: Târık

# quranSorahName87
source: Al-A'la
fa: سوره الاعلی
ru: Аль-Аля
tr: A'lâ

# quranSorahName88
source: Al-Ghashiyah
fa: سوره الغاشیه
ru: Аль-Гашия
tr: Gâşiye

# quranSorahName89
source: Al-Fajr
fa: سوره الفجر
ru: Аль-Фаджр
tr: Fecr

# quranSorahName90
source: Al-Balad
fa: سوره البلد
ru: Аль-Балад
tr: Beled

# quranSorahName91
source: Ash-Shams
fa: سوره الشمس
ru: Аш-Шамс
tr: Şems

# quranSorahName92
source: Al-Lail
fa: سوره اللیل
ru: Аль-Лейль
tr: Leyl

# quranSorahName93
source: Ad-Duhaa
fa: سوره الضحی
ru: Ад-Духа
tr: Duhâ

# quranSorahName94
source: Ash-Sharh
fa: سوره الشرح
ru: Аш-Шарх
tr: İnşirâh

# quranSorahName95
source: At-Tin
fa: سوره التین
ru: Ат-Тин
tr: Tîn

# quranSorahName96
source: Al-Alaq
fa: سوره العلق
ru: Аль-Аляк
tr: Alak

# quranSorahName97
source: Al-Qadr
fa: سوره القدر
ru: Аль-Кадр
tr: Kadr

# quranSorahName98
source: Al-Bayyina
fa: سوره البینه
ru: Аль-Баййина
tr: Beyyine

# quranSorahName99
source: Az-Zalzalah
fa: سوره الزلزله
ru: Аз-Залзаля
tr: Zilzâl

# quranSorahName100
source: Al-Adiyat
fa: سوره العادیات
ru: Аль-Адият
tr: Âdiyât

# quranSorahName101
source: Al-Qari'ah
fa: سوره القارعه
ru: Аль-Кария
tr: Kâria

# quranSorahName102
source: At-Takathur
fa: سوره التکاثر
ru: Ат-Такясур
tr: Tekâsür

# quranSorahName103
source: Al-Asr
fa: سوره العصر
ru: Аль-Аср
tr: Asr

# quranSorahName104
source: Al-Humazah
fa: سوره الهمزه
ru: Аль-Хумаза
tr: Humeze

# quranSorahName105
source: Al-Fil
fa: سوره الفیل
ru: Аль-Филь
tr: Fil

# quranSorahName106
source: Quraish
fa: سوره قریش
ru: Курайш
tr: Kureyş

# quranSorahName107
source: Al-Ma'un
fa: سوره الماعون
ru: Аль-Маун
tr: Mâûn

# quranSorahName108
source: Al-Kawthar
fa: سوره الکوثر
ru: Аль-Каусар
tr: Kevser

# quranSorahName109
source: Al-Kafirun
fa: سوره الکافرون
ru: Аль-Кафирун
tr: Kâfirûn

# quranSorahName110
source: An-Nasr
fa: سوره النصر
ru: Ан-Наср
tr: Nasr

# quranSorahName111
source: Al-Masad
fa: سوره المسد
ru: Аль-Масад
tr: Mesed

# quranSorahName112
source: Al-Ikhlas
fa: سوره الاخلاص
ru: Аль-Ихлас
tr: İhlâs

# quranSorahName113
source: Al-Falaq
fa: سوره الفلق
ru: Аль-Фаляк
tr: Felak

# quranSorahName114
source: An-Nas
fa: سوره الناس
ru: Ан-Нас
tr: Nâs

# quranSorah
source: Sorah
fa: سوره
ru: Сура
tr: Sure

# reportFooterText
source: We read all of the feedback carefully, but we may not respond to each submission individually.
fa: ما همه بازخوردها را با دقت می‌خوانیم، اما ممکن است به هر گزارش یا پیشنهادی به‌صورت جداگانه پاسخ ندهیم.
ru: Мы внимательно читаем все отзывы, но можем не отвечать на каждое сообщение индивидуально.
tr: Geri bildirimleri dikkatle okuyoruz, ancak her gönderiye bireysel olarak yanıt veremeyebiliriz.

# reportandsuggestiontitle
source: Report Problem - Suggestion
fa: گزارش مشکل - پیشنهاد
ru: Сообщить о проблеме / Предложение
tr: Sorun Bildir - Öneri

# feedbackmessage
source: Your feedback is important to us, Please describe your issue here
fa: بازخورد شما برای ما مهم است، لطفاً مشکل خود را اینجا توضیح دهید
ru: Ваш отзыв важен для нас. Опишите вашу проблему здесь
tr: Geri bildiriminiz bizim için önemli, lütfen sorununuzu buraya yazınız

source: Please check your internet connection
fa: لطفاً اتصال اینترنت خود را بررسی کنید
ru: Проверьте подключение к Интернету
tr: Lütfen internet bağlantınızı kontrol edin

# pickimageremoveimage
source: Remove image
fa: حذف تصویر
ru: Удалить изображение
tr: Resmi kaldır

# pickimagefromstudio
source: Choose from Library
fa: انتخاب از گالری
ru: Выбрать из галереи
tr: Galeriden Seç

# pickimagefromcamera
source: Choose from Camera
fa: انتخاب با دوربین
ru: Выбрать с камеры
tr: Kameradan Seç

source: Photo Setting
fa: تنظیمات عکس
ru: Настройки фото
tr: Fotoğraf Ayarı

source: Set Photo
fa: تنظیم عکس
ru: Установить фото
tr: Fotoğraf Ayarla

# quranpages
source: Pages
fa: صفحات
ru: Страницы
tr: Sayfalar

source: Quran Prints
fa: نسخه‌های قرآن
ru: Издания Корана
tr: Kur'an Baskıları

source: Close
fa: بستن
ru: Закрыть
tr: Kapat

source: Reset Brightness
fa: تنظیم مجدد روشنایی
ru: Сбросить яркость
tr: Parlaklığı Sıfırla

# jusone
source: Part One
fa: جزء یکم
ru: Часть первая
tr: Birinci Cüz

# justwo
source: Part Two
fa: جزء دوم
ru: Часть вторая
tr: İkinci Cüz

# justhree
source: Part Three
fa: جزء سوم
ru: Часть третья
tr: Üçüncü Cüz

# jusfour
source: Part Four
fa: جزء چهارم
ru: Часть четвёртая
tr: Dördüncü Cüz

# jusfive
source: Part Five
fa: جزء پنجم
ru: Часть пятая
tr: Beşinci Cüz

# jussix
source: Part Six
fa: جزء ششم
ru: Часть шестая
tr: Altıncı Cüz

# jusseven
source: Part Seven
fa: جزء هفتم
ru: Часть седьмая
tr: Yedinci Cüz

# juseight
source: Part Eight
fa: جزء هشتم
ru: Часть восьмая
tr: Sekizinci Cüz

# jusnine
source: Part Nine
fa: جزء نهم
ru: Часть девятая
tr: Dokuzuncu Cüz

# justen
source: Part Ten
fa: جزء دهم
ru: Часть десятая
tr: Onuncu Cüz

# juseleven
source: Part Eleven
fa: جزء یازدهم
ru: Часть одиннадцатая
tr: On Birinci Cüz

# justwelve
source: Part Twelve
fa: جزء دوازدهم
ru: Часть двенадцатая
tr: On İkinci Cüz

# justhirteen
source: Part Thirteen
fa: جزء سیزدهم
ru: Часть тринадцатая
tr: On Üçüncü Cüz

# jusfourteen
source: Part Fourteen
fa: جزء چهاردهم
ru: Часть четырнадцатая
tr: On Dördüncü Cüz

# jusfifteen
source: Part Fifteen
fa: جزء پانزدهم
ru: Часть пятнадцатая
tr: On Beşinci Cüz

# jussixteen
source: Part Sixteen
fa: جزء شانزدهم
ru: Часть шестнадцатая
tr: On Altıncı Cüz

# jusseventeen
source: Part Seventeen
fa: جزء هفدهم
ru: Часть семнадцатая
tr: On Yedinci Cüz

# juseightteen
source: Part Eighteen
fa: جزء هجدهم
ru: Часть восемнадцатая
tr: On Sekizinci Cüz

# jusnineteen
source: Part Nineteen
fa: جزء نوزدهم
ru: Часть девятнадцатая
tr: On Dokuzuncu Cüz

# justtwenty
source: Part Twenty
fa: جزء بیستم
ru: Часть двадцатая
tr: Yirminci Cüz

# justwentyone
source: Part Twenty-One
fa: جزء بیست و یکم
ru: Часть двадцать первая
tr: Yirmi Birinci Cüz

# justwentytwo
source: Part Twenty-Two
fa: جزء بیست و دوم
ru: Часть двадцать вторая
tr: Yirmi İkinci Cüz

# justwentythree
source: Part Twenty-Three
fa: جزء بیست و سوم
ru: Часть двадцать третья
tr: Yirmi Üçüncü Cüz

# justwentyfour
source: Part Twenty-Four
fa: جزء بیست و چهارم
ru: Часть двадцать четвёртая
tr: Yirmi Dördüncü Cüz

# justwentyfive
source: Part Twenty-Five
fa: جزء بیست و پنجم
ru: Часть двадцать пятая
tr: Yirmi Beşinci Cüz

# justwentysix
source: Part Twenty-Six
fa: جزء بیست و ششم
ru: Часть двадцать шестая
tr: Yirmi Altıncı Cüz

# justwentyseven
source: Part Twenty-Seven
fa: جزء بیست و هفتم
ru: Часть двадцать седьмая
tr: Yirmi Yedinci Cüz

# justwentyeight
source: Part Twenty-Eight
fa: جزء بیست و هشتم
ru: Часть двадцать восьмая
tr: Yirmi Sekizinci Cüz

# justwentynine
source: Part Twenty-Nine
fa: جزء بیست و نهم
ru: Часть двадцать девятая
tr: Yirmi Dokuzuncu Cüz

# justhirty
source: Part Thirty
fa: جزء سی‌ام
ru: Часть тридцатая
tr: Otuzuncu Cüz

source: Downloading
fa: در حال دانلود
ru: Загрузка
tr: İndiriliyor

source: cancel
fa: انصراف
ru: Отмена
tr: İptal

source: Download
fa: دانلود
ru: Скачать
tr: İndir

source: Use
fa: استفاده
ru: Использовать
tr: Kullan

# downloadpopupmessage
source: Download can take some time, depending on your internet connection, please wait...
fa: دانلود بسته به سرعت اینترنت شما ممکن است مدتی طول بکشد، لطفاً صبر کنید...
ru: Загрузка может занять некоторое время в зависимости от скорости вашего интернета. Пожалуйста, подождите...
tr: İndirme işlemi internet bağlantınıza bağlı olarak biraz zaman alabilir, lütfen bekleyin...

# downloadnopermission
source: No permission to read and write
fa: مجوز لازم برای خواندن و نوشتن وجود ندارد
ru: Нет разрешения на чтение и запись
tr: Okuma ve yazma izni yok

# internetconnection
source: No Internet Connection
fa: ارتباط اینترنتی موجود نیست
ru: Нет подключения к Интернету
tr: İnternet Bağlantısı Yok

# titleofretry
source: retry
fa: تلاش مجدد
ru: Повторить
tr: Tekrar dene

# intenetshouldbeenableforthispage
source: In Order to Use This Feature You Need To Connect To The Internet
fa: برای استفاده از این ویژگی باید به اینترنت متصل باشید
ru: Для использования данной функции необходимо подключение к Интернету
tr: Bu özelliği kullanmak için internete bağlı olmanız gerekir

# selectprint
source: Select Edition
fa: انتخاب نسخه
ru: Выбрать издание
tr: Baskı Seç

# selectprintdetails
source: To be able to read, you must download or choose a specific edition
fa: برای مطالعه باید نسخه خاصی را دانلود یا انتخاب کنید
ru: Чтобы читать, вам нужно скачать или выбрать конкретное издание
tr: Okumak için belirli bir baskıyı indirmeniz veya seçmeniz gerekir

source: Home
fa: خانه
ru: Главная
tr: Ana Sayfa

source: Settings
fa: تنظیمات
ru: Настройки
tr: Ayarlar

source: Welcome Back
fa: خوش بازگشتید
ru: Добро пожаловать
tr: Tekrar hoş geldiniz

source: General Settings
fa: تنظیمات عمومی
ru: Общие настройки
tr: Genel Ayarlar

source: Reach out to us
fa: با ما تماس بگیرید
ru: Свяжитесь с нами
tr: Bize Ulaşın

source: Support
fa: پشتیبانی
ru: Поддержка
tr: Destek

source: Version
fa: نسخه
ru: Версия
tr: Sürüm

# rightsreserved
source: @ 2025 IslamMob. All right reserved.
fa: @ 2025 اسلام‌موب. کلیه حقوق محفوظ است.
ru: @ 2025 IslamMob. Все права защищены.
tr: @ 2025 IslamMob. Tüm hakları saklıdır.

# rateapp
source: Rate Us
fa: به ما امتیاز دهید
ru: Оцените нас
tr: Uygulamayı Değerlendirin

# rateapponstore
source: Rate Application on Store
fa: امتیاز دادن به برنامه در فروشگاه
ru: Оценить приложение в магазине
tr: Uygulamayı Mağazada Değerlendirin

# rateapponstoremessage
source: If you like this app, please take a little bit of your time to review it ! It really helps us and it shouldn't take you more than one minute.
fa: اگر از این برنامه خوشتان می‌آید، لطفاً کمی وقت بگذارید و آن را ارزیابی کنید! این کار واقعاً به ما کمک می‌کند و بیشتر از یک دقیقه طول نمی‌کشد.
ru: Если вам нравится это приложение, найдите минутку, чтобы оставить отзыв! Это очень помогает нам и займет у вас не более минуты.
tr: Bu uygulamayı beğendiyseniz, lütfen biraz zaman ayırıp değerlendirmede bulunun! Bu gerçekten bize yardımcı olur ve bir dakikanızı almaz.

source: Later
fa: بعداً
ru: Позже
tr: Daha sonra

source: Privacy Policy
fa: سیاست حفظ حریم خصوصی
ru: Политика конфиденциальности
tr: Gizlilik Politikası

# termsandconditions
source: Terms & Conditions
fa: شرایط و قوانین
ru: Положения и условия
tr: Şartlar ve Koşullar

source: About Us
fa: درباره ما
ru: О нас
tr: Hakkımızda

# appmaindesc
source: Islam-Mob is a beautifully designed and intuitive app tailored to the needs of Muslims around the world. With its elegant interface and user-friendly experience. Whether you're at home or on the go, Islam-Mob is here to help you stay connected to your faith with ease and convenience
fa: اسلام‌موب یک برنامه زیبا و شهودی است که با در نظر گرفتن نیازهای مسلمانان سراسر دنیا طراحی شده است. با رابط کاربری چشم‌نواز و تجربه‌ای کاربرپسند، چه در خانه باشید چه در سفر، اسلام‌موب به شما کمک می‌کند تا به آسانی با ایمان خود در ارتباط بمانید.
ru: Islam-Mob — это красивое и интуитивно понятное приложение, разработанное с учётом потребностей мусульман во всём мире. Благодаря элегантному интерфейсу и удобству в использовании, Islam-Mob помогает вам оставаться на связи со своей верой где бы вы ни находились — дома или в пути.
tr: Islam-Mob, dünya genelindeki Müslümanların ihtiyaçlarına göre uyarlanmış, şık tasarımlı ve kullanımı kolay bir uygulamadır. Zarif arayüzü ve kullanıcı dostu deneyimiyle, evde veya hareket halindeyken dahi dininizle kolay ve rahat bir şekilde bağlantıda kalmanıza yardımcı olur.

# about1
source: 🕌 Dua & Azkar
fa: 🕌 دعا و اذکار
ru: 🕌 Ду'а и Азкар
tr: 🕌 Dua & Zikirler

# about2
source: 📖 Qur'an Reading
fa: 📖 قرائت قرآن
ru: 📖 Чтение Корана
tr: 📖 Kur'an Okuma

# about3
source: 🌙 Islamic Calendar
fa: 🌙 تقویم اسلامی
ru: 🌙 Исламский календарь
tr: 🌙 İslami Takvim

# about4
source: 🛕 Find Nearby Mosques
fa: 🛕 پیدا کردن مساجد نزدیک
ru: 🛕 Поиск ближайших мечетей
tr: 🛕 Yakınınızdaki Camileri Bulun

# about5
source: 🕌 Accurate Prayer Times
fa: 🕌 اوقات دقیق نماز
ru: 🕌 Точное время намаза
tr: 🕌 Doğru Namaz Vakitleri

# about6
source: 🔔 Reminders & Notifications
fa: 🔔 یادآوری‌ها و اعلان‌ها
ru: 🔔 Напоминания и уведомления
tr: 🔔 Hatırlatmalar & Bildirimler

# about7
source: 📚 Islamic Articles & Resources
fa: 📚 مقالات و منابع اسلامی
ru: 📚 Исламские статьи и ресурсы
tr: 📚 İslami Makaleler & Kaynaklar

# appmaindesc2
source: Islam-Mob is more than just an app; it's your faithful companion in every aspect of your Islamic journey
fa: اسلام‌موب فراتر از یک برنامه است؛ همراه وفادار شما در تمامی ابعاد سفر معنوی‌تان.
ru: Islam-Mob — это не просто приложение; это ваш верный спутник во всех аспектах вашего исламского пути.
tr: Islam-Mob bir uygulamadan daha fazlasıdır; İslami yolculuğunuzun her aşamasında sadık bir yol arkadaşınızdır.

source: Support Us
fa: از ما حمایت کنید
ru: Поддержите нас
tr: Bize Destek Olun

# termstitle1
source: 1. Introduction
fa: 1. مقدمه
ru: 1. Введение
tr: 1. Giriş

# termsdesc1
source: Welcome to Islam_Mob. By accessing or using this application, you agree to comply with these Terms and Conditions. If you do not agree, please refrain from using the app.
fa: به اسلام‌موب خوش آمدید. با دسترسی یا استفاده از این برنامه، شما موافقت می‌کنید که از این شرایط و قوانین پیروی کنید. اگر موافق نیستید، لطفاً از برنامه استفاده نکنید.
ru: Добро пожаловать в Islam_Mob. Получая доступ или используя это приложение, вы соглашаетесь соблюдать данные Положения и условия. Если вы не согласны, пожалуйста, не используйте это приложение.
tr: Islam_Mob'a hoş geldiniz. Bu uygulamaya erişerek veya kullanarak bu Şartlar ve Koşullara uymayı kabul etmiş olursunuz. Kabul etmiyorsanız, lütfen uygulamayı kullanmayınız.

# termstitle2
source: 2. Use of the App
fa: 2. استفاده از برنامه
ru: 2. Использование приложения
tr: 2. Uygulamanın Kullanımı

# termsdesc2
source: Islam_Mob provides Islamic content, including the Quran, prayers, and other resources. This content is intended for personal, non-commercial use. Unauthorized distribution or commercial exploitation is prohibited.
fa: اسلام‌موب محتوای اسلامی از جمله قرآن، دعاها و سایر منابع را ارائه می‌دهد. این محتوا برای استفاده شخصی و غیرتجاری است. توزیع یا بهره‌برداری تجاری بدون مجوز ممنوع است.
ru: Islam_Mob предоставляет исламский контент, включая Коран, молитвы и другие ресурсы. Этот контент предназначен для личного, некоммерческого использования. Несанкционированное распространение или коммерческое использование запрещены.
tr: Islam_Mob, Kur'an, dualar ve diğer kaynaklar dahil olmak üzere İslami içerik sunar. Bu içerik kişisel ve ticari olmayan kullanım içindir. İzinsiz dağıtım veya ticari kullanım yasaktır.

# termstitle3
source: 3. User Accounts
fa: 3. حساب‌های کاربری
ru: 3. Учетные записи пользователей
tr: 3. Kullanıcı Hesapları

# termsdesc31
source: - Registration: Users may need to create an account to access certain features. Ensure that the information provided is accurate and up-to-date.
fa: - ثبت‌نام: برای دسترسی به برخی قابلیت‌ها ممکن است نیاز به ساخت حساب کاربری باشد. اطمینان حاصل کنید که اطلاعات ارائه‌شده دقیق و به‌روز باشد.
ru: - Регистрация: Для доступа к некоторым функциям может потребоваться создание учетной записи. Убедитесь, что предоставляемая информация точна и актуальна.
tr: - Kayıt: Bazı özelliklere erişim için kullanıcıların bir hesap oluşturması gerekebilir. Sağlanan bilgilerin doğru ve güncel olduğundan emin olun.

# termsdesc32
source: - Security: You are responsible for maintaining the confidentiality of your account credentials and for all activities under your account.
fa: - امنیت: شما مسئول نگهداری محرمانه اطلاعات حساب خود و تمامی فعالیت‌هایی هستید که تحت آن حساب انجام می‌شود.
ru: - Безопасность: Вы несёте ответственность за конфиденциальность учетных данных и за все действия, совершаемые под вашей учетной записью.
tr: - Güvenlik: Hesap bilgilerinizi gizli tutmaktan ve hesabınız altındaki tüm faaliyetlerden siz sorumlusunuz.
